[
  {
    "companyId": 1503,
    "companyName": "SKY BRIDGE BUSINESS FUNDING, LLC",
    "leaderName": "Revenued Leadership",
    "leaderTitle": "Parent Company",
    "leaderBg": "Sky Bridge Business Funding was acquired by fintech company Revenued in July 2020 and rebranded as Horizon Business Funding. Revenued was founded in 2018 and has provided over $684M in financing to 18,000+ businesses. During 2020-2021, Horizon helped provide over $4B in PPP funding to 110K+ businesses."
  },
  {
    "companyId": 1527,
    "companyName": "Financial Pacific Leasing",
    "leaderName": "Stephen E. Leege",
    "leaderTitle": "SVP, Chief Credit Officer",
    "leaderBg": "SVP and Chief Credit Officer at Financial Pacific Leasing since January 2015. Responsible for all aspects of credit risk management including credit policy, underwriting, and scorecard management. Chairs the risk management committee. Previously spent 7 years as Director of Credit at CIT Equipment Finance."
  },
  {
    "companyId": 1527,
    "companyName": "Financial Pacific Leasing",
    "leaderName": "Jodi L. Wilshire",
    "leaderTitle": "EVP & CFO",
    "leaderBg": "Executive Vice President and Chief Financial Officer at Financial Pacific Leasing. With FinPac since 1998, rose through the ranks over 25+ years."
  },
  {
    "companyId": 1545,
    "companyName": "RidgeStone Capital",
    "leaderName": "Henrique Silva",
    "leaderTitle": "CEO",
    "leaderBg": "CEO of RidgeStone Capital since its 2020 incorporation in Irvine, CA. Company specializes in equipment financing, expansion capital, inventory funding, and working capital. Serves construction, medical, manufacturing, and franchise industries. Limited public information available about personal background."
  },
  {
    "companyId": 1557,
    "companyName": "ACE FUNDING",
    "leaderName": "Ace Partners Leadership",
    "leaderTitle": "Management Team",
    "leaderBg": "Ace Partners (also Ace Funding) provides revenue-based funding solutions including MCA, lines of credit, and equipment financing to small businesses nationwide. Approves businesses for 100-150% of gross monthly income. Limited public information on specific leadership."
  },
  {
    "companyId": 1558,
    "companyName": "National Capital",
    "leaderName": "National Capital Leadership",
    "leaderTitle": "Management Team",
    "leaderBg": "National Capital operates a business lending marketplace connecting SMBs to multiple lenders through a single application process with a 90% approval rate. Offers term loans, SBA loans, lines of credit, MCA, equipment financing, and invoice factoring. Limited public information on specific leadership."
  },
  {
    "companyId": 1561,
    "companyName": "Accord Business Funder",
    "leaderName": "Founders",
    "leaderTitle": "Co-Founders",
    "leaderBg": "Two Texans with nearly 5 decades of combined commercial funding experience who founded Accord in 2013."
  },
  {
    "companyId": 1569,
    "companyName": "One Park",
    "leaderName": "John Lie-Nielsen",
    "leaderTitle": "CEO & Founder",
    "leaderBg": "Serial entrepreneur since 1999 who founded ACA Financial LLC that year and One Park Financial in 2010 in Miami. Named Most Influential CEO 2023 - Florida by CEO-Monthly Magazine. Member of Orange Bowl Committee and 2026 Miami Host Committee for College Football Playoff Championship. Company named Sun Sentinel Top Workplace 8 times and Great Place to Work certified 8 consecutive years."
  },
  {
    "companyId": 1569,
    "companyName": "One Park",
    "leaderName": "Eric Cunningham",
    "leaderTitle": "COO",
    "leaderBg": "Chief Operations Officer of One Park Financial. Based in Frisco, Colorado. Oversees the company's lending partner network and operations connecting merchants with 20+ private business lenders across 48 states."
  },
  {
    "companyId": 1579,
    "companyName": "Cap Fund",
    "leaderName": "Cap Fund Leadership",
    "leaderTitle": "Management Team",
    "leaderBg": "Cap Fund provides merchant cash advances and working capital solutions to small businesses. Appears to be related to or share website with CapFront. Limited public information available on specific leadership or distinct operations."
  },
  {
    "companyId": 1580,
    "companyName": "Green Capital",
    "leaderName": "Green Capital Leadership",
    "leaderTitle": "Management Team",
    "leaderBg": "Green Capital provides business cash advances with flexible repayment through daily ACH and split funding, serving small business owners from New Jersey. Compatible with multiple payment processors. Limited public information on specific leadership."
  },
  {
    "companyId": 1583,
    "companyName": "24 CAPITAL",
    "leaderName": "24 Capital Leadership",
    "leaderTitle": "Management Team",
    "leaderBg": "24 Capital is a Miami-based direct funder providing business loans, SBA loans, equipment financing, lines of credit, and revenue-based financing. Known for 24-hour funding speed, working with businesses regardless of credit history. Limited public information on specific leadership."
  },
  {
    "companyId": 1592,
    "companyName": "AMERICAN SIMULUS FUNDING CORPS",
    "leaderName": "Lisa Principato",
    "leaderTitle": "President/Owner",
    "leaderBg": "President and co-owner of American Stimulus Funding Corp. Oversees operations of the family-run MCA business alongside founder Lawrence Principato."
  },
  {
    "companyId": 1630,
    "companyName": "EAGLE CAPITAL",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Operates as Quick Capital Fund providing MCA and business funding solutions in New York. Limited public information available about leadership team."
  },
  {
    "companyId": 1633,
    "companyName": "EBF HOLDINGS LLC",
    "leaderName": "Scott Crockett",
    "leaderTitle": "CEO & Founder",
    "leaderBg": "Serial entrepreneur who founded Everest Business Funding (originally Whetstone Holdings LLC) in Miami. Previously founded Allied Cash Holdings in 1999, growing it to 250+ stores with $60M+ annual revenue and 700 employees before successful buyout in 2009. Began career at NationsBanc Montgomery Securities. BA from Tulane University. Raised $500M+ in capital across career. Company won 2025 Best and Brightest Workplace award."
  },
  {
    "companyId": 1644,
    "companyName": "FAST CASH FUNDING",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads Fast Cash Funding's MCA operations providing up to $1M in same-day funding across all industries in Florida. Limited public information available about specific leadership."
  },
  {
    "companyId": 1656,
    "companyName": "FUSION CAPITAL",
    "leaderName": "Christian Reynolds",
    "leaderTitle": "Director",
    "leaderBg": "Director of Fusion Capital based in North Myrtle Beach, South Carolina. Company is BBB accredited since 2010 and generated ~$6M annual revenue in 2023. Provides small business loans, working capital financing, and business lines of credit. Limited additional public background information on Reynolds specifically."
  },
  {
    "companyId": 1676,
    "companyName": "INFINITY CAPITAL",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads Infinity Capital's technology-driven MCA and business lending operations with 24-hour decision-making from Oklahoma. Limited public information available about specific leadership."
  },
  {
    "companyId": 1708,
    "companyName": "NETFUNDING",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads NetFunding's operations with approximately 430 employees in Texas, providing business funding solutions. Limited public information available about specific leadership."
  },
  {
    "companyId": 1737,
    "companyName": "ROYAL FUNDING",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads Royal Funding Group's operations at 180 Maiden Lane in NYC, with over $1B funded and 15+ financing products. Limited public information available about specific leadership."
  },
  {
    "companyId": 1746,
    "companyName": "SMALL BUSINESS FUNDING",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads Small Business Funding's operations from King of Prussia, PA, providing fast business funding nationwide for over 12 years. Limited public information available about specific leadership."
  },
  {
    "companyId": 1757,
    "companyName": "TBF Group",
    "leaderName": "Adam Boehm",
    "leaderTitle": "CFO",
    "leaderBg": "Co-founded TBF Financial in 1998 with father and brother. Took over as CFO from his father Robert in 2022. Created and maintains TBF's proprietary Data Driven True Market Pricing algorithm using 27+ years of debt recovery data. Recently launched MarkTrue, upgraded pricing algorithm for greater accuracy and speed. Indiana University finance degree."
  },
  {
    "companyId": 1759,
    "companyName": "THRIVE FUNDING",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads Thrive Funding's institutional private credit operations serving the middle market from Utah. Limited public information available about specific leadership."
  },
  {
    "companyId": 1761,
    "companyName": "TIGER CAPITAL",
    "leaderName": "Dov L.",
    "leaderTitle": "CEO",
    "leaderBg": "Leads Tiger Capital Funding's unsecured business financing operations. Company founded in 2016 and has served 5,000+ businesses nationwide with fast 24-hour decisions. Provides bridge loans, lines of credit, debt consolidations, inventory financing, and revenue-based advances. Miami-based. Limited additional public background information available."
  },
  {
    "companyId": 1769,
    "companyName": "UNITED FIRST FUNDING",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Founded by a group of investment banking, commercial banking, and mortgage banking experts at 800 Third Ave, New York. Provides MCAs, business loans, invoice factoring, and equipment financing. Limited public information available about specific leadership."
  },
  {
    "companyId": 1778,
    "companyName": "Imperial Advance",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Executives with 30+ years of combined experience in lending. Now operating as Funderial from 65 W 36th St, Suite 901, New York. Over $2B in business loans funded nationwide. Rebranded from Imperial Advance to Funderial. Offers financing from 160+ lending partners including lines of credit, SBA loans, and MCAs. Minimum credit score 500 accepted."
  },
  {
    "companyId": 1779,
    "companyName": "Imperial Funding",
    "leaderName": "Christopher Shepard",
    "leaderTitle": "EVP, Head of Investment Banking & Capital Markets",
    "leaderBg": "Executive Vice President leading Imperial Capital's investment banking and capital markets divisions. 25+ years experience in financings, M&A, and restructurings. Previously Associate at Milbank Tweed Hadley & McCloy (NYC-based law firm) specializing in public securities and M&A transactions. BS in Accounting, MBA, and JD all from University of Michigan."
  },
  {
    "companyId": 1781,
    "companyName": "Revenue Funding",
    "leaderName": "Management Team",
    "leaderTitle": "Leadership",
    "leaderBg": "Leads Revenue Funding's MCA and revenue-based financing operations in Florida. Limited public information available about specific leadership."
  },
  {
    "companyId": 1785,
    "companyName": "YELLOWSTONE CAPITAL",
    "leaderName": "Isaac Stern",
    "leaderTitle": "Former CEO",
    "leaderBg": "Co-founded Yellowstone Capital in 2009. In January 2025, settled with NY Attorney General for $1.065B — one of the largest predatory lending settlements in history. Permanently banned from the merchant cash advance industry. Company found to have exploited small businesses with fraudulent loans disguised as MCAs at interest rates up to 820% per year. Settlement delivered $534M in debt relief and $16.1M in restitution to 18,000+ affected businesses nationwide."
  }
]