[
  {
    "companyId": 1027,
    "companyName": "Marco",
    "leaderName": "Peter Spradling",
    "leaderTitle": "COO & Co-Founder",
    "leaderBg": "Manages day-to-day business development and operations across Marco's multi-country platform spanning US, Latin America, and Uruguay."
  },
  {
    "companyId": 1027,
    "companyName": "Marco",
    "leaderName": "Nik Bougalis",
    "leaderTitle": "CTO",
    "leaderBg": "Cryptographer and software engineer with 20+ years experience. Previously Director of Engineering at Ripple Labs for nearly 10 years, where he built and maintained the XRP Ledger codebase and earned 3 patents in cryptography. Later named CTO of Algorand Foundation in Sep 2025. At Marco, led engineering team building cross-border trade finance infrastructure. C++ specialist."
  },
  {
    "companyId": 1028,
    "companyName": "North Mill Equipment Finance LLC",
    "leaderName": "Mark L. Bonanno",
    "leaderTitle": "President & COO",
    "leaderBg": "Co-leads NMEF's operations and culture transformation alongside CEO David Lee."
  },
  {
    "companyId": 1028,
    "companyName": "North Mill Equipment Finance LLC",
    "leaderName": "Steve Siler",
    "leaderTitle": "CTO",
    "leaderBg": "Appointed September 2025. Nearly 20 years driving technology transformation in asset-backed finance and private credit. Also appointed CTO at eCapital around the same time."
  },
  {
    "companyId": 1029,
    "companyName": "inKind",
    "leaderName": "Bryan Crow",
    "leaderTitle": "CTO & Co-Founder",
    "leaderBg": "Leads technology development for inKind's restaurant financing and consumer dining platform connecting 4M+ users to 6,000+ restaurant partners."
  },
  {
    "companyId": 1029,
    "companyName": "inKind",
    "leaderName": "Jonathan de Wolff",
    "leaderTitle": "Chief Sustainability Officer",
    "leaderBg": "Co-founder focused on sustainable and equitable restaurant funding practices. Unique C-suite title in the fintech space."
  },
  {
    "companyId": 1031,
    "companyName": "Kabbage",
    "leaderName": "Kathryn Petralia",
    "leaderTitle": "Co-Founder",
    "leaderBg": "Co-founded Kabbage in 2009 and helped build it into a leading alternative small business lender before the AmEx acquisition in 2020. Co-founded Keep Financial Technologies with Rob Frohwein, backed by Andreessen Horowitz $9M seed."
  },
  {
    "companyId": 1032,
    "companyName": "Aspiria",
    "leaderName": "Mario Di Vece",
    "leaderTitle": "Co-Founder",
    "leaderBg": "Co-developed Aspiria's business model, statistical credit scoring models, processes, and fully digital lending technology from a garage startup in Guadalajara. Series A funded by social impact investor Oikocredit."
  },
  {
    "companyId": 1033,
    "companyName": "Capchase",
    "leaderName": "Przemek Gotfryd",
    "leaderTitle": "Co-Founder",
    "leaderBg": "Technical co-founder driving Capchase's revenue-based financing platform development."
  },
  {
    "companyId": 1033,
    "companyName": "Capchase",
    "leaderName": "Ignacio Moreno Pubul",
    "leaderTitle": "Co-Founder",
    "leaderBg": "Co-founded Capchase in May 2020 to help SaaS companies access non-dilutive capital."
  },
  {
    "companyId": 1037,
    "companyName": "Pursuit Lending",
    "leaderName": "Rich Amsterdam",
    "leaderTitle": "EVP & Chief Credit Officer",
    "leaderBg": "Oversees all credit functions including analysis, internal lending, lender service provider teams, and portfolio management at Pursuit."
  },
  {
    "companyId": 1037,
    "companyName": "Pursuit Lending",
    "leaderName": "James Goldrick",
    "leaderTitle": "EVP & Chief Lending Officer",
    "leaderBg": "Oversees the metropolitan New York market including NYC, Long Island, Northern NJ, and Hudson Valley for Pursuit's SBA lending programs."
  },
  {
    "companyId": 1038,
    "companyName": "Driven (formerly Thinking Capital)",
    "leaderName": "Stephane Marceau",
    "leaderTitle": "Former CEO, Driven",
    "leaderBg": "Appointed President and CEO of Thinking Capital in October 2019, bringing 20+ years of experience leading data and technology-centric businesses including executive roles at Bell Canada and Yellow Pages, and as a serial tech entrepreneur building AI-powered companies. Led the rebrand from Thinking Capital to Driven in 2022 before departing in 2023."
  },
  {
    "companyId": 1040,
    "companyName": "GoCurrency",
    "leaderName": "Vikas Agrawal",
    "leaderTitle": "CEO",
    "leaderBg": "Leads Currency (GoCurrency) as the financial technology arm of Sandhills Global, providing equipment financing, leasing, working capital, and aviation financing solutions across the US and Canada. Limited public information available on personal background."
  },
  {
    "companyId": 1042,
    "companyName": "Libertas",
    "leaderName": "John Paradisi",
    "leaderTitle": "CEO",
    "leaderBg": "25+ years of leadership across commercial/consumer banking, specialty lending, and capital markets. Named President and COO at Libertas in May 2025, then promoted to CEO effective January 2026. Previously EVP and Chief Specialty Banking Officer at City National Bank of Florida. Spent 17 years at CIT Bank in consumer banking, commercial banking, corporate strategy, M&A, and business development, rising to Chief Strategy Growth Officer."
  },
  {
    "companyId": 1045,
    "companyName": "Avtech Capital",
    "leaderName": "Chris Emery",
    "leaderTitle": "CFO",
    "leaderBg": "Oversees financial operations for Avtech Capital's multi-industry equipment leasing business, which generated $46.9M in revenue in 2025."
  },
  {
    "companyId": 1048,
    "companyName": "Purpose Unlimited",
    "leaderName": "Stephane Marceau",
    "leaderTitle": "Former CEO, Driven Financial",
    "leaderBg": "25+ years of product development and leadership experience. Held executive roles at Bell Canada and Yellow Pages. Serial tech entrepreneur who built AI-powered companies. Led the Thinking Capital to Driven rebrand in 2022 before departing in 2023."
  },
  {
    "companyId": 1050,
    "companyName": "Commercial Funding Inc.",
    "leaderName": "Dan McDonough",
    "leaderTitle": "President & CEO",
    "leaderBg": "Founded Commercial Credit Inc. and serves as President & CEO of subsidiary Commercial Funding Inc. Career in equipment finance since 1986, starting as a credit analyst at First Interstate Credit Alliance. Co-founded the Chicago office of Financial Federal Credit Inc., ultimately managing two national divisions and two branch locations. MBA from DePaul University."
  },
  {
    "companyId": 1050,
    "companyName": "Commercial Funding Inc.",
    "leaderName": "Buddy Zarbock",
    "leaderTitle": "VP",
    "leaderBg": "Recently added VP bringing additional leadership to Commercial Funding's operations in invoice factoring, AR financing, and asset-based lending across industries including transportation, oil and gas, construction, manufacturing, and staffing."
  },
  {
    "companyId": 1089,
    "companyName": "LeasePoint Funding Group",
    "leaderName": "Jessi Roesch",
    "leaderTitle": "Director of Operations",
    "leaderBg": "10+ years of operations and leadership experience across banking, heavy industry, consumer services, and technology. Former global commercial credit operations leader at General Electric, managing large international teams. Held executive roles at Spruce, Degreed, and GE. At LeasePoint, oversees core operations, people operations, product management, and sales support. Also active in climate advocacy, participating in the Climate Action Young Leaders Summit 2024."
  },
  {
    "companyId": 1093,
    "companyName": "Amerifi",
    "leaderName": "Amit",
    "leaderTitle": "Principal",
    "leaderBg": "Leads Amerifi Capital as principal with 15+ aggregate years of experience in finance and business lending. Founded Amerifi Capital in 2018 as a direct funder focused on real underwriting. Company offers working capital up to $8M based on revenue performance with 24-hour funding capability. Contact: amit@amerificapital.com. Limited additional public information available on personal background."
  },
  {
    "companyId": 1097,
    "companyName": "TVT Capital",
    "leaderName": "John F. Porcello",
    "leaderTitle": "Principal",
    "leaderBg": "Principal at TVT Capital. Long-standing figure in the MCA and alternative lending space. Limited additional public information available on personal background."
  },
  {
    "companyId": 1101,
    "companyName": "Aztec Financial",
    "leaderName": "John Sirrine",
    "leaderTitle": "President & CFO",
    "leaderBg": "Co-founded Aztec Financial in 1997 with the Hanks brothers (owners of Bridgewater Companies). Served as CFO and led the company as President through growth as a leading equipment finance provider for specialty contractors in cleaning, restoration, and surface preparation industries. In 2021, Aramsco sold 100% of stock of Aztec's parent to North Mill Equipment Finance and Taycor Financial. North Mill assumed the existing portfolio while Taycor assumed vendor relationships and origination capabilities."
  },
  {
    "companyId": 1109,
    "companyName": "Par Funding",
    "leaderName": "Joseph LaForte",
    "leaderTitle": "Former Co-Founder (Sentenced)",
    "leaderBg": "Former co-founder of Par Funding (Complete Business Solutions Group). Sentenced on March 26, 2025 to 186 months (15.5 years) in prison by Judge Mark A. Kearney for operating a fraudulent investment vehicle. Pled guilty in September 2024 to RICO conspiracy, securities fraud, tax crimes, and perjury. Ordered to forfeit a private jet and $20M investment account, $120M forfeiture money judgment, $314M restitution, and $50,000 fine. Par Funding used threats of violence to collect from overdue MCA customers."
  },
  {
    "companyId": 1109,
    "companyName": "Par Funding",
    "leaderName": "Lisa McElhone",
    "leaderTitle": "Former Co-Founder (Pled Guilty)",
    "leaderBg": "Former co-founder of Par Funding and wife of Joseph LaForte. LaForte used McElhone as his nominee to conceal his ownership and control of Par Funding. Claimed net worth of nearly $800M at one point. Pled guilty to wire fraud. Prosecutors recommended less than 2.5 years in prison. Receiver sold their Jupiter, FL home after RICO sentencing."
  },
  {
    "companyId": 1110,
    "companyName": "TMC Community Capital",
    "leaderName": "Daniel Fernandez",
    "leaderTitle": "CEO",
    "leaderBg": "First full-time CEO of TMC Community Capital. Born in East San Jose. Former small business banker at Chase Bank, where he created a partnership with nonprofit microlender Opportunity Fund to refer applicants who didn't qualify for traditional loans. Former VP of community development at USC Credit Union focusing on South Central LA. Previously at Mocafi (now Mobility Capital Finance) fintech. Opened new downtown San Jose office in 2024."
  },
  {
    "companyId": 1495,
    "companyName": "RIVERPOINT FINANCIAL GROUP INC. d/b/a Redwood Capital Solutions d/b/a Express Capital Group",
    "leaderName": "Yisrael Anatian",
    "leaderTitle": "President",
    "leaderBg": "President of Riverpoint Capital since founding. Family-run business with Sruli Anatian (CEO) and Esther Anatian (COO). Based in Hollywood, FL with a second office in New York. Over a decade of experience providing short-term business loans, bridge financing, lines of credit, and equipment financing."
  },
  {
    "companyId": 1501,
    "companyName": "Shore Funding Solutions Inc.",
    "leaderName": "Philip Teseo",
    "leaderTitle": "Co-CEO",
    "leaderBg": "Co-Chief Executive Officer at Shore Funding Solutions since founding in 2014. Based in Melville, NY. Has grown the company to facilitate over $1 billion in funding with 80+ professionals. Achieved Inc. 5000 ranking at #4162 in 2025. Maintains 100% CEO approval rating on Glassdoor."
  },
  {
    "companyId": 1501,
    "companyName": "Shore Funding Solutions Inc.",
    "leaderName": "Lauretta Teseo",
    "leaderTitle": "President",
    "leaderBg": "President overseeing Shore Funding Solutions' operations and strategic direction from Melville, NY headquarters. Part of the family leadership team that built Shore into a billion-dollar funding platform."
  },
  {
    "companyId": 1502,
    "companyName": "Signet Capital Group Inc.",
    "leaderName": "Menachem Skolnik",
    "leaderTitle": "Director",
    "leaderBg": "Director at Signet Capital Group overseeing company strategy and operations in the small business financing space. Part of family-run leadership structure."
  }
]