[
  {
    "id": 1621,
    "name": "CREST CAPITAL",
    "desc": "Equipment financing and leasing company based in Alpharetta, Georgia, founded in 1989. Specializes in providing equipment leasing and financing solutions up to $500K for small and medium-sized businesses.",
    "contacts": [
      {"n": "Mark French", "t": "CEO"},
      {"n": "Michael Marcin", "t": "CFO"}
    ],
    "leaders": [
      {"n": "Mark French", "t": "CEO", "bg": "Leads Crest Capital's equipment financing operations serving SMBs nationwide since 1989.", "li": ""},
      {"n": "Michael Marcin", "t": "CFO", "bg": "Oversees financial operations for one of the top-rated equipment financing companies in the US.", "li": ""}
    ],
    "news": [
      {"h": "Crest Capital Ranked #1 Best Equipment Financing for 2026", "s": "Business News Daily, 2026", "d": "Crest Capital received top marks for equipment financing with loans up to $500K and terms from 24 to 84 months."},
      {"h": "Section 179 Tax Deduction Promotion for 2026", "s": "CrestCapital.com, 2026", "d": "Crest Capital is actively promoting Section 179 tax deductions up to $2.56M for equipment purchases in 2026."}
    ],
    "ice": "Congratulations on being ranked #1 for equipment financing again -- with 35+ years in the business, how are you thinking about incorporating AI into your underwriting process to maintain that competitive edge?",
    "icebreakers": [
      "With equipment finance originations rising 5.9% YoY, how is Crest Capital scaling its underwriting to keep up with growing demand?",
      "As a top-rated equipment financing provider since 1989, what's your biggest operational challenge in processing applications today?",
      "The Section 179 push is a great strategy -- are you seeing more deal volume this year and how does that affect your underwriting capacity?",
      "With 35+ years in equipment financing, how has your underwriting process evolved and where do you see AI fitting in?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help Crest Capital process the surge in Section 179-driven applications faster, cutting review time from 40 minutes to under 5 minutes.",
      "With 450+ MCA and lending companies already using HyperVerge, our platform integrates seamlessly with equipment financing workflows.",
      "As deal volume grows with rising equipment investment (projected 6.2% YoY), HyperVerge helps maintain underwriting quality while dramatically increasing throughput."
    ],
    "ask": "Would you be open to a 15-minute demo showing how HyperVerge can help Crest Capital process more equipment financing applications with the same team, especially during the Section 179 rush?"
  },
  {
    "id": 1626,
    "name": "DEXT CAPITAL",
    "desc": "Independent equipment finance company specializing in healthcare financing, headquartered in Lake Oswego, Oregon. Backed by Sightway Capital (Two Sigma) and has surpassed $2 billion in originations.",
    "contacts": [
      {"n": "Kyin Lok", "t": "CEO & Founder"},
      {"n": "Team Leadership", "t": "VP of Sales & Syndications"}
    ],
    "leaders": [
      {"n": "Kyin Lok", "t": "CEO & Founder", "bg": "25-year veteran in equipment leasing, previously Chief Corporate Officer at TCF Financial and held positions at US Bank and GE Capital.", "li": "https://www.linkedin.com/in/kyin-lok-19a6504/"}
    ],
    "news": [
      {"h": "Dext Capital Surpasses $2 Billion in Originations", "s": "ELFA Online, June 2025", "d": "Dext Capital exceeded $2 billion in new business originations since inception, reflecting strong growth."},
      {"h": "Dext Capital Closes Sixth ABS Transaction", "s": "MonitorDaily, Jan 2026", "d": "Closed Dext ABS 2025-2, its sixth asset-backed securitization, drawing orders from 29 unique investors."},
      {"h": "Dext Capital Raises $200M with Deutsche Bank and Sightway Capital", "s": "Crunchbase, 2024", "d": "Raised total of $200M from investors including Deutsche Bank and Sightway Capital, a Two Sigma company."}
    ],
    "ice": "Congratulations on surpassing $2 billion in originations and closing your sixth ABS transaction -- as you expand beyond healthcare into new markets, how are you thinking about scaling your underwriting capacity?",
    "icebreakers": [
      "The $2B origination milestone is impressive -- with 29 investors in your latest ABS, how are you managing the growing volume of deals to underwrite?",
      "As Dext expands from healthcare into new verticals, are you looking at ways to speed up underwriting for unfamiliar asset classes?",
      "With your sixth ABS closed and strong financial backing, what's the biggest bottleneck in scaling originations further?",
      "Kyin, your background at GE Capital and TCF gives you deep expertise -- what role do you see AI playing in equipment finance underwriting?"
    ],
    "tp": [
      "HyperVerge's AI underwriting automation could help Dext Capital maintain quality as you scale beyond $2B in originations, cutting review time from 40 minutes to under 5 minutes.",
      "As you expand into new markets beyond healthcare, HyperVerge's platform can quickly adapt underwriting criteria for different asset classes and risk profiles.",
      "With 450+ companies already using HyperVerge, including PIRS Capital, our platform is proven for high-volume lending operations like yours."
    ],
    "ask": "As Dext scales past $2B and expands into new verticals, would you be open to seeing how HyperVerge's AI underwriting can help maintain quality and speed at higher volumes?"
  },
  {
    "id": 1630,
    "name": "EAGLE CAPITAL",
    "desc": "MCA and business funding company operating under the Quick Capital Fund brand in New York, providing merchant cash advances and working capital to small businesses.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Operates as Quick Capital Fund providing MCA and business funding solutions in New York.", "li": ""}
    ],
    "news": [
      {"h": "Quick Capital Fund Active in MCA Market", "s": "Industry Reports, 2025", "d": "Quick Capital Fund continues to provide merchant cash advances with fast approval and flexible terms for small businesses."}
    ],
    "ice": "As an MCA funder in the competitive New York market, how are you differentiating your underwriting and approval process to stay ahead?",
    "icebreakers": [
      "The MCA space in New York is incredibly competitive -- what's your biggest challenge in processing deal flow efficiently?",
      "How is Quick Capital Fund thinking about technology to improve deal turnaround times?",
      "With the growing volume of MCA applications, are you looking for ways to automate parts of your underwriting?",
      "What's working well in your current underwriting process and where do you see room for improvement?"
    ],
    "tp": [
      "HyperVerge helps MCA funders like Quick Capital Fund cut underwriting review time from 40 minutes to under 5 minutes with AI-powered automation.",
      "Over 450 MCA companies already use HyperVerge to process more deals with fewer underwriting staff, including industry leaders like PIRS Capital.",
      "In a competitive market like New York, faster underwriting means winning more deals from brokers and ISOs who value quick funding turnarounds."
    ],
    "ask": "Would you be open to a quick demo showing how HyperVerge can help Quick Capital Fund process MCA applications in under 5 minutes instead of 40?"
  },
  {
    "id": 1632,
    "name": "EASTERN FUNDING",
    "desc": "Leading equipment finance company serving laundry, car wash, grocery, and specialty vehicle industries, founded in 1997. Subsidiary of Brookline Bank with Nancy Robles recently promoted to CEO.",
    "contacts": [
      {"n": "Nancy Robles", "t": "CEO & President"},
      {"n": "Michael Fanger", "t": "Founder & Managing Member"},
      {"n": "Falencia Prime", "t": "COO"}
    ],
    "leaders": [
      {"n": "Nancy Robles", "t": "CEO & President", "bg": "Promoted to CEO in 2025 after long tenure managing operations, compliance, documentation, and technology. Recognized as 2025 Champion of Inclusivity by Monitor.", "li": "https://www.linkedin.com/in/nancy-robles-27240535/"},
      {"n": "Michael Fanger", "t": "Founder & Managing Member", "bg": "Founded Eastern Funding in 1997, now focusing on relationship cultivation and mentoring sales and leadership teams.", "li": ""},
      {"n": "Falencia Prime", "t": "COO", "bg": "Recently joined Eastern Funding to drive operational excellence and enhance customer experience.", "li": ""}
    ],
    "news": [
      {"h": "Nancy Robles Promoted to CEO of Eastern Funding", "s": "ELFA Online, Aug 2025", "d": "Nancy Robles was promoted to CEO as part of a long-planned leadership transition from founder Michael Fanger."},
      {"h": "Robles Recognized as 2025 Champion of Inclusivity", "s": "Monitor, 2025", "d": "Nancy Robles was named a Champion of Inclusivity by Monitor magazine for her leadership and advocacy."},
      {"h": "Eastern Funding Hires Falencia Prime as COO", "s": "ELFA Online, May 2025", "d": "Falencia Prime joined as COO to accelerate operational improvements and enhance customer experience."}
    ],
    "ice": "Congratulations to Nancy on the CEO promotion and the Champion of Inclusivity recognition -- as Eastern Funding enters this new chapter with fresh leadership, how are you thinking about modernizing your underwriting technology?",
    "icebreakers": [
      "With Nancy Robles stepping into the CEO role and the new COO on board, it seems like a great time for Eastern Funding to look at operational efficiency -- how are you thinking about underwriting automation?",
      "The leadership transition at Eastern Funding is exciting -- what operational changes is the new team prioritizing?",
      "Congratulations on the inclusivity award -- as you modernize operations under new leadership, is underwriting technology on the roadmap?",
      "With 27+ years in equipment finance, how is Eastern Funding evolving its underwriting approach for the next generation?"
    ],
    "tp": [
      "With new leadership driving operational change, HyperVerge's AI underwriting automation could be a signature initiative, cutting review time from 40 minutes to under 5 minutes.",
      "HyperVerge serves 450+ lending companies and can support Eastern Funding's specialized verticals like laundry, car wash, and specialty vehicles with customizable underwriting workflows.",
      "As a subsidiary of Brookline Bank, Eastern Funding can leverage HyperVerge's bank-grade compliance and security while dramatically improving underwriting speed."
    ],
    "ask": "As Eastern Funding enters a new era under Nancy's leadership, would you like to see how HyperVerge can help modernize your underwriting process across your specialty verticals?"
  },
  {
    "id": 1633,
    "name": "EBF HOLDINGS LLC",
    "desc": "Revenue-based financing provider operating as Everest Business Funding, founded in 2013 in Miami, Florida by serial entrepreneur Scott Crockett. Provides fast working capital to small businesses.",
    "contacts": [
      {"n": "Scott Crockett", "t": "CEO & Founder"}
    ],
    "leaders": [
      {"n": "Scott Crockett", "t": "CEO & Founder", "bg": "Serial entrepreneur who raised over $250M in capital and created thousands of jobs over 20+ year career. Previously founded Allied Cash Holdings with 250+ stores generating $60M+ in annual revenue. Tulane University graduate.", "li": ""}
    ],
    "news": [
      {"h": "Everest Business Funding Wins Best and Brightest in the Nation Again", "s": "PRWeb, 2025", "d": "Scott Crockett's Everest Business Funding earned national recognition as one of the Best and Brightest Companies to Work For."},
      {"h": "Everest Business Funding Emphasizes New Technology for Small Business Growth", "s": "Revenue Based Finance Coalition, 2025", "d": "CEO Scott Crockett highlighted the importance of harnessing new technology to drive small business growth."},
      {"h": "Everest Business Funding Exhibits at World of Concrete 2026", "s": "Industry Events, Jan 2026", "d": "Everest Business Funding exhibited at World of Concrete 2026 to connect with construction businesses needing funding."}
    ],
    "ice": "Congratulations on winning the Best and Brightest award again -- I noticed you've been vocal about harnessing new technology for small business growth. How is Everest Business Funding applying that philosophy to your underwriting process?",
    "icebreakers": [
      "Scott, your emphasis on new technology for small business growth is exactly the conversation we love to have -- are you exploring AI for underwriting?",
      "Winning Best and Brightest nationally shows a great culture -- how are you empowering your team with better tools for deal processing?",
      "With 20+ years in the industry and $250M+ raised, what's the biggest operational challenge Everest Business Funding faces in scaling further?",
      "I saw Everest exhibited at World of Concrete -- as you expand into new verticals, how do you handle the increased underwriting volume?"
    ],
    "tp": [
      "HyperVerge aligns perfectly with your vision of harnessing new technology -- our AI cuts underwriting review from 40 minutes to under 5 minutes.",
      "With 450+ MCA and revenue-based financing companies already using HyperVerge, we understand the specific needs of funders like Everest Business Funding.",
      "As you expand into verticals like construction, HyperVerge's AI can adapt underwriting criteria while maintaining speed and consistency across industries."
    ],
    "ask": "Scott, since you've been advocating for new technology in small business funding, would you be open to a demo of how HyperVerge's AI underwriting is transforming the revenue-based financing space?"
  },
  {
    "id": 1636,
    "name": "EIN CAPITAL",
    "desc": "New York City-based MCA direct funder established in 2008, specializing in merchant cash advances for small and medium-sized businesses across North America. Provides funding up to 4th position.",
    "contacts": [
      {"n": "John Mayne", "t": "CEO"},
      {"n": "Russell Naftali", "t": "Founder & President"},
      {"n": "Felix Komrash", "t": "Executive"}
    ],
    "leaders": [
      {"n": "John Mayne", "t": "CEO", "bg": "Leads Ein Cap's operations as a direct MCA funder serving thousands of small businesses nationwide.", "li": ""},
      {"n": "Russell Naftali", "t": "Founder & President", "bg": "Founded Ein Cap to provide merchant cash advances to underserved small businesses, building a multi-million dollar funding operation.", "li": ""}
    ],
    "news": [
      {"h": "Ein Cap Continues Growth as Direct MCA Funder", "s": "Industry Reports, 2025", "d": "Ein Cap has grown from a small private lender in 2008 into a multi-million dollar MCA funder serving businesses across North America."}
    ],
    "ice": "Russell, since founding Ein Cap in 2008, you've built a strong direct funding operation -- as the MCA industry evolves with AI and automation, how are you thinking about modernizing your underwriting?",
    "icebreakers": [
      "Ein Cap's growth from a small private lender to a multi-million dollar funder is impressive -- what's driving that growth and how is your underwriting keeping up?",
      "As a direct funder that goes up to 4th position, your risk assessment must be very nuanced -- are you looking at AI to improve that process?",
      "With 15+ years in the MCA space, how has your underwriting process evolved and where do you see it going?",
      "The MCA industry is rapidly adopting AI -- how is Ein Cap positioning itself to stay competitive on underwriting speed?"
    ],
    "tp": [
      "HyperVerge's AI underwriting is especially valuable for direct funders like Ein Cap that take on higher-risk positions, providing faster and more consistent risk assessment.",
      "Cut your MCA underwriting review time from 40 minutes to under 5 minutes -- critical for a direct funder competing on speed and approval rates.",
      "450+ MCA companies including PIRS Capital already trust HyperVerge for AI-powered underwriting automation."
    ],
    "ask": "As a direct funder going up to 4th position, would you be interested in seeing how HyperVerge's AI can help Ein Cap assess risk faster while maintaining underwriting quality?"
  },
  {
    "id": 1637,
    "name": "ELEVATION CAPITAL",
    "desc": "Direct funder providing alternative financing options for small to medium-sized businesses, based in Bel Air, Maryland. Founded in 2010, has provided over $150 million to 2,500+ businesses through MCAs and other products.",
    "contacts": [
      {"n": "Larry Schiavi", "t": "Owner & President"}
    ],
    "leaders": [
      {"n": "Larry Schiavi", "t": "Owner & President", "bg": "Leads Elevation Capital Group as both owner and president, overseeing MCA and alternative business financing operations that have funded $150M+ to 2,500+ businesses.", "li": ""}
    ],
    "news": [
      {"h": "Elevation Capital Continues Growth as Direct MCA Funder", "s": "Industry Reports, 2025", "d": "Elevation Capital Group has surpassed $150M in funding to over 2,500 businesses since its 2010 founding."}
    ],
    "ice": "With over $150 million funded to 2,500+ businesses since 2010, Elevation Capital has shown great staying power in the alternative financing space -- how are you thinking about scaling your underwriting to reach the next level?",
    "icebreakers": [
      "Elevation Capital has been in the MCA space since 2010 -- what operational improvements are you most focused on right now?",
      "With $150M+ funded, you've clearly found your niche -- what's the biggest bottleneck preventing even faster growth?",
      "As a direct funder, speed is everything -- how quickly can your team currently process an MCA application from start to funding?",
      "The alternative financing landscape has changed a lot since 2010 -- how is Elevation Capital adapting its underwriting to stay competitive?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help Elevation Capital process more deals without adding staff, cutting review time from 40 minutes to under 5 minutes.",
      "With 450+ MCA companies already using HyperVerge, our platform is purpose-built for direct funders like Elevation Capital.",
      "Scale from $150M to the next milestone faster by automating the most time-consuming part of your deal process -- underwriting review."
    ],
    "ask": "Would you be open to a quick demo showing how HyperVerge can help Elevation Capital process more MCA applications with your current team?"
  },
  {
    "id": 1641,
    "name": "EVERLASTING CAPITAL",
    "desc": "National business finance solutions provider in Rochester, New Hampshire, co-founded in 2012 by Josh Feinberg and Will Murphy. Ranked on the Inc. 500 and #1 fastest-growing company in New Hampshire. Offers equipment financing and working capital.",
    "contacts": [
      {"n": "Josh Feinberg", "t": "CEO & Co-Founder"},
      {"n": "Will Murphy", "t": "COO & Co-Founder"}
    ],
    "leaders": [
      {"n": "Josh Feinberg", "t": "CEO & Co-Founder", "bg": "Co-founded Everlasting Capital in 2012 from his basement, grew it to Inc. 500 ranking and #1 fastest-growing company in New Hampshire. Hands-on in day-to-day operations.", "li": ""},
      {"n": "Will Murphy", "t": "COO & Co-Founder", "bg": "Co-founded Everlasting Capital with Josh Feinberg, oversees day-to-day operations and financial strategy. Certified Equipment Broker School graduate.", "li": "https://www.linkedin.com/in/will-murphy-ebsc-8099a95b/"}
    ],
    "news": [
      {"h": "Everlasting Capital Surpasses $50 Million in Business Loans", "s": "Company Website, 2024", "d": "Everlasting Capital reached $50M in business loans funded across all lower 48 states."},
      {"h": "From Basement to Inc. 500", "s": "deBanked, 2018", "d": "Josh Feinberg and Will Murphy grew Everlasting Capital from a basement startup to the Inc. 500 and #1 fastest-growing company in New Hampshire."}
    ],
    "ice": "Josh, the journey from a basement startup to Inc. 500 is an incredible story -- now that you've surpassed $50M in funding, how are you thinking about scaling your operations to the next level?",
    "icebreakers": [
      "The Inc. 500 story is inspiring -- as Everlasting Capital continues to grow, what's your biggest operational challenge?",
      "With $50M+ funded across 48 states, how is your underwriting team keeping up with the increasing deal flow?",
      "Will, as COO, where do you see the biggest opportunity to improve efficiency in your funding process?",
      "Being #1 fastest-growing in New Hampshire is a great achievement -- how do you maintain underwriting quality at that growth rate?"
    ],
    "tp": [
      "HyperVerge can help Everlasting Capital maintain its growth trajectory by automating underwriting, cutting review time from 40 minutes to under 5 minutes.",
      "As you scale beyond $50M in fundings, HyperVerge's AI ensures consistent underwriting quality even as deal volume increases.",
      "450+ lending companies including PIRS Capital trust HyperVerge -- we understand the challenges of fast-growing funders like Everlasting Capital."
    ],
    "ask": "As Everlasting Capital pushes past $50M and continues its growth streak, would you be interested in seeing how HyperVerge's AI can help you process deals faster without compromising quality?"
  },
  {
    "id": 1642,
    "name": "EXPRESS CAPITAL FUNDING",
    "desc": "Direct lender in Anaheim, California providing working capital loans and equipment financing to specialty contractors, manufacturing companies, government contractors, and trucking companies. Founded in 2013.",
    "contacts": [
      {"n": "Scott Redfox", "t": "President"},
      {"n": "Robert Longobardy", "t": "Vice President"}
    ],
    "leaders": [
      {"n": "Scott Redfox", "t": "President", "bg": "Founded Express Capital Funding in 2013, brings 20+ years in the financial sector. Cal State University Long Beach graduate.", "li": "https://www.linkedin.com/in/scott-redfox-84664519/"},
      {"n": "Robert Longobardy", "t": "Vice President", "bg": "Vice President at Express Capital Funding overseeing lending operations for contractors and small businesses.", "li": ""}
    ],
    "news": [
      {"h": "Express Capital Funding Continues Serving Contractors and SMBs", "s": "BBB, 2025", "d": "Express Capital Funding maintains BBB accreditation since 2016 while providing working capital and equipment loans to specialty contractors nationwide."}
    ],
    "ice": "Scott, with 20+ years in financial services and a focus on specialty contractors, how has Express Capital Funding adapted its underwriting for the unique needs of contractor financing?",
    "icebreakers": [
      "Serving specialty contractors and trucking companies requires specialized underwriting -- how is Express Capital handling that today?",
      "With 10+ years as a direct lender, what's the most time-consuming part of your underwriting process?",
      "Government contractors have unique funding needs -- how does Express Capital's underwriting handle those differences?",
      "As a direct lender in the competitive California market, speed is critical -- how quickly can your team turn around a loan application?"
    ],
    "tp": [
      "HyperVerge's AI can help Express Capital Funding process contractor and SMB loan applications in under 5 minutes instead of 40, giving you a speed advantage.",
      "Our platform supports customizable underwriting criteria for different industries like contractors, trucking, and manufacturing -- exactly your target verticals.",
      "450+ lending companies already use HyperVerge, including PIRS Capital, to automate underwriting while maintaining deal quality."
    ],
    "ask": "Would you be interested in a demo showing how HyperVerge can help Express Capital Funding process contractor loan applications significantly faster?"
  },
  {
    "id": 1644,
    "name": "FAST CASH FUNDING",
    "desc": "Florida-based MCA provider offering merchant cash advances and business funding up to $1 million. Specializes in same-day approvals with no credit requirement, helping merchants across all industries.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads Fast Cash Funding's MCA operations providing up to $1M in same-day funding across all industries.", "li": ""}
    ],
    "news": [
      {"h": "Fast Cash Funding Offers Same-Day MCA Approvals", "s": "Company Website, 2025", "d": "Fast Cash Funding continues to provide same-day approvals for merchant cash advances up to $1 million with no credit requirements."}
    ],
    "ice": "Fast Cash Funding's same-day approval process is a strong value proposition -- how is your team managing the underwriting workload while maintaining that speed?",
    "icebreakers": [
      "Same-day approvals up to $1M is ambitious -- what tools and processes does your underwriting team rely on to maintain that speed?",
      "As an MCA provider in Florida's competitive market, how are you thinking about technology to improve your deal processing?",
      "No credit requirement funding is attractive to merchants but creates underwriting complexity -- how are you managing risk assessment?",
      "What's the biggest bottleneck preventing Fast Cash Funding from processing even more deals per day?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help Fast Cash Funding maintain same-day approvals even as deal volume grows, cutting review time from 40 minutes to under 5 minutes.",
      "For no-credit-requirement MCAs, HyperVerge's AI analyzes bank statements and revenue data to provide fast, accurate risk assessments.",
      "450+ MCA companies including PIRS Capital already use HyperVerge to automate their underwriting -- proven technology for same-day funding operations."
    ],
    "ask": "Would you be open to seeing how HyperVerge can help Fast Cash Funding maintain same-day approvals while processing significantly more deals?"
  },
  {
    "id": 1651,
    "name": "FLEXIBILITY CAPITAL",
    "desc": "New York-based alternative financing company founded in 2018, providing small business loans and MCAs. Ranked on Inc. 5000 in 2022, 2024, and 2025. Has secured over $1 billion in funding for thousands of businesses.",
    "contacts": [
      {"n": "Michael Peeler", "t": "Founder & CEO"}
    ],
    "leaders": [
      {"n": "Michael Peeler", "t": "Founder & CEO", "bg": "Founded Flexibility Capital in 2018 with 20+ years of industry experience. Led the company to Inc. 5000 ranking three times and surpassed $1 billion in total funding.", "li": "https://www.linkedin.com/in/michael-peeler-88488461/"}
    ],
    "news": [
      {"h": "Flexibility Capital Ranked #3034 on Inc. 5000 for Third Consecutive Year", "s": "Inc., 2025", "d": "Flexibility Capital achieved its third Inc. 5000 ranking with 134% three-year growth."},
      {"h": "Flexibility Capital Celebrates 1,000 Trustpilot Reviews with 4.9/5 Rating", "s": "PR Newswire, Jan 2025", "d": "Company reached 1,000 Trustpilot reviews with an outstanding 4.9 out of 5 rating."},
      {"h": "Flexibility Capital Surpasses $1 Billion in Total Funding", "s": "Company Reports, 2024", "d": "Since its 2018 founding, Flexibility Capital has secured over $1 billion in funding for thousands of small businesses."}
    ],
    "ice": "Congratulations on making the Inc. 5000 three years running and surpassing $1 billion in funding -- Michael, as you scale at this pace, how is your underwriting team keeping up with the growing deal flow?",
    "icebreakers": [
      "Three consecutive Inc. 5000 appearances and $1B+ funded is remarkable growth -- what's your secret to maintaining quality while scaling so fast?",
      "A 4.9 Trustpilot rating with 1,000+ reviews shows incredible customer satisfaction -- how does your underwriting process contribute to that experience?",
      "Michael, with 20+ years of experience, where do you see AI fitting into Flexibility Capital's next phase of growth?",
      "Going from $0 to $1B in 6 years is exceptional -- what operational improvements would help you reach $2B even faster?"
    ],
    "tp": [
      "HyperVerge can help Flexibility Capital maintain its Inc. 5000 growth rate by automating underwriting, cutting review from 40 minutes to under 5 minutes.",
      "With 450+ MCA companies already using HyperVerge, our platform is proven for high-growth funders targeting $1B+ in originations.",
      "Faster underwriting means happier customers -- supporting the kind of 4.9-star experience that Flexibility Capital is known for."
    ],
    "ask": "Michael, as Flexibility Capital pushes toward $2B in total funding, would you be open to a demo showing how HyperVerge's AI underwriting can help maintain your growth trajectory?"
  },
  {
    "id": 1656,
    "name": "FUSION CAPITAL",
    "desc": "Business funding company based in North Myrtle Beach, South Carolina, providing small business loans, working capital financing, and business lines of credit through fusionfunding.com.",
    "contacts": [
      {"n": "Christian Reynolds", "t": "Director"}
    ],
    "leaders": [
      {"n": "Christian Reynolds", "t": "Director", "bg": "Leads Fusion Capital's business funding operations serving small businesses with working capital and lines of credit.", "li": ""}
    ],
    "news": [
      {"h": "Fusion Capital Serves Growing SMB Market", "s": "Industry Reports, 2025", "d": "Fusion Capital continues to expand its small business lending operations from its South Carolina headquarters."}
    ],
    "ice": "Christian, as Fusion Capital grows its small business lending operations, how are you thinking about improving your underwriting efficiency to serve more businesses?",
    "icebreakers": [
      "South Carolina is an interesting base for a national lending operation -- how does Fusion Capital differentiate in the competitive funding market?",
      "What's the biggest operational challenge Fusion Capital faces in scaling your lending operations?",
      "How does your underwriting team currently handle the application review process, and where do you see room for improvement?",
      "As a growing funder, what technology investments are you considering to improve deal throughput?"
    ],
    "tp": [
      "HyperVerge's AI underwriting automation can help Fusion Capital process more applications with the same team, cutting review time from 40 minutes to under 5 minutes.",
      "450+ MCA and lending companies already use HyperVerge, including PIRS Capital -- proven technology for business lending operations of your size.",
      "Faster underwriting means winning more deals from brokers and ISOs who value quick turnaround times."
    ],
    "ask": "Would you be interested in a 15-minute demo showing how HyperVerge can help Fusion Capital process more loan applications without expanding your team?"
  },
  {
    "id": 1661,
    "name": "GOOD FUNDING LLC",
    "desc": "Privately-held alternative business funding firm in Tustin, California, founded in 2020. CEO Ben Gold and President Jason Osiecki have grown it to $100M+ in fundings, ranking #2 on OCBJ's fastest-growing list with 650% revenue growth.",
    "contacts": [
      {"n": "Ben Gold", "t": "CEO"},
      {"n": "Jason Osiecki", "t": "Co-Founder & President"},
      {"n": "Elizabeth Viramontes", "t": "VP of Finance"}
    ],
    "leaders": [
      {"n": "Ben Gold", "t": "CEO", "bg": "Leads Good Funding's rapid growth as CEO, achieving 650% revenue growth and #2 ranking on Orange County Business Journal's fastest-growing companies list.", "li": "https://www.linkedin.com/in/ben-gold-a7ab383/"},
      {"n": "Jason Osiecki", "t": "Co-Founder & President", "bg": "Co-founded Good Funding in 2020 and serves as President, overseeing business development and strategic growth.", "li": ""}
    ],
    "news": [
      {"h": "Good Funding Reaches $100M in Total Fundings", "s": "Company Reports, 2025", "d": "Good Funding surpassed $100 million in total fundings since inception, supporting over 3,000 businesses."},
      {"h": "Good Funding Ranks #2 on OCBJ Fastest-Growing List", "s": "Orange County Business Journal, 2025", "d": "Recognized with 650% two-year revenue growth, ranking #2 among all midsize private companies."},
      {"h": "Good Funding Closes Up to $30 Million Credit Facility", "s": "Company News, 2025", "d": "Good Funding announced its inaugural institutional financing with an accordion feature to increase to $30M."}
    ],
    "ice": "Ben, congratulations on the $100M funding milestone and the #2 OCBJ ranking with 650% growth -- that's incredible for a company founded in 2020. How are you scaling your underwriting to keep pace?",
    "icebreakers": [
      "From founding in 2020 to $100M+ funded in just a few years is remarkable -- what's driving that growth and how is your team handling it?",
      "The $30M credit facility shows institutional confidence -- as capital availability grows, how are you scaling the operations side?",
      "Ranking #2 on the OCBJ list with 650% growth means deal volume is exploding -- is underwriting your bottleneck?",
      "Jason, as co-founder, what's your vision for Good Funding's next growth phase and how does technology factor in?"
    ],
    "tp": [
      "With 650% growth, HyperVerge's AI underwriting is exactly what Good Funding needs to scale without proportionally growing the underwriting team -- we cut review from 40 minutes to under 5.",
      "As you close institutional credit facilities and increase funding capacity, HyperVerge ensures your underwriting throughput can match your capital availability.",
      "450+ MCA companies including PIRS Capital trust HyperVerge -- we're built for hyper-growth funders like Good Funding."
    ],
    "ask": "Ben, with 650% growth and a new $30M credit facility, would you be open to seeing how HyperVerge can help Good Funding's underwriting scale as fast as your funding capacity?"
  },
  {
    "id": 1673,
    "name": "Idea 247, Inc.",
    "desc": "Miami-based fintech providing small business lines of credit and term loans, founded in 2017. Surpassed $1 billion in total funding in 2025 and recently secured $50M warehouse facility and $20M term loan from EverBank.",
    "contacts": [
      {"n": "Justin Leto", "t": "CEO & Co-Founder"},
      {"n": "Larry Bassuk", "t": "President & Co-Founder"}
    ],
    "leaders": [
      {"n": "Justin Leto", "t": "CEO & Co-Founder", "bg": "Florida licensed trial lawyer, also founded a boutique law firm and insurance startup Level Insurance. BS from University of Arizona, JD from University of Miami School of Law.", "li": "https://www.linkedin.com/in/justincleto/"},
      {"n": "Larry Bassuk", "t": "President & Co-Founder", "bg": "Florida licensed trial lawyer who co-developed Level Insurance before co-founding Idea Financial with Justin Leto.", "li": ""}
    ],
    "news": [
      {"h": "Idea Financial Surpasses $1 Billion in Funding", "s": "Company Reports, Jul 2025", "d": "Idea Financial exceeded $1 billion in total funding since inception in 2017."},
      {"h": "Idea Financial Closes $20 Million Corporate Term Loan with EverBank", "s": "Business Wire, Dec 2025", "d": "Closed $20M corporate term loan to accelerate growth in small business lending divisions."},
      {"h": "Idea Financial Secures $50 Million Warehouse Facility", "s": "deBanked, Oct 2024", "d": "Closed new $50M warehouse facility led by Performance Trust Capital Partners, expanding credit lines to $350K."}
    ],
    "ice": "Justin, congratulations on surpassing $1 billion in funding and securing the EverBank term loan -- as Idea Financial scales rapidly, how are you thinking about AI to further streamline your underwriting?",
    "icebreakers": [
      "The $1B funding milestone and $20M EverBank deal show incredible momentum -- what's your biggest operational challenge at this scale?",
      "As a fellow lawyer-turned-fintech-founder, your approach to risk must be methodical -- how do you see AI enhancing that?",
      "With $50M+ in new warehouse capacity, can your underwriting team keep pace with the increased deal flow?",
      "Idea Financial's growth from 2017 to $1B is impressive -- what role does technology play in maintaining quality at scale?"
    ],
    "tp": [
      "As Idea Financial scales past $1B with new capital from EverBank and Performance Trust, HyperVerge's AI can ensure your underwriting throughput matches your funding capacity.",
      "Cut underwriting review from 40 minutes to under 5 minutes -- critical for deploying your expanded $50M warehouse facility efficiently.",
      "450+ lending companies including PIRS Capital use HyperVerge. Our platform integrates with existing systems to accelerate deal processing without disrupting workflows."
    ],
    "ask": "Justin, with $1B+ funded and new capital ready to deploy, would you like to see how HyperVerge's AI underwriting can help Idea Financial maximize throughput on that expanded warehouse facility?"
  },
  {
    "id": 1676,
    "name": "INFINITY CAPITAL",
    "desc": "Technology-driven business lender providing merchant cash advances, small business loans, and cash flow loans. Offers 24-hour funding decisions and positions itself as a leader in the cash advance industry.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads Infinity Capital's technology-driven MCA and business lending operations with 24-hour decision-making.", "li": ""}
    ],
    "news": [
      {"h": "Infinity Capital Continues Growth in MCA Market", "s": "Industry Reports, 2025", "d": "Infinity Capital positions itself as a technology-driven leader in the cash advance industry with rapid 24-hour funding decisions."}
    ],
    "ice": "As a technology-driven lender focused on 24-hour decisions, how is Infinity Capital leveraging AI to maintain that speed as deal volume grows?",
    "icebreakers": [
      "Being technology-driven is a great differentiator in the MCA space -- what technology are you currently using for underwriting?",
      "24-hour funding decisions are impressive -- where do you see room to make your process even faster?",
      "As a leader in the cash advance industry, how are you thinking about AI-powered underwriting automation?",
      "What's the biggest challenge in maintaining fast turnaround times while ensuring quality underwriting decisions?"
    ],
    "tp": [
      "HyperVerge complements Infinity Capital's technology-driven approach by cutting underwriting review from 40 minutes to under 5 minutes with AI.",
      "450+ MCA companies already use HyperVerge, making it the industry's leading AI underwriting platform for cash advance providers.",
      "Maintain your 24-hour decision promise even as deal volume scales -- HyperVerge ensures speed without sacrificing underwriting quality."
    ],
    "ask": "As a technology-driven lender, would you be interested in seeing how HyperVerge's AI can further accelerate Infinity Capital's underwriting to maintain your 24-hour decision advantage?"
  },
  {
    "id": 1692,
    "name": "LENDZI",
    "desc": "Financial consulting firm based in Boca Raton, Florida, with 60+ lending partnerships and $500M+ raised for entrepreneurs. Provides MCA, SBA loans, equipment financing, and business term loans through a marketplace model.",
    "contacts": [
      {"n": "David Halverson", "t": "CEO"},
      {"n": "Ryan Kelly", "t": "Owner"}
    ],
    "leaders": [
      {"n": "David Halverson", "t": "CEO", "bg": "Leads Lendzi with 10+ years of direct experience in the lending space, overseeing 60+ lending partnerships and $500M+ in entrepreneur funding.", "li": "https://www.linkedin.com/in/david-halverson-034a0714/"},
      {"n": "Ryan Kelly", "t": "Owner", "bg": "Owner of Lendzi, driving the company's growth and strategic partnerships with top lending institutions.", "li": ""}
    ],
    "news": [
      {"h": "Lendzi Surpasses $500 Million Raised for Entrepreneurs", "s": "Company Reports, 2025", "d": "Lendzi's lending marketplace has facilitated over $500 million in funding through its 60+ lending partnerships."}
    ],
    "ice": "David, with 60+ lending partnerships and $500M+ raised, Lendzi has built an impressive marketplace -- how are you helping your lending partners improve their underwriting efficiency?",
    "icebreakers": [
      "With 60+ lending partnerships, you have unique insight into what works in underwriting -- what patterns do you see among your most efficient partners?",
      "As a marketplace connecting merchants to lenders, deal flow volume must be massive -- how do your lending partners handle the underwriting load?",
      "The $500M milestone shows strong growth -- what would make Lendzi even more valuable to both merchants and lending partners?",
      "David, in your 10+ years in lending, how has the underwriting process evolved and where do you see it going?"
    ],
    "tp": [
      "HyperVerge can help Lendzi's lending partners process the deal flow you send them faster, cutting underwriting from 40 minutes to under 5 minutes.",
      "As a marketplace, offering partners access to HyperVerge's AI underwriting could be a differentiator for Lendzi's lending network.",
      "450+ MCA companies including PIRS Capital already use HyperVerge -- we complement Lendzi's marketplace model perfectly."
    ],
    "ask": "David, would you be interested in exploring how HyperVerge could benefit both Lendzi and your 60+ lending partners by automating the underwriting process?"
  },
  {
    "id": 1708,
    "name": "NETFUNDING",
    "desc": "Business funding company based in Texas with approximately 430 employees, providing business loans and financing solutions to small and medium-sized businesses.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads NetFunding's operations with approximately 430 employees in Texas, providing business funding solutions.", "li": ""}
    ],
    "news": [
      {"h": "NetFunding Operates as Major Texas-Based Business Funder", "s": "Industry Reports, 2025", "d": "NetFunding maintains a significant operation with approximately 430 employees focused on business lending."}
    ],
    "ice": "With 430 employees, NetFunding is one of the larger operations in the business funding space -- how are you leveraging technology to maximize your team's underwriting efficiency?",
    "icebreakers": [
      "A 430-person operation is substantial for the funding industry -- what portion of your team is dedicated to underwriting?",
      "At your scale, even small improvements in underwriting efficiency can have massive impact -- are you exploring AI solutions?",
      "What technology stack is NetFunding currently using for deal processing and underwriting?",
      "How does NetFunding maintain consistency in underwriting decisions across such a large team?"
    ],
    "tp": [
      "At 430 employees, HyperVerge's AI underwriting automation could save NetFunding thousands of hours per month, cutting review time from 40 minutes to under 5 minutes per deal.",
      "HyperVerge ensures consistent underwriting decisions across your entire team -- critical for large operations maintaining quality at scale.",
      "450+ MCA companies including PIRS Capital already use HyperVerge to automate underwriting. Our platform is built for organizations of your scale."
    ],
    "ask": "With 430 employees and high deal volume, would NetFunding be interested in seeing how HyperVerge's AI could save your underwriting team thousands of hours per month?"
  },
  {
    "id": 1712,
    "name": "NRS FUNDING",
    "desc": "Merchant cash advance division of National Retail Solutions (NRS), a subsidiary of IDT Corporation. Provides cash advances from $2,500 to $500K to merchants using the NRS POS system. Parent company has 23,000+ active POS terminals nationwide.",
    "contacts": [
      {"n": "Elie Y. Katz", "t": "Founder, President & CEO of NRS"},
      {"n": "Eli Korn", "t": "COO"}
    ],
    "leaders": [
      {"n": "Elie Y. Katz", "t": "Founder, President & CEO", "bg": "Founded National Retail Solutions in 2015, former Mayor of Teaneck NJ. Built NRS to 23,000+ POS terminals with funding, payments, advertising, and data analytics divisions.", "li": "https://www.linkedin.com/in/katz07666"},
      {"n": "Eli Korn", "t": "COO", "bg": "Chief Operating Officer overseeing day-to-day operations across NRS divisions including NRS Funding.", "li": ""}
    ],
    "news": [
      {"h": "NRS Wins 2025 Visionary Spotlight Award for Best Emerging Technology", "s": "Industry Awards, 2025", "d": "National Retail Solutions won the Visionary Spotlight Award for best emerging technology breakthrough."},
      {"h": "NRS Launches AI-Powered Product Recommendations", "s": "NRS Press, Oct 2025", "d": "NRS upgraded its POS suite with AI-powered product recommendations that analyze sales data for optimal pricing."},
      {"h": "NRS Surpasses 23,000 Active POS Terminals Nationwide", "s": "Company Reports, 2025", "d": "NRS Plus continues rapid growth with over 23,000 active POS terminals serving retail businesses across the country."}
    ],
    "ice": "Elie, congratulations on the 2025 Visionary Spotlight Award and the AI-powered product recommendations launch -- with 23,000+ POS terminals generating funding leads, how is NRS Funding scaling its underwriting to serve all those merchants?",
    "icebreakers": [
      "The integration of POS data with funding is brilliant -- are you using that POS transaction data to automate underwriting decisions for NRS Funding?",
      "With 23,000+ active terminals, the potential deal flow for NRS Funding is massive -- how does your underwriting keep up?",
      "You're already using AI for product recommendations -- have you considered applying AI to your MCA underwriting process?",
      "NRS Funding's access to real-time POS data is a unique advantage -- how are you leveraging that in your risk assessment?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can complement NRS Funding's POS data advantage by automating the full review process, cutting it from 40 minutes to under 5 minutes.",
      "With 23,000+ potential merchant customers, HyperVerge helps NRS Funding process the massive deal pipeline without proportionally growing the underwriting team.",
      "As you've already adopted AI for product recommendations, HyperVerge is a natural next step -- 450+ MCA companies including PIRS Capital already use our platform."
    ],
    "ask": "Elie, since NRS is already embracing AI with product recommendations, would you like to see how HyperVerge can bring the same AI advantage to NRS Funding's underwriting process?"
  },
  {
    "id": 1727,
    "name": "PROSPERUM",
    "desc": "New York City-based MCA funder since 2014, providing merchant cash advances, business lines of credit, inventory financing, and long-term financing. Located at 57 W 38th St in Manhattan.",
    "contacts": [
      {"n": "Gabriella Gorobets", "t": "Manager, ISO Relations"},
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Gabriella Gorobets", "t": "Manager, ISO Relations", "bg": "Manages ISO relationships at Prosperum Funding, previously founded Prime Choice Solutions and served as Senior Funding Specialist at Merchant Industry.", "li": "https://www.linkedin.com/in/gabriella-gorobets/"}
    ],
    "news": [
      {"h": "Prosperum Funding Continues Serving SMBs Since 2014", "s": "Company Reports, 2025", "d": "Prosperum Funding maintains its position as an alternative lender providing personalized financial solutions to small businesses."}
    ],
    "ice": "Prosperum has been in the funding space since 2014 with a personalized approach -- as the industry moves toward AI-powered underwriting, how is your team adapting?",
    "icebreakers": [
      "With a decade of experience in alternative lending, what's Prosperum's biggest operational challenge today?",
      "Your personalized approach to business financing is a differentiator -- how do you balance that with the need for underwriting speed?",
      "Gabriella, as you manage ISO relationships, what do ISOs value most -- speed, approval rates, or something else?",
      "How is Prosperum thinking about technology to improve deal processing efficiency?"
    ],
    "tp": [
      "HyperVerge can help Prosperum maintain its personalized approach while dramatically increasing speed, cutting underwriting from 40 minutes to under 5 minutes.",
      "Faster underwriting means happier ISOs -- they want quick decisions, and HyperVerge delivers that for 450+ MCA companies.",
      "With PIRS Capital and other industry leaders already using HyperVerge, Prosperum can leverage proven technology to stay competitive."
    ],
    "ask": "Would Prosperum be interested in seeing how HyperVerge can help you give ISOs faster underwriting decisions while maintaining your personalized approach?"
  },
  {
    "id": 1737,
    "name": "ROYAL FUNDING",
    "desc": "New York City-based business funding company at 180 Maiden Lane, providing accelerated funding solutions with 15+ financing options. Has funded over $1 billion with amounts from $5K to $2M in as little as one hour.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads Royal Funding Group's operations at 180 Maiden Lane in NYC, with over $1B funded and 15+ financing products.", "li": ""}
    ],
    "news": [
      {"h": "Royal Funding Group Surpasses $1 Billion in Total Funding", "s": "Company Reports, 2025", "d": "Royal Funding Group has funded over $1 billion to small businesses through its 15+ accelerated financing options."}
    ],
    "ice": "Surpassing $1 billion in total funding with 15+ financing options is impressive -- how is Royal Funding maintaining its one-hour approval promise as volume scales?",
    "icebreakers": [
      "Funding in as little as one hour is a bold promise -- what does your underwriting process look like to make that happen?",
      "With $1B+ funded and 15+ products, Royal Funding has a complex operation -- where do you see the biggest opportunity for efficiency gains?",
      "How many deals does Royal Funding process per day, and is your underwriting team keeping pace with demand?",
      "In the competitive NYC funding market, speed is your differentiator -- how are you investing in technology to maintain that edge?"
    ],
    "tp": [
      "HyperVerge can help Royal Funding maintain its one-hour funding promise by cutting underwriting review from 40 minutes to under 5 minutes with AI.",
      "With 15+ financing products, HyperVerge's customizable AI workflows can handle different underwriting criteria for each product type.",
      "450+ MCA companies including PIRS Capital trust HyperVerge -- we're built for high-volume, fast-turnaround operations like Royal Funding."
    ],
    "ask": "With $1B+ funded and a one-hour approval target, would Royal Funding be interested in seeing how HyperVerge's AI can help maintain that speed as volume grows?"
  },
  {
    "id": 1746,
    "name": "SMALL BUSINESS FUNDING",
    "desc": "Pennsylvania-based business funding provider in King of Prussia, serving small businesses nationwide for 12+ years. Offers fast approvals within 24 hours and funding up to $500K within 48-72 hours.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads Small Business Funding's operations from King of Prussia, PA, providing fast business funding nationwide for over 12 years.", "li": ""}
    ],
    "news": [
      {"h": "Small Business Funding Marks 12+ Years Serving Businesses Nationwide", "s": "Company Reports, 2025", "d": "Small Business Funding continues to provide fast approvals and funding up to $500K from its King of Prussia headquarters."}
    ],
    "ice": "With 12+ years in the business and a focus on fast approvals, how is Small Business Funding thinking about technology to maintain competitiveness in an increasingly AI-driven industry?",
    "icebreakers": [
      "24-hour approvals and 48-72 hour funding shows a well-oiled operation -- what's the biggest bottleneck in your current process?",
      "After 12+ years in the business, how has your underwriting process evolved and where do you see the next innovation?",
      "Serving businesses in all credit profiles requires nuanced underwriting -- are you exploring AI to help with risk assessment?",
      "What technology improvements would have the biggest impact on Small Business Funding's operations right now?"
    ],
    "tp": [
      "HyperVerge can help Small Business Funding cut that 24-hour approval to same-hour by automating underwriting review from 40 minutes to under 5 minutes.",
      "With 12+ years of lending data, HyperVerge's AI can be trained on your historical performance to make even better underwriting decisions.",
      "450+ MCA companies including PIRS Capital already use HyperVerge -- proven technology for established funders looking to modernize."
    ],
    "ask": "Would Small Business Funding be open to a demo showing how HyperVerge can help cut your approval time from 24 hours to same-hour with AI-powered underwriting?"
  },
  {
    "id": 1757,
    "name": "TBF Group",
    "desc": "Leading purchaser of non-performing commercial debt in the US, founded in 1998 by the Boehm family. Buys charged-off equipment leases, commercial bank loans, MCA portfolios, and small business loans from major financial institutions.",
    "contacts": [
      {"n": "Brett Boehm", "t": "CEO"},
      {"n": "Adam Boehm", "t": "CFO"},
      {"n": "Robert Boehm", "t": "Co-Founder"}
    ],
    "leaders": [
      {"n": "Brett Boehm", "t": "CEO", "bg": "Took over as CEO in 2010 from his father Robert, focusing on business development and marketing to expand TBF's national footprint.", "li": "https://www.linkedin.com/in/brettboehm/"},
      {"n": "Adam Boehm", "t": "CFO", "bg": "Created TBF's proprietary Data Driven, True Market Pricing algorithm and oversees the company's financial health.", "li": ""},
      {"n": "Robert Boehm", "t": "Co-Founder", "bg": "Retired attorney who founded TBF in 1998 after representing 30+ banks and financial institutions. CEO until 2010.", "li": ""}
    ],
    "news": [
      {"h": "TBF Announces Development of Commercial Debt Pricing Algorithm", "s": "deBanked, Mar 2025", "d": "TBF Financial unveiled its proprietary Data Driven, True Market Pricing algorithm based on 27+ years of debt recovery data."},
      {"h": "TBF Celebrates 25 Years as Innovator in Equipment Finance", "s": "NEFA, 2023", "d": "TBF Financial celebrated 25 years as a pioneer in the commercial debt buying industry."}
    ],
    "ice": "Brett, the new Data Driven, True Market Pricing algorithm is fascinating -- with 27 years of recovery data, how are you seeing AI change the commercial debt buying landscape?",
    "icebreakers": [
      "The proprietary pricing algorithm based on 27 years of data is a competitive moat -- how is TBF thinking about AI beyond pricing?",
      "As the leading buyer of non-performing MCAs, you have unique insight into underwriting quality -- what patterns do you see in the deals that go bad?",
      "With 25+ years pioneering commercial debt buying, how is TBF evolving its technology stack?",
      "Your algorithm seems to solve pricing -- are there other parts of your process where AI could add value?"
    ],
    "tp": [
      "HyperVerge's AI underwriting helps MCA funders whose non-performing portfolios TBF buys -- better initial underwriting means better-performing portfolios for everyone.",
      "With 450+ MCA companies using HyperVerge, we're helping improve the quality of originations industry-wide, which directly affects TBF's portfolio quality.",
      "TBF's proprietary algorithm and HyperVerge's AI underwriting are complementary -- we improve the front end while you optimize the back end of the credit lifecycle."
    ],
    "ask": "Brett, as someone who sees the full credit lifecycle, would you be interested in discussing how HyperVerge's AI underwriting is improving origination quality across 450+ MCA companies?"
  },
  {
    "id": 1759,
    "name": "THRIVE FUNDING",
    "desc": "Institutional private credit firm based in Utah, providing middle market lending solutions. Focuses on delivering fast, flexible capital solutions to businesses.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads Thrive Funding's institutional private credit operations serving the middle market from Utah.", "li": ""}
    ],
    "news": [
      {"h": "Thrive Funding Serves Middle Market with Private Credit", "s": "Company Reports, 2025", "d": "Thrive Funding continues to provide institutional private credit solutions for middle market businesses."}
    ],
    "ice": "As an institutional private credit firm serving the middle market, how is Thrive Funding approaching the balance between thorough underwriting and fast deal execution?",
    "icebreakers": [
      "Middle market lending requires deep underwriting -- how is Thrive Funding currently handling the analysis process?",
      "Private credit is growing rapidly -- how is Thrive Funding positioning to capture more market share?",
      "What's the typical turnaround time for Thrive Funding's underwriting, and where do you see room for improvement?",
      "As deal flow increases in the private credit space, how are you scaling your team and processes?"
    ],
    "tp": [
      "HyperVerge's AI underwriting automation can help Thrive Funding process middle market deals faster, cutting review time from 40 minutes to under 5 minutes.",
      "With 450+ lending companies already using HyperVerge, our platform handles the complexity of middle market underwriting at speed.",
      "Faster underwriting means winning more deals in the competitive private credit space -- HyperVerge gives you a speed advantage."
    ],
    "ask": "Would Thrive Funding be interested in seeing how HyperVerge's AI can accelerate your middle market underwriting while maintaining the thorough analysis your institutional investors expect?"
  },
  {
    "id": 1760,
    "name": "THRYVE CAPITAL",
    "desc": "One of the country's largest MCA lenders and ISOs, headquartered in Lower Manhattan. Founded by Steve Weinrib, has funded over $1 billion since inception. Both a direct source of capital and a large ISO, funding the full merchant credit spectrum.",
    "contacts": [
      {"n": "Steve Weinrib", "t": "Founder & CEO"},
      {"n": "Fritz Desir", "t": "Director, ISO Relations"}
    ],
    "leaders": [
      {"n": "Steve Weinrib", "t": "Founder & CEO", "bg": "Founded Thryve Capital and built it into one of the country's largest MCA lenders with over $1 billion funded. Also serves as Principal at L2 Investments.", "li": ""},
      {"n": "Fritz Desir", "t": "Director, ISO Relations", "bg": "Manages ISO partnerships and deal flow for Thryve Capital, one of the largest MCA operations in the country.", "li": "https://www.linkedin.com/in/fritz-desir-477747142/"}
    ],
    "news": [
      {"h": "Thryve Capital Surpasses $1 Billion in Funding", "s": "Company Reports, 2025", "d": "Thryve Capital has funded over $1 billion since inception, cementing its position as one of the country's largest MCA lenders."},
      {"h": "Thryve Capital Featured on deBanked TV", "s": "deBanked TV, 2024", "d": "Thryve Capital was featured on deBanked's media platform showcasing its MCA and ISO operations."}
    ],
    "ice": "Steve, with $1B+ funded and one of the largest ISO networks in the country, how is Thryve Capital leveraging technology to maintain its competitive edge in underwriting?",
    "icebreakers": [
      "Being both a direct funder and one of the largest ISOs gives Thryve a unique perspective -- what's the biggest underwriting challenge at that scale?",
      "With $1B+ in MCA funding, the volume of deals you're processing must be enormous -- how does your underwriting team keep up?",
      "Fritz, as Director of ISO Relations, what do your ISO partners value most -- speed, approval rates, or deal size?",
      "Thryve's ability to fund the full merchant credit spectrum requires sophisticated underwriting -- are you exploring AI to enhance that?"
    ],
    "tp": [
      "At $1B+ funded, HyperVerge's AI underwriting can help Thryve Capital process its massive deal volume faster, cutting review from 40 minutes to under 5 minutes.",
      "As both a direct funder and ISO, HyperVerge can streamline underwriting across both sides of your business with consistent AI-powered decisions.",
      "450+ MCA companies including PIRS Capital already use HyperVerge -- we're the industry standard for high-volume MCA underwriting automation."
    ],
    "ask": "Steve, as one of the largest MCA lenders in the country, would you be open to seeing how HyperVerge's AI can help Thryve Capital process even more deals from your massive ISO network?"
  },
  {
    "id": 1761,
    "name": "TIGER CAPITAL",
    "desc": "Direct funder providing unsecured business financing without collateral, founded in 2016 and headquartered at 88 Pine St in Lower Manhattan. Has helped over 5,000 businesses nationwide with fast 24-hour decisions.",
    "contacts": [
      {"n": "Dov L.", "t": "CEO"}
    ],
    "leaders": [
      {"n": "Dov L.", "t": "CEO", "bg": "Leads Tiger Capital Funding's unsecured business financing operations, serving 5,000+ businesses nationwide since 2016.", "li": ""}
    ],
    "news": [
      {"h": "Tiger Capital Funding Serves 5,000+ Businesses Nationwide", "s": "Company Reports, 2025", "d": "Tiger Capital has grown to serve over 5,000 businesses with unsecured financing and 24-hour decision-making."}
    ],
    "ice": "With 5,000+ businesses served and 277 employees, Tiger Capital is one of the larger direct funders in the space -- how are you thinking about AI to scale your underwriting capacity even further?",
    "icebreakers": [
      "277 employees makes Tiger Capital a significant operation -- what portion of your team handles underwriting and how could that be more efficient?",
      "Unsecured financing without collateral means underwriting is everything -- how sophisticated is your current risk assessment process?",
      "24-hour decisions are table stakes now -- are you looking to get that down to same-hour with technology?",
      "Since 2016, you've built a 5,000+ business portfolio -- what operational improvements would help Tiger Capital reach the next milestone?"
    ],
    "tp": [
      "With 277 employees and high deal volume, HyperVerge's AI underwriting could save Tiger Capital hundreds of hours per week, cutting review from 40 minutes to under 5 minutes.",
      "For unsecured financing, HyperVerge's AI analyzes bank statements and revenue data to make faster, more accurate risk assessments -- exactly what you need without collateral.",
      "450+ MCA companies including PIRS Capital already use HyperVerge. At your scale, the ROI on AI underwriting automation is significant."
    ],
    "ask": "With 277 employees and 5,000+ businesses served, would Tiger Capital be interested in seeing how HyperVerge's AI can help your underwriting team process significantly more unsecured deals per day?"
  },
  {
    "id": 1766,
    "name": "TRUST CAPITAL",
    "desc": "National equipment financing and business working capital company based in San Diego, California, founded in 2013. Specializes in transactions from $25K to $50M+ for manufacturers, vendors, and dealers. CEO is Paul Kendall.",
    "contacts": [
      {"n": "Paul Kendall", "t": "Founder, CEO & President"}
    ],
    "leaders": [
      {"n": "Paul Kendall", "t": "Founder, CEO & President", "bg": "Founded Trust Capital in 2013, brings 15+ years of equipment financing experience. Specializes in both small-market and large-ticket transactions up to $50M+.", "li": "https://www.linkedin.com/in/pauldkendall/"}
    ],
    "news": [
      {"h": "Trust Capital Expands Equipment Financing Operations", "s": "Company Blog, 2025", "d": "Trust Capital continues to grow its national equipment financing operations, serving manufacturers, vendors, and dealers."}
    ],
    "ice": "Paul, with 15+ years in equipment financing and transactions ranging from $25K to $50M+, how is Trust Capital thinking about leveraging AI to streamline underwriting across such diverse deal sizes?",
    "icebreakers": [
      "The range from $25K to $50M+ requires very different underwriting approaches -- how does Trust Capital handle that complexity?",
      "As an equipment financing specialist, what's the most time-consuming part of your underwriting and approval process?",
      "Trust Capital serves manufacturers, vendors, and dealers -- how do you customize your underwriting for each segment?",
      "Paul, with your 15+ years of experience, where do you see the biggest opportunity for technology in equipment financing?"
    ],
    "tp": [
      "HyperVerge can help Trust Capital process the high volume of small-to-mid market deals faster, cutting review from 40 minutes to under 5 minutes with AI.",
      "Our platform adapts to different deal types and sizes -- perfect for Trust Capital's diverse portfolio from $25K to $50M+.",
      "450+ lending companies including PIRS Capital use HyperVerge. Our AI platform integrates with existing equipment finance workflows."
    ],
    "ask": "Paul, would you be open to seeing how HyperVerge's AI can help Trust Capital process equipment financing applications faster, especially for the high-volume small and mid-market deals?"
  },
  {
    "id": 1767,
    "name": "UFS",
    "desc": "Unique Funding Solutions, founded in 2016 in Brooklyn, New York. MCA and alternative financing direct funder serving diverse industries including automotive repair, medical practices, construction, and retail. Known for fast 24-hour funding.",
    "contacts": [
      {"n": "Jake Winograd", "t": "Partner"},
      {"n": "Irving Winograd", "t": "Head of Business Development"},
      {"n": "Eli Ghoori", "t": "Partner"}
    ],
    "leaders": [
      {"n": "Jake Winograd", "t": "Partner", "bg": "Partner at Unique Funding Solutions managing funding operations and deal flow for the Brooklyn-based MCA funder.", "li": ""},
      {"n": "Irving Winograd", "t": "Head of Business Development", "bg": "Leads business development and ISO relationships at UFS, driving deal flow across diverse industries.", "li": "https://www.linkedin.com/in/irving-winograd-9bb30112b/"}
    ],
    "news": [
      {"h": "UFS Continues Growth in Alternative Business Financing", "s": "Industry Reports, 2025", "d": "Unique Funding Solutions maintains its position as a reliable MCA funder with fast 24-hour funding across diverse industries."}
    ],
    "ice": "Jake and Irving, UFS has built a strong reputation for fast 24-hour funding -- as deal volume grows, how is your underwriting team scaling to maintain that speed?",
    "icebreakers": [
      "UFS serves such diverse industries from auto repair to medical practices -- how do you handle the different underwriting criteria for each?",
      "Your reputation for working with challenging credit profiles requires sophisticated risk assessment -- are you exploring AI for that?",
      "Irving, as head of business development, what do ISOs and brokers tell you they value most about working with UFS?",
      "Since 2016, UFS has grown steadily -- what would help you process more deals per day without adding staff?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help UFS maintain its 24-hour funding promise while processing significantly more deals, cutting review from 40 minutes to under 5 minutes.",
      "Our platform handles diverse industry underwriting criteria -- perfect for UFS's cross-sector approach spanning auto repair, medical, construction, and retail.",
      "450+ MCA companies including PIRS Capital already use HyperVerge. We're proven for direct funders like UFS that prioritize speed and volume."
    ],
    "ask": "Would UFS be interested in a demo showing how HyperVerge's AI can help you process more deals per day while maintaining your 24-hour funding turnaround?"
  },
  {
    "id": 1769,
    "name": "UNITED FIRST FUNDING",
    "desc": "Privately owned specialty finance and alternative funding platform at 800 Third Ave, New York. Founded by investment banking, commercial banking, and mortgage banking experts. Provides MCAs, business loans, invoice factoring, and equipment financing.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Founded by a group of investment banking, commercial banking, and mortgage banking experts who wanted to provide alternative funding solutions for underserved businesses.", "li": ""}
    ],
    "news": [
      {"h": "United Fundings Expands Alternative Financing Platform", "s": "Company Reports, 2025", "d": "United Fundings continues to grow its specialty finance platform offering MCAs, business loans, factoring, and equipment financing."}
    ],
    "ice": "With a team of investment banking and commercial banking veterans, United Fundings brings institutional-grade expertise to alternative lending -- how are you leveraging that background to innovate on underwriting?",
    "icebreakers": [
      "Your founding team's banking background is a differentiator -- how does that translate into your underwriting approach?",
      "Offering five different funding products requires versatile underwriting -- how does your team handle that complexity?",
      "As a specialty finance platform, where do you see the biggest opportunity for technology to improve your operations?",
      "What's the typical underwriting turnaround time at United Fundings, and are you looking to accelerate it?"
    ],
    "tp": [
      "HyperVerge's AI underwriting complements United Fundings' institutional expertise by automating the review process, cutting it from 40 minutes to under 5 minutes.",
      "With five different funding products, HyperVerge's customizable workflows handle different underwriting criteria for MCAs, term loans, factoring, and equipment financing.",
      "450+ MCA companies including PIRS Capital trust HyperVerge for AI-powered underwriting automation."
    ],
    "ask": "Would United Fundings be interested in seeing how HyperVerge's AI can help your team of banking veterans process deals faster across all five of your funding products?"
  },
  {
    "id": 1776,
    "name": "Finstro",
    "desc": "Australian-founded fintech providing technology-powered trade credit and B2B payment solutions, established in 2014. Has supported 7,000+ SMBs with AUD $1B+ in capital. Expanding to the US market under CEO Brad Prout.",
    "contacts": [
      {"n": "Brad Prout", "t": "Founder & CEO"}
    ],
    "leaders": [
      {"n": "Brad Prout", "t": "Founder & CEO", "bg": "Founded Finstro in Sydney in 2014, relocated to the US to oversee expansion into the $26 trillion B2B market. Has grown the platform to 7,000+ SMBs and AUD $1B+ in capital deployed.", "li": ""}
    ],
    "news": [
      {"h": "Finstro Expands Into US B2B Payments Market", "s": "Business Wire, 2021-2025", "d": "Finstro launched US operations with corporate card and ERP platform, targeting the $26 trillion B2B payments market."},
      {"h": "Finstro Surpasses AUD $1 Billion in Capital Provided", "s": "Company Reports, 2025", "d": "Since 2014, Finstro has provided over AUD $1 billion in capital to more than 7,000 small and medium businesses."},
      {"h": "Finstro Introduces Corporate Card and ERP Platform in the US", "s": "Commercial Payments International, 2025", "d": "Finstro launched its trade credit, corporate card, and ERP integration platform for US businesses."}
    ],
    "ice": "Brad, the move from Australia to the US with AUD $1B+ in lending experience is exciting -- as you scale in the US B2B market, how are you thinking about underwriting automation to handle US-specific credit assessment?",
    "icebreakers": [
      "Taking a proven Australian fintech model to the US $26 trillion B2B market is ambitious -- what's been the biggest challenge in adapting your underwriting for US businesses?",
      "With 7,000+ SMBs served in Australia, you have deep experience -- how does the US market differ in terms of underwriting needs?",
      "Your data-driven credit engine is impressive -- are you looking to enhance it with AI for the US market?",
      "Brad, as you expand your US team, how are you scaling underwriting capacity to match the growth?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help Finstro scale its US operations faster, cutting review time from 40 minutes to under 5 minutes for US business credit assessment.",
      "As you adapt your Australian model for the US, HyperVerge provides US-market-specific AI underwriting that 450+ American lending companies already trust.",
      "Speed up your US expansion by leveraging HyperVerge's proven platform rather than building underwriting automation from scratch."
    ],
    "ask": "Brad, as Finstro scales in the US, would you be interested in seeing how HyperVerge's AI underwriting can accelerate your US market penetration with faster, more accurate credit decisions?"
  },
  {
    "id": 1777,
    "name": "General Merchant Funding",
    "desc": "Hartford, Connecticut-based MCA and business lending company, providing merchant cash advances, SBA loans, unsecured loans, and equipment financing to small and medium businesses since 2009.",
    "contacts": [
      {"n": "Craig Clark", "t": "President & Key Principal"}
    ],
    "leaders": [
      {"n": "Craig Clark", "t": "President & Key Principal", "bg": "Leads General Merchant Funding's operations since 2009, providing MCA and business lending solutions to SMBs across the United States.", "li": "https://www.linkedin.com/in/craig-clark-b17ba4148/"}
    ],
    "news": [
      {"h": "General Merchant Funding Marks 15+ Years Serving Small Businesses", "s": "Company Reports, 2025", "d": "General Merchant Funding continues to provide real solutions to small and medium businesses since its 2009 founding."}
    ],
    "ice": "Craig, with 15+ years in the MCA and business lending space, you've seen the industry evolve significantly -- how is General Merchant Funding adapting to the AI revolution in underwriting?",
    "icebreakers": [
      "15+ years in business lending gives you incredible perspective -- what's changed most about underwriting in that time?",
      "Hartford isn't a typical hub for MCA companies -- how does General Merchant Funding compete nationally from Connecticut?",
      "With MCA, SBA, and equipment financing products, how does your team handle the different underwriting requirements?",
      "Craig, what technology improvements would have the biggest impact on General Merchant Funding's operations right now?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help General Merchant Funding process applications faster across all product types, cutting review from 40 minutes to under 5 minutes.",
      "With 15+ years of lending data, HyperVerge's AI can leverage your historical insights to make even smarter underwriting decisions.",
      "450+ MCA companies including PIRS Capital already use HyperVerge -- proven technology for established funders like General Merchant Funding."
    ],
    "ask": "Craig, after 15+ years of building General Merchant Funding, would you be open to seeing how HyperVerge's AI can help you process more deals with the same team?"
  },
  {
    "id": 1778,
    "name": "Imperial Advance",
    "desc": "New York-based MCA and alternative lending company, now rebranded as Funderial. Established in 2010 with offices near Wall Street. Has funded over $2 billion in business loans nationwide with 30+ years of combined leadership experience.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Executives with 30+ years of combined experience in lending and financial services, built Funderial (formerly Imperial Advance) to $2B+ in fundings.", "li": ""}
    ],
    "news": [
      {"h": "Imperial Advance Rebrands as Funderial", "s": "Company Updates, 2024", "d": "Imperial Advance rebranded to Funderial while maintaining its NYC headquarters and $2B+ track record in business lending."},
      {"h": "Funderial Continues Growth in Alternative Lending", "s": "Industry Reports, 2025", "d": "Funderial (formerly Imperial Advance) maintains its position as a major MCA and business lending provider with nationwide operations."}
    ],
    "ice": "The rebrand from Imperial Advance to Funderial signals a new chapter -- with $2B+ funded, how is the leadership team thinking about modernizing the underwriting process as part of this evolution?",
    "icebreakers": [
      "The Funderial rebrand suggests a fresh start -- are you also looking at new technology for your underwriting operations?",
      "With $2B+ funded over 14 years, your deal volume must be significant -- how is your underwriting team handling it?",
      "30+ years of combined leadership experience is impressive -- how has the team's approach to underwriting evolved?",
      "As you transition to the Funderial brand, what operational improvements are you prioritizing?"
    ],
    "tp": [
      "A rebrand is the perfect time to upgrade technology -- HyperVerge's AI underwriting cuts review from 40 minutes to under 5 minutes.",
      "With $2B+ funded, HyperVerge can help Funderial process its massive deal volume more efficiently while maintaining underwriting quality.",
      "450+ MCA companies including PIRS Capital already use HyperVerge -- we're the industry standard for AI-powered underwriting automation."
    ],
    "ask": "As Funderial enters a new chapter, would you be interested in seeing how HyperVerge's AI underwriting can be part of the company's modernization strategy?"
  },
  {
    "id": 1779,
    "name": "Imperial Funding",
    "desc": "Full-service investment bank headquartered in Los Angeles, California, co-founded in 1997 by Randall Wooster. Offers capital markets, advisory services, institutional sales and trading, and research capabilities to middle market companies. 150+ professionals across global offices.",
    "contacts": [
      {"n": "Randall Wooster", "t": "Co-Founder & CEO"},
      {"n": "Christopher Shepard", "t": "Head of Investment Banking & Capital Markets"}
    ],
    "leaders": [
      {"n": "Randall Wooster", "t": "Co-Founder & CEO", "bg": "Co-founded Imperial Capital in 1997 after serving as Managing Director at predecessor firm managing sales and trading. Nationally recognized in investment banking.", "li": "https://www.linkedin.com/in/randy-wooster-626700106/"},
      {"n": "Christopher Shepard", "t": "Head of Investment Banking & Capital Markets", "bg": "Leads Imperial Capital's investment banking division and capital markets operations across multiple global offices.", "li": ""}
    ],
    "news": [
      {"h": "Imperial Capital Maintains Position as Leading Middle Market Investment Bank", "s": "Industry Reports, 2025", "d": "Imperial Capital continues to serve middle market companies with advisory, capital markets, and restructuring services from offices worldwide."}
    ],
    "ice": "Randall, with nearly 30 years building Imperial Capital into a nationally recognized investment bank, you've seen the evolution of financial services firsthand -- how are you advising middle market clients on AI adoption?",
    "icebreakers": [
      "Imperial Capital's advisory services give you deep insight into middle market trends -- are your lending clients asking about AI for underwriting?",
      "With offices spanning LA to Tel Aviv, how is Imperial Capital thinking about technology standardization across operations?",
      "150+ professionals is a significant team -- what role does technology play in maintaining efficiency at that scale?",
      "The middle market is rapidly adopting fintech -- what trends are you seeing among your lending and finance clients?"
    ],
    "tp": [
      "HyperVerge's AI underwriting is transforming middle market lending -- your lending clients could benefit from cutting review time from 40 minutes to under 5 minutes.",
      "As an investment bank advising middle market companies, recommending HyperVerge to your lending clients adds value -- 450+ companies already use our platform.",
      "Imperial Capital's clients in the lending space can gain a competitive edge with AI underwriting automation, which is rapidly becoming industry standard."
    ],
    "ask": "Randall, would you be open to a conversation about how HyperVerge's AI underwriting platform could benefit Imperial Capital's lending and finance clients in the middle market?"
  },
  {
    "id": 1781,
    "name": "Revenue Funding",
    "desc": "Florida-based MCA and revenue-based financing company providing merchant cash advances and business funding to small businesses. Operates as a direct funder in the alternative lending space.",
    "contacts": [
      {"n": "Management Team", "t": "Leadership"}
    ],
    "leaders": [
      {"n": "Management Team", "t": "Leadership", "bg": "Leads Revenue Funding's MCA and revenue-based financing operations in Florida.", "li": ""}
    ],
    "news": [
      {"h": "Revenue Funding Active in Florida MCA Market", "s": "Industry Reports, 2025", "d": "Revenue Funding continues to provide merchant cash advances and revenue-based financing to small businesses in Florida and nationwide."}
    ],
    "ice": "As a Florida-based MCA funder in one of the most competitive markets in the country, how is Revenue Funding thinking about technology to improve underwriting speed and accuracy?",
    "icebreakers": [
      "Florida is a hotbed for MCA companies -- how does Revenue Funding differentiate in this crowded market?",
      "What's your current underwriting turnaround time, and is there pressure to make it faster?",
      "As a direct funder, how many deals does Revenue Funding process per day and what's the biggest bottleneck?",
      "Are you exploring AI or automation to improve your underwriting and deal processing efficiency?"
    ],
    "tp": [
      "HyperVerge's AI underwriting can help Revenue Funding stand out in Florida's competitive MCA market by cutting review time from 40 minutes to under 5 minutes.",
      "450+ MCA companies including PIRS Capital already use HyperVerge -- proven technology for revenue-based financing operations.",
      "Faster underwriting means winning more deals from brokers and ISOs who send their best deals to the fastest funders."
    ],
    "ask": "Would Revenue Funding be open to a demo showing how HyperVerge can help you process MCA applications faster and win more deals in the competitive Florida market?"
  },
  {
    "id": 1782,
    "name": "Smartbiz",
    "desc": "Fintech-turned-bank that acquired Centrust Bank in March 2025 to become SmartBiz Bank. First fintech to become a bank in Trump's second term. Has facilitated 230,000+ loans for $9B+, specializing in SBA and small business lending. CEO Evan Singer.",
    "contacts": [
      {"n": "Evan Singer", "t": "CEO & Chair of the Board"},
      {"n": "Gerard Buccino", "t": "President (former Centrust CEO)"}
    ],
    "leaders": [
      {"n": "Evan Singer", "t": "CEO & Chair of the Board", "bg": "CEO of SmartBiz since 2013, led the landmark acquisition of Centrust Bank making SmartBiz the first fintech to become a bank in the current administration. Oversees 230,000+ loans totaling $9B+.", "li": ""},
      {"n": "Gerard Buccino", "t": "President", "bg": "Former CEO of Centrust Bank, now serves as President of SmartBiz Bank following the acquisition.", "li": ""}
    ],
    "news": [
      {"h": "SmartBiz Acquires Centrust Bank, Becomes First Fintech Bank Under New Administration", "s": "Banking Dive, Mar 2025", "d": "SmartBiz completed acquisition of Centrust Bank with OCC and Federal Reserve approval, becoming SmartBiz Bank."},
      {"h": "SmartBiz Bank Announces Board and Management Structure", "s": "Business Wire, Apr 2025", "d": "SmartBiz Bank revealed its official leadership structure with Evan Singer as CEO and Gerard Buccino as President."},
      {"h": "SmartBiz Bank Releases First-Ever State of Small Business Report", "s": "Business Wire, May 2025", "d": "SmartBiz Bank published its inaugural industry pulse report on the state of small business lending."}
    ],
    "ice": "Evan, congratulations on the landmark Centrust Bank acquisition -- becoming the first fintech bank under this administration is historic. As you scale nationally with SBA lending, how is SmartBiz thinking about AI to handle the increased underwriting volume?",
    "icebreakers": [
      "The Centrust acquisition is a game-changer -- as you launch national deposit products, how will that affect your lending volume and underwriting capacity?",
      "230,000+ loans and $9B+ is remarkable -- with bank charter in hand, what's the next growth frontier for SmartBiz Bank?",
      "First fintech bank under this administration is a major milestone -- how does having a bank charter change your approach to underwriting?",
      "The State of Small Business report shows you're an industry thought leader -- what trends are you seeing in SBA lending technology?"
    ],
    "tp": [
      "As SmartBiz Bank scales nationally with its new charter, HyperVerge's AI underwriting can help process the surge in SBA applications, cutting review from 40 minutes to under 5 minutes.",
      "With 230,000+ loans already facilitated, HyperVerge's AI can maintain SmartBiz Bank's underwriting quality at even higher volumes.",
      "450+ lending companies already use HyperVerge, and our platform supports SBA-specific underwriting workflows that align with SmartBiz Bank's core business."
    ],
    "ask": "Evan, as SmartBiz Bank enters its next growth phase with a bank charter, would you be interested in seeing how HyperVerge's AI can help you scale SBA underwriting nationally?"
  },
  {
    "id": 1785,
    "name": "YELLOWSTONE CAPITAL",
    "desc": "Former major MCA lender based in Houston, Texas, now defunct following a $1.065 billion settlement with the NY Attorney General in January 2025. CEO Isaac Stern and President Jeffrey Reece were permanently banned from the MCA industry.",
    "contacts": [
      {"n": "Isaac Stern", "t": "Former CEO (banned from MCA industry)"},
      {"n": "Jeffrey Reece", "t": "Former President (banned from MCA industry)"}
    ],
    "leaders": [
      {"n": "Isaac Stern", "t": "Former CEO", "bg": "Founded Yellowstone Capital, settled with NY Attorney General for $1.065B in January 2025. Permanently banned from the MCA industry.", "li": ""},
      {"n": "Jeffrey Reece", "t": "Former President", "bg": "Former Director of Cogent Partners who joined Yellowstone as President. Settled with NY AG and permanently banned from MCA industry.", "li": ""}
    ],
    "news": [
      {"h": "NY Attorney General Announces $1.065 Billion Settlement with Yellowstone Capital", "s": "NY AG Office, Jan 2025", "d": "Yellowstone Capital settled for $1.065B, canceling $534M in outstanding debts and paying $16.1M in restitution to small businesses."},
      {"h": "Yellowstone Capital Leadership Permanently Banned from MCA Industry", "s": "Hudson Cook LLP, Jan 2025", "d": "CEO Isaac Stern and President Jeffrey Reece were permanently banned from the merchant cash advance industry as part of the settlement."},
      {"h": "Yellowstone Capital Ordered to Cancel Over $534 Million in Small Business Debt", "s": "FindLaw, Jan 2025", "d": "Yellowstone must cancel all outstanding merchant debts totaling $534.5M and cease all collection activities."}
    ],
    "ice": "The Yellowstone settlement was a major inflection point for the MCA industry -- it highlights the importance of proper underwriting and compliance. How are you thinking about this at your organization?",
    "icebreakers": [
      "The $1B Yellowstone settlement has sent shockwaves through the MCA industry -- what does this mean for how funders approach compliance and underwriting?",
      "With Yellowstone's leaders permanently banned, the industry is clearly under scrutiny -- how important is underwriting quality to avoiding similar issues?",
      "The Yellowstone case shows the consequences of poor underwriting practices -- how is the industry responding?",
      "Note: Yellowstone Capital is no longer operational following the January 2025 settlement."
    ],
    "tp": [
      "The Yellowstone settlement underscores why proper AI-powered underwriting matters -- HyperVerge helps funders maintain compliant, consistent underwriting standards.",
      "HyperVerge's AI underwriting provides an auditable, consistent decision-making process that helps funders avoid the compliance issues that led to Yellowstone's downfall.",
      "450+ MCA companies use HyperVerge to ensure proper underwriting documentation and risk assessment -- critical in today's regulatory environment."
    ],
    "ask": "Note: Yellowstone Capital is no longer operational. Use the Yellowstone case as a talking point with other funders about the importance of proper AI-powered underwriting and compliance."
  }
]
