[
  {
    "id": 1412,
    "name": "Superior Capital",
    "leaders": [
      {
        "n": "Unknown (Funding Director)",
        "t": "Funding Director",
        "bg": "Funding Director at Superior Capital Fund LLC, the primary point of contact for ISO partners and financial professionals seeking to submit merchant cash advance deals. Manages underwriting submissions and ensures 24-hour file review turnaround for all ISO partners. Oversees the company's flexible, non-SIC code dependent underwriting process that allows Superior Capital to fund high-risk MCA deals through ACH/bank-only transactions.",
        "hooks": [
          "24-hour underwriting turnaround guarantee for ISOs",
          "High-risk MCA specialist with flexible non-SIC underwriting"
        ],
        "li": ""
      }
    ],
    "desc": "Superior Capital Fund LLC is a direct funder of working capital advances focused on high-risk merchant cash advances. The company partners exclusively with ISOs (Independent Sales Organizations) and financial professionals — it does not accept direct applications from small businesses. Superior Capital prides itself on flexible, non-SIC code dependent underwriting, enabling it to fund a diverse range of merchants through ACH/bank-only deals. Every file submitted by an ISO partner is reviewed by an underwriter within 24 hours, with a concrete funding offer provided the same day, and funding completed within 24 hours of a signed contract. The company positions itself as a best-in-class high-risk MCA direct funding experience provider. Limited public information is available about the company's leadership team and founding history. Estimated 5-15 employees.",
    "news": [
      {
        "h": "Superior Capital Fund continues ISO-driven high-risk MCA direct funding operations",
        "s": "superiorcapitalfund.com",
        "d": "2025-01-01"
      }
    ],
    "location": "United States",
    "full_address": "",
    "website": "https://superiorcapitalfund.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1413,
    "name": "Swiftbridge Capital",
    "leaders": [
      {
        "n": "Ryan J Mink",
        "t": "Former Managing Director",
        "bg": "Former Managing Director at SwiftBridge Capital, based in Los Angeles. Education from Iona College. Previously held positions at Taycor Financial, ForwardLine Financial, Seek Capital, Granite, and 1-800Accountant. Has since moved to a Funding Manager role at Big Think Capital in Melville, New York. Experienced in small business lending and financial services across multiple platforms.",
        "hooks": [
          "Iona College alum with experience across multiple lending platforms",
          "Career spanning ForwardLine Financial, Taycor, and Seek Capital"
        ],
        "li": "https://www.linkedin.com/in/ryan-j-mink-a6914385/"
      }
    ],
    "desc": "Swiftbridge Capital is a financial services company founded in 2023, headquartered in Los Angeles, California. The company operates as a provider of financing solutions for small businesses, connecting them with a network of over 50 direct lender partnerships. Swiftbridge offers unsecured financing leveraging projected earnings, invoice factoring, business lines of credit, and SBA financing programs. The application process takes five minutes and is obligation-free, with underwriting typically completed in 2-3 hours and capital accessible in as little as 24 hours. The company serves businesses across the United States and Canada. Swiftbridge Capital operates as a broker/ISO connecting businesses to funders rather than funding from its own balance sheet. Estimated 5-10 employees.",
    "news": [
      {
        "h": "Swiftbridge Capital launches as business funding ally with 50+ lender partnerships",
        "s": "swiftbridgecapital.com",
        "d": "2023-06-01"
      }
    ],
    "location": "Los Angeles, CA",
    "full_address": "145 S. Fairfax Ave #335, Los Angeles, CA 90036",
    "website": "https://swiftbridgecapital.com",
    "employees": 8,
    "category": "iso"
  },
  {
    "id": 1414,
    "name": "Swish Funding, LLC",
    "leaders": [
      {
        "n": "Joel Bess",
        "t": "Co-Founder & CEO",
        "bg": "Co-Founder and CEO of Swish Funding LLC since 2021. Attended Harvard University. Over three years of leadership experience at Swish Funding, building the company into a provider of fast small business funding in Los Angeles. Also founded Optimal Fusion. Leads strategic direction, underwriting philosophy, and business development for the company's SME lending operations.",
        "hooks": [
          "Harvard University graduate",
          "Built Swish Funding from scratch in LA since 2021",
          "Also founded Optimal Fusion"
        ],
        "li": "https://www.linkedin.com/in/joelbess/"
      },
      {
        "n": "Zack Brown",
        "t": "Co-Founder",
        "bg": "Co-Founder of Swish Funding LLC, based in Los Angeles. Co-founded the company alongside Joel Bess in 2021. Active in hiring and growing the team — posted LinkedIn recruitment calls for Swish Funding's Los Angeles office. Plays a key role in operations and company growth strategy alongside CEO Joel Bess.",
        "hooks": [
          "Co-founded Swish Funding in 2021 alongside Harvard alum Joel Bess",
          "Actively recruiting and scaling the LA-based lending team"
        ],
        "li": "https://www.linkedin.com/in/zack-brown-4a44663/"
      }
    ],
    "desc": "Swish Funding LLC is a small business funding company founded in 2021 and headquartered in Los Angeles, California. The company provides financial solutions for small and medium-sized enterprises (SMEs), offering working capital, business lines of credit, equipment financing, and merchant cash advances with loans up to $5 million. Swish Funding is BBB accredited and emphasizes approval speed (minutes) with funding in as little as 48 hours. The company focuses on revenue history and year-round client retention rather than strict credit requirements, making it accessible to businesses across multiple industries including lawn care, cleaning services, consulting, and restaurants. The company has between 11-50 employees and has not raised external funding. Swish Funding operates as a direct funder of small business capital.",
    "news": [
      {
        "h": "Swish Funding hiring in Los Angeles to expand small business lending operations",
        "s": "LinkedIn",
        "d": "2024-07-01"
      },
      {
        "h": "Swish Funding achieves BBB accreditation for small business funding services",
        "s": "BBB",
        "d": "2024-01-01"
      }
    ],
    "location": "Los Angeles, CA",
    "full_address": "7162 Beverly Blvd Pmb 580, Los Angeles, CA 90036",
    "website": "https://swishfunding.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 1415,
    "name": "Tacoma Capital, Inc.",
    "leaders": [
      {
        "n": "Stacia McKnight",
        "t": "CEO & Co-Owner",
        "bg": "Chief Executive Officer and Co-Owner of Tacoma Capital, Inc., co-founded with husband Michael McKnight in 2016. Based in Wichita, Kansas. Brings expertise in business and financial management with 20+ years in the financial industry. Previously served as Co-Owner at NYY, LLC (dba Hoover Field), Co-Owner at Decorus Investments LLC (civil engineering construction), and Co-Owner at Gusto LLC (payroll/HR software). Leads the company's invoice factoring operations supporting small and middle-market businesses.",
        "hooks": [
          "Husband-wife team running Tacoma Capital since 2016",
          "20+ years in financial industry across multiple ventures",
          "Previous experience at Gusto LLC in payroll/HR space"
        ],
        "li": "https://www.linkedin.com/in/stacia-mcknight-01343a131"
      },
      {
        "n": "Michael McKnight",
        "t": "COO & Co-Owner",
        "bg": "Chief Operating Officer and Co-Owner of Tacoma Capital, Inc. in Wichita, Kansas. Co-founded the company with wife Stacia McKnight in 2016. Bachelor's degree from Kansas State University. Previously served as Director and Co-Founder at Attain Finance, contributing to personal loan products and accessible credit options. Also a co-owner of Decorus Investments LLC. Over 20 years of experience in the financial industry. Manages day-to-day operations and client relationships for Tacoma Capital's invoice factoring services.",
        "hooks": [
          "Kansas State University graduate",
          "Co-founded Attain Finance before launching Tacoma Capital",
          "Husband-wife co-ownership model with complementary roles"
        ],
        "li": "https://www.linkedin.com/in/michael-mcknight-833a332a/"
      }
    ],
    "desc": "Tacoma Capital, Inc. is an invoice factoring company founded in 2016 and headquartered in Wichita, Kansas. The company helps small and middle-market businesses across diverse industries gain access to working capital by converting their accounts receivable into immediate cash, providing advances of up to 90% of invoice value. Run by husband-and-wife team Stacia McKnight (CEO) and Michael McKnight (COO), who bring over 20 years of combined financial industry experience. Tacoma Capital is BBB accredited and registered as a government vendor (SAM.gov). The company generates approximately $5 million in revenue and employs 7 people. Note: Tacoma Capital is an invoice factoring company, not a traditional MCA funder.",
    "news": [
      {
        "h": "Tacoma Capital continues invoice factoring operations serving small and middle-market businesses",
        "s": "tacomacapital.com",
        "d": "2025-01-01"
      },
      {
        "h": "Tacoma Capital earns BBB accreditation in Wichita, Kansas",
        "s": "BBB",
        "d": "2024-01-01"
      }
    ],
    "location": "Wichita, KS",
    "full_address": "8535 E 21st St N, Ste 115, Wichita, KS 67206",
    "website": "https://tacomacapital.com",
    "employees": 7,
    "category": "funder"
  },
  {
    "id": 1416,
    "name": "THE SMARTER MERCHANT",
    "leaders": [
      {
        "n": "Aaron Cohen",
        "t": "Founder & CEO",
        "bg": "Founder and CEO of The Smarter Merchant, a leading fintech firm he launched in 2013. Under his leadership, the company has grown into one of the premier ISO-driven MCA direct funders in the industry, operating from their 8th-floor office at 345 7th Avenue in New York City. Led the company's adoption of Relativity6 AI-powered industry classification technology to optimize underwriting processes and deepen client risk profiling. Also launched a partnership with OneTreePlanted for environmental impact. Dedicated to leveraging cutting-edge technology to deliver superior experiences to clients and ISO partners.",
        "hooks": [
          "Launched AI-powered underwriting with Relativity6 partnership",
          "OneTreePlanted environmental partnership for social impact",
          "Built Smarter Merchant from scratch in 2013 into premier MCA funder"
        ],
        "li": "https://www.linkedin.com/in/aaron-cohen-2b195a16a/"
      },
      {
        "n": "Ari Cohen",
        "t": "Head of Sales",
        "bg": "Head of Sales at The Smarter Merchant, based in Miami. Over a decade of experience in financial services, specializing in credit cards and transaction processing. Leads the sales team, identifies new market opportunities, and forges strategic partnerships to expand the company's reach in the ISO-driven MCA space. Previously served as a Partner at Don Giovanni Ristorante, honing client relations and business development skills before transitioning to fintech.",
        "hooks": [
          "Based in Miami leading national sales for NY-based MCA funder",
          "Decade of experience in credit cards and transaction processing",
          "Transitioned from restaurant partner to fintech sales leader"
        ],
        "li": "https://www.linkedin.com/in/ari-cohen-b744ab172"
      },
      {
        "n": "Alan Brani",
        "t": "Director of Business Development",
        "bg": "Director of Business Development at The Smarter Merchant. Corporate executive focused on growing the company's ISO partnership network and expanding the firm's market presence in the MCA direct funding space. Works closely with the CEO and sales team to develop strategic relationships with brokers and financial professionals.",
        "hooks": [
          "Corporate executive driving ISO partnership growth",
          "Leads business development for premier MCA direct funder"
        ],
        "li": "https://www.linkedin.com/in/alan-brani-8b440416/"
      }
    ],
    "desc": "The Smarter Merchant is a New York-based alternative financing company that operates as a direct funder for merchant cash advances. Founded in 2013 by Aaron Cohen, the company is fully ISO-driven — it does not accept direct funding applications from small businesses. Instead, it partners with independent sales organizations (ISOs), brokers, and funding professionals who connect merchants with working capital solutions. The Smarter Merchant provides MCA products with technology-driven underwriting based on revenue trends, debit/credit card sales, and cash flow rather than strict credit requirements. The company has adopted Relativity6 AI-powered industry classification to optimize underwriting. Corporate office located on the 8th floor at 345 7th Avenue in Manhattan. The Smarter Merchant has also raised capital through Percent's private credit marketplace. Approximately 20 employees. Also reported operating from 460 Park Avenue, Manhattan.",
    "news": [
      {
        "h": "The Smarter Merchant selects Relativity6 for AI-powered industry classification to optimize underwriting",
        "s": "ABC27/PR Newswire",
        "d": "2024-02-29"
      },
      {
        "h": "The Smarter Merchant launches environmental campaign with OneTreePlanted",
        "s": "PR Newswire",
        "d": "2021-06-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "345 7th Ave, Fl 8, New York, NY 10001",
    "website": "https://www.thesmartermerchant.com",
    "employees": 20,
    "category": "funder"
  },
  {
    "id": 1417,
    "name": "Thor Capital Group",
    "leaders": [
      {
        "n": "Clemy Jajati",
        "t": "President / Senior Vice President",
        "bg": "President and Senior Vice President at Thor Capital Group LLC in Brooklyn, New York. Previously held the title of Funding Director at Thor Capital Group. Also serves as President at Thor Cellular, Inc., another Brooklyn-based company. Oversees all small business funding operations and client relationships for the direct lending firm. Key point of contact for ISO partners and businesses seeking merchant cash advances, small business loans, and other financing solutions in all 50 states.",
        "hooks": [
          "Runs both Thor Capital Group and Thor Cellular in Brooklyn",
          "Progressed from Funding Director to President/SVP",
          "Brooklyn-based operator managing multi-product lending firm"
        ],
        "li": "https://www.linkedin.com/in/clemy-jajati-a63a3481/"
      }
    ],
    "desc": "Thor Capital Group is a direct lending firm founded in 2019 and headquartered in Brooklyn, New York. The company provides fast and flexible financing solutions for small businesses across all 50 states, including merchant cash advances ($10,000 to $1 million), small business loans, collateral loans, business lines of credit, and invoice factoring. Thor Capital Group funds deals in 24-48 hours with minimal documentation requirements. The company works with businesses averaging a minimum of $10,000 per month in sales over the last three months, offering funding equal to 70-110% of monthly revenue. Thor Capital specializes in serving industries that other providers avoid, including restaurants, entertainment, general contracting, landscaping, hair/nail salons, and resorts. The company also serves gas station businesses specifically. Annual revenue approximately $1 million with 4 employees.",
    "news": [
      {
        "h": "Thor Capital Group expands small business funding services to gas station businesses nationwide",
        "s": "thorcapitalgroup.com",
        "d": "2024-06-01"
      },
      {
        "h": "Thor Capital Group continues offering SBA EIDL loans and flexible credit lines from Brooklyn HQ",
        "s": "BBB",
        "d": "2024-01-01"
      }
    ],
    "location": "Brooklyn, NY",
    "full_address": "1412 Avenue J, Ste 3A, Brooklyn, NY 11230",
    "website": "https://thorcapitalgroup.com",
    "employees": 4,
    "category": "funder"
  },
  {
    "id": 1418,
    "name": "Tin Funding Group",
    "leaders": [
      {
        "n": "Nguyen Le",
        "t": "CEO & Founder",
        "bg": "CEO and Founder of Tin Funding Group LLC, established in 2020. Holds an MBA degree. Founded the company to help small and medium-sized businesses across the U.S. and Canada access fast and flexible capital, particularly those facing credit challenges or limited funding options. Built a bilingual team (English-Vietnamese) and expanded operations across offices in Texas, New York, Alabama, and Canada. Registered as LLC member alongside Tu Quyen Thi Nguyen in Alabama. Based in Mobile, Alabama area.",
        "hooks": [
          "MBA graduate who founded bilingual MCA firm serving U.S. and Canada",
          "Built English-Vietnamese lending team across 4 offices",
          "Focused on underserved businesses with credit challenges"
        ],
        "li": "https://www.linkedin.com/in/nguyen-le-b44aab185"
      }
    ],
    "desc": "Tin Funding Group (TFG) is a financial solutions provider founded in 2020 and registered in Birmingham, Alabama. The company helps small and medium-sized businesses across the U.S. and Canada access fast and flexible capital, with a particular focus on businesses facing credit challenges or limited funding options. TFG's core product is merchant cash advance (MCA), a revenue-based financing option that does not require collateral or high credit scores, based on the average revenue of the last 3 months. The company serves a wide range of businesses including nail salons, restaurants, and retail shops. Clients can get approved and funded in 24-48 hours with minimal documentation (bank statements, ID, voided check). TFG operates offices in Texas, New York, Alabama, and Canada, with a bilingual English-Vietnamese team. The company was formed as an LLC on October 18, 2021 with registered office at 2100 Southbridge Parkway Suite 650, Birmingham, Alabama. Estimated 5-10 employees. Rated on Trustpilot.",
    "news": [
      {
        "h": "Tin Funding Group expands bilingual MCA operations to Canadian market",
        "s": "tinfundinggroup.com",
        "d": "2024-06-01"
      },
      {
        "h": "TFG grows office presence across Texas, New York, Alabama, and Canada",
        "s": "LinkedIn",
        "d": "2024-01-01"
      }
    ],
    "location": "Birmingham, AL",
    "full_address": "2100 Southbridge Parkway, Suite 650, Birmingham, AL 35209",
    "website": "https://www.tinfundinggroup.com",
    "employees": 8,
    "category": "funder"
  },
  {
    "id": 1419,
    "name": "Titan Funding Solutions",
    "leaders": [
      {
        "n": "Joe (Contact)",
        "t": "Founder / Principal",
        "bg": "Founder or principal operator of Titan Funding Solutions, an online business funding marketplace based in Buffalo, New York. Established the company in 2020 to help business owners and real estate investors access diversified financing options. Contact email: joe@titanfundingsolutions.com. Manages the company's wide range of financing products including merchant cash advances, SBA loans, equipment financing, and commercial mortgages. Limited additional public biographical information available.",
        "hooks": [
          "Built online lending marketplace from Buffalo, NY",
          "Offers one of the widest product ranges in SMB lending"
        ],
        "li": ""
      }
    ],
    "desc": "Titan Funding Solutions is an online business funding marketplace founded in 2020 and based in Buffalo, New York. The company helps business owners and real estate investors access a wide range of financing options including merchant cash advances, small business loans, business lines of credit, equipment financing, SBA loans, accounts receivable financing, asset-based loans, franchise financing, startup funding, and commercial real estate lending. Titan Funding Solutions offers an easy 30-second application with options available in minutes and funding in hours. No minimum FICO score is required for most financing options, with a minimum revenue requirement of $5,000 per month ($60,000 annual gross sales). The company operates as a marketplace/broker connecting businesses with multiple financing products rather than funding from its own balance sheet. Estimated 2-5 employees. Not to be confused with Titan Funding LLC (hard money lender in Boca Raton, FL) or Titan Funding Partners.",
    "news": [
      {
        "h": "Titan Funding Solutions expands online lending marketplace to include commercial real estate and franchise financing",
        "s": "titanfundingsolutions.com",
        "d": "2024-06-01"
      }
    ],
    "location": "Buffalo, NY",
    "full_address": "",
    "website": "https://titanfundingsolutions.com",
    "employees": 3,
    "category": "iso"
  },
  {
    "id": 1420,
    "name": "TMR Now",
    "leaders": [
      {
        "n": "Jason Reddish",
        "t": "Co-Founder & CEO",
        "bg": "Co-Founder and Chief Executive Officer of Total Merchant Resources / TMR Now, which he launched in 2008 alongside Val Pinkhasov. Educated at NYU Stern School of Business. Featured on CNBC's Shark Tank (Season 5, Episode 509, October 2013) where the company secured a deal. Background in the mortgage industry before entering merchant cash advance space as one of the earliest entrants. TMR saw a 500% increase in business following the Shark Tank appearance. Secured $20 million in private equity for TMR Now wholesale funding division. Guest speaker on numerous radio shows, TV newscasts, and tradeshow conventions. TMR's capital is fully private with complete underwriting autonomy.",
        "hooks": [
          "*Featured on CNBC Shark Tank — closed a deal on the show",
          "NYU Stern School of Business graduate",
          "One of the earliest MCA industry pioneers since 2008",
          "Secured $20M in private equity for TMR Now division"
        ],
        "li": "https://www.linkedin.com/in/jason-t-reddish-1bab9a68/"
      },
      {
        "n": "Val Pinkhasov",
        "t": "Co-Founder & President",
        "bg": "Co-Founder and President of Total Merchant Resources / TMR Now since 2008. Background in the mortgage industry before co-founding TMR with Jason Reddish. Featured on CNBC's Shark Tank (Season 5, 2013) alongside Reddish, where Kevin O'Leary initially offered $200K for 50% — they countered and closed at $250K for 25%. TMR is described as 'the only finance company to close a deal on Shark Tank.' Helped secure a California lending license, making TMR one of the few MCA companies licensed in California. Guest speaker on radio shows, TV, and industry conventions.",
        "hooks": [
          "*Closed the only finance deal in Shark Tank history",
          "Secured rare California lending license for MCA company",
          "Mortgage industry veteran turned MCA pioneer",
          "TMR saw 500% business increase after Shark Tank appearance"
        ],
        "li": "https://www.linkedin.com/in/val-pinkhasov-57305745/"
      }
    ],
    "desc": "TMR Now is the wholesale funding division of Total Merchant Resources LLC, a merchant cash advance company founded in 2008 by Jason Reddish and Val Pinkhasov and headquartered in Piscataway, New Jersey. The company is notable for being featured on CNBC's Shark Tank (Season 5, 2013), where the founders secured a deal — TMR is described as the only finance company to close a deal on Shark Tank, after which they saw a 500% increase in business. TMR Now was launched with $20 million in private equity as a wholesale funding division serving ISOs coast to coast. Total Merchant Resources is one of the few MCA companies to obtain a California lending license. The company's capital is entirely private with no external underwriting constraints, allowing them to create proprietary programs with common-sense pricing. TMR serves both direct small business clients and wholesale ISO partnerships. Approximately 11 employees. Based in Piscataway, NJ.",
    "news": [
      {
        "h": "Total Merchant Resources launches TMR Now wholesale funding division with $20M in private equity",
        "s": "totalmerchantresources.com",
        "d": "2025-01-01"
      },
      {
        "h": "Total Merchant Resources obtains California lending license, one of few MCA companies to do so",
        "s": "deBanked",
        "d": "2016-10-01"
      },
      {
        "h": "TMR founders Jason Reddish and Val Pinkhasov close deal on CNBC Shark Tank Season 5",
        "s": "CNBC Shark Tank",
        "d": "2013-10-25"
      }
    ],
    "location": "Piscataway, NJ",
    "full_address": "377 Hoes Lane, Suite 240, Piscataway, NJ 08854",
    "website": "https://tmrnow.com",
    "employees": 11,
    "category": "funder"
  },
  {
    "id": 1421,
    "name": "TradeCap Partners",
    "leaders": [
      {
        "n": "Bryan Ballowe",
        "t": "Co-Founder & Managing Partner",
        "bg": "Co-Founder and Managing Partner of TradeCap Partners LLC. Prior to founding TradeCap, served as Vice President and Chief Operating Officer at King Trade Capital for 20 years, with experience in underwriting, portfolio management, and as a principal and investment committee member. Started his financial career in banking as a global financial analyst underwriting senior debt and high yield bonds for media and telecom companies. Holds a B.B.A. in Finance and B.S. in Economics from Southern Methodist University, as well as an MBA in Corporate Finance from SMU. Over 20 years of experience in PO (Purchase Order) finance. Serves on the board of The Finance Forum.",
        "hooks": [
          "20 years as VP/COO at King Trade Capital before founding TradeCap",
          "Triple degree from SMU: BBA Finance, BS Economics, MBA Corporate Finance",
          "Board member of The Finance Forum",
          "Started career underwriting high yield bonds in media and telecom"
        ],
        "li": "https://www.linkedin.com/in/bryanballowe"
      },
      {
        "n": "Clinton Stanton",
        "t": "Co-Founder & Managing Partner",
        "bg": "Co-Founder and Managing Partner of TradeCap Partners LLC, based in Dallas, Texas. Attended Texas A&M University. Co-founded TradeCap Partners alongside Bryan Ballowe to provide purchase order and alternative inventory financing to small and medium-sized businesses. Over 40 years of combined leadership experience (with Ballowe) in the purchase order finance space. Manages client relationships and deal structuring for transactions ranging from $50,000 to $15 million.",
        "hooks": [
          "Texas A&M University graduate",
          "Co-built TradeCap to serve PO finance needs up to $15M",
          "40+ years combined PO finance expertise with co-founder"
        ],
        "li": "https://www.linkedin.com/in/clinton-stanton-a792b644"
      }
    ],
    "desc": "TradeCap Partners LLC is a privately funded firm founded by Bryan Ballowe and Clinton Stanton, headquartered in Dallas, Texas. The company specializes in transaction-based purchase order financing and alternative inventory finance solutions ranging from $50,000 to $15,000,000, serving small and medium-sized businesses in the U.S., Canada, and the U.K. TradeCap's product offerings include finished goods finance, production finance, government contract finance, reseller finance, and project finance — all aimed at supporting businesses in managing pre-sold goods and fulfilling orders. The co-founders bring over 40 years of combined leadership in the PO finance space, with Ballowe having spent 20 years at King Trade Capital before launching TradeCap. The company is BBB accredited in Dallas. TradeCap has extended notable production finance facilities, including a $1.5 million facility to a family-office-backed consumer packaged goods company. Estimated 2-5 employees. Note: TradeCap Partners specializes in purchase order and inventory financing, not traditional MCA.",
    "news": [
      {
        "h": "TradeCap Partners extends $1.5M production finance facility to family office-backed CPG company",
        "s": "Secured Finance Network",
        "d": "2023-08-01"
      },
      {
        "h": "TradeCap Partners forms with focus on short-term transactional financings in PO and inventory space",
        "s": "ABL Advisor",
        "d": "2021-01-01"
      }
    ],
    "location": "Dallas, TX",
    "full_address": "6060 N Central Expy, Ste 500, Dallas, TX 75206",
    "website": "https://www.tradecappartners.com",
    "employees": 4,
    "category": "funder"
  }
]
