[
  {
    "id": 207,
    "name": "Titan Capital Funding",
    "leaders": [
      {
        "n": "Michelle McCarty",
        "t": "CEO, Director & Secretary",
        "bg": "Michelle McCarty serves as CEO, Director, and Secretary of Titan Capital Funding Inc. She is an experienced financial professional with over 30 years of experience in business and accounting, including expertise in payroll, budgeting, cash flow management, account reconciliation, and general ledger operations. She leads the company's equipment financing and working capital lending operations from their Huntington Beach, California headquarters.",
        "hooks": [
          "Over 30 years of experience spanning accounting and finance leadership",
          "Leads a direct lending operation covering both the US and Canada",
          "Company specializes in transportation, waste management, and construction asset financing"
        ],
        "li": "https://linkedin.com/in/michelle-mccarty-34b76168/"
      },
      {
        "n": "Ryan Wilson",
        "t": "Chief Financial Officer",
        "bg": "Ryan Wilson serves as CFO of Titan Capital Funding. Based in Orange County, California, he oversees the financial operations of the company's equipment leasing and financing business. He has built a strong professional network with over 500 LinkedIn connections in the commercial finance space.",
        "hooks": [
          "Serves as CFO managing financial operations for a direct equipment lender",
          "Based in Orange County, California's commercial finance hub"
        ],
        "li": "https://linkedin.com/in/ryan-wilson-41567919b/"
      },
      {
        "n": "Randy Gerritsen",
        "t": "GM, Equipment Finance Sales & Management",
        "bg": "Randy Gerritsen has been General Manager of Equipment Finance Sales and Management at Titan Capital Funding since December 2020. He manages direct sales to manufacturers, dealers, and end-users across multiple industries with emphasis in transportation, waste management, and construction assets. He has deep experience in commercial banking including treasury management, credit analysis, commercial real estate, SBA lending, and equipment leasing. Earlier in his career, he served as an Account Manager making 100-125 daily calls to acquire business relationships.",
        "hooks": [
          "Manages direct sales across transportation, waste management, and construction verticals",
          "Deep background in commercial banking including SBA, CRE, and treasury management",
          "Known for high-volume business development with 100+ daily outreach calls early in career"
        ],
        "li": "https://linkedin.com/in/randy-gerritsen/"
      },
      {
        "n": "Carlos Doepking",
        "t": "Commercial Finance Analyst",
        "bg": "Carlos Doepking serves as Commercial Finance Analyst at Titan Capital Funding, where he supports the company's equipment financing and leasing underwriting operations. His background includes experience related to trucking and advanced technology sectors.",
        "hooks": [
          "Specializes in commercial finance analysis for equipment deals",
          "Background spans trucking and advanced technology sectors"
        ],
        "li": "https://linkedin.com/in/carlos-doepking-9865a769/"
      }
    ],
    "desc": "Titan Capital Funding is a direct lender headquartered in Huntington Beach, California, specializing in equipment financing, leasing, and working capital solutions. The company provides commercial loans, leases, and SBA products for equipment financing needs across multiple industries including transportation, waste management, and construction. They serve businesses nationwide and in Canada, offering funding from $10,000 to $5 million or more. With approximately 17 employees and roughly $1 million in revenue, Titan Capital Funding positions itself as a mid-sized direct equipment lender with a streamlined approval process that can release funds within 24-48 hours. The company evaluates more than just credit scores, also considering time in business, cash flow, and project potential, approving clients even with average credit.",
    "news": [
      {
        "h": "Titan Capital Funding Maintains Active California Corporation Status",
        "s": "California Secretary of State, 2025",
        "d": "Company remains registered and active as a California corporation as of July 2025, operating from their Huntington Beach headquarters."
      }
    ],
    "location": "Huntington Beach, CA",
    "full_address": "20422 Beach Blvd, Suite 300, Huntington Beach, CA 92648",
    "website": "https://titancapitalfunding.com",
    "employees": 17,
    "category": "funder"
  },
  {
    "id": 208,
    "name": "Pinnacle Merchant Funding",
    "leaders": [],
    "desc": "Pinnacle Merchant Funding is a small working capital loans provider based in Freehold, New Jersey, founded in 2019. Described as a father-son business, the company offers small to medium-sized businesses cash advances tailored to their current needs, with typical funding within 24 hours of applying. The company operates as a broker (ISO) connecting businesses with funding sources rather than lending from its own balance sheet. Very limited public information is available about the company's leadership or team. With its small size and broker model, Pinnacle Merchant Funding appears to be a classic ISO operation serving the New Jersey market and surrounding areas.",
    "news": [],
    "location": "Freehold, NJ",
    "full_address": "Freehold, NJ 07728",
    "website": "https://pinnaclemerchantfunding.com",
    "employees": 3,
    "category": "iso"
  },
  {
    "id": 209,
    "name": "Alliance Capital US",
    "leaders": [
      {
        "n": "Daniel Semple",
        "t": "Founder & Managing Member",
        "bg": "Daniel Semple founded Alliance Capital US LLC and serves as Managing Member. He previously served as President of D S Leasing Corp before launching Alliance Capital US. He has built the company into a multi-location operation with offices in Hauppauge and Garden City, New York, focusing on merchant cash advances, invoice factoring, and micro deals for small businesses. He has built a professional network of over 470 LinkedIn connections in the alternative lending industry.",
        "hooks": [
          "Founded Alliance Capital US after running D S Leasing Corp as President",
          "Built the company to three office locations across Long Island and New York City",
          "Pays ISO commissions of 10-14 points same-day on funded deals",
          "Company accepts 1st through 7th position deals including prior defaults"
        ],
        "li": "https://linkedin.com/in/daniel-semple-a4079a39/"
      }
    ],
    "desc": "Alliance Capital US LLC is a direct funder based in New York, founded in 2009 by Daniel Semple. The company provides merchant cash advances, invoice factoring, and micro deals to small business owners. They emphasize a no-broker model, funding directly without third-party intermediaries. Alliance Capital US offers funding between $5K-$200K, accepts deals in 1st through 7th position, considers prior defaults and bankruptcies (if discharged), requires minimum $20K monthly revenue and 6 months in business. They pay ISO commissions of 10-14 points same day of funding. The company has been BBB accredited since January 2023, has 3 office locations, and maintains positive customer reviews on both Trustpilot and the BBB. Despite marketing themselves as 'no broker involved,' they actively work with ISOs through a commission structure, positioning themselves as a direct funder that sources deals through broker partnerships.",
    "news": [
      {
        "h": "Alliance Capital US Maintains BBB Accreditation",
        "s": "Better Business Bureau, 2023-present",
        "d": "Alliance Capital US has maintained BBB accreditation since January 17, 2023, with positive customer reviews highlighting staff professionalism and honest working capital services."
      },
      {
        "h": "Alliance Capital US Promotes ISO Onboarding via FunderIntel",
        "s": "FunderIntel Community, 2024",
        "d": "The company actively recruits ISO partners through the FunderIntel community, offering competitive commission structures and same-day payouts."
      }
    ],
    "location": "Hauppauge, NY",
    "full_address": "1377 Motor Pkwy, Suite LL-5, Hauppauge, NY 11749",
    "website": "https://alliancecapitalus.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 210,
    "name": "Patriot Funding Solutions",
    "leaders": [
      {
        "n": "Mark Pebley",
        "t": "Co-Owner",
        "bg": "Mark Pebley co-founded Patriot Funding Solutions in 2020 alongside Terry Bagsby Jr. He also serves as President of Safe Harbor Financial in Venice, Florida. He attended Colorado State University (1974-1978) and Lake City High School in Lake City, Tennessee. His career has spanned various industries including construction and business services before transitioning into business loan brokering.",
        "hooks": [
          "Co-founded Patriot Funding Solutions during the 2020 COVID-19 pandemic to help struggling small businesses",
          "Also serves as President of Safe Harbor Financial in Venice, Florida",
          "Colorado State University graduate with diverse career background"
        ],
        "li": "https://linkedin.com/in/mark-pebley-4abb0886"
      },
      {
        "n": "Terry Bagsby Jr",
        "t": "Co-Owner",
        "bg": "Terry Bagsby Jr co-founded Patriot Funding Solutions in 2020 with Mark Pebley. He serves as Co-Owner of the company, which was created specifically to help small businesses that were struggling during the COVID-19 pandemic. He manages day-to-day operations from the Burns, Tennessee office and oversees the company's broker relationships with over 75 lender partners.",
        "hooks": [
          "Co-founded the company during COVID-19 to help struggling small businesses",
          "Manages relationships with over 75 lending partners",
          "Based in Burns, Tennessee — a small-town operation serving nationwide clients"
        ],
        "li": ""
      }
    ],
    "desc": "Patriot Funding Solutions is a business loan brokerage (ISO) based in Burns, Tennessee, founded in 2020 by Mark Pebley and Terry Bagsby Jr. The company was created specifically to help small businesses struggling during the COVID-19 pandemic. They operate as a broker with access to over 75 lender partners, offering a wide range of financing products including business loans, SBA loans, asset-based funding, cannabis business loans, equipment loans, payroll loans, revenue-based funding, real estate and hard money loans, and construction financing. They also offer a Real Estate 7x Program providing up to 7x the amount in the borrower's bank account. The company is not BBB accredited but has a BBB profile in Burns, TN. As a broker/ISO with just two co-owners and a small team, they connect borrowers with appropriate lenders rather than funding from their own balance sheet.",
    "news": [],
    "location": "Burns, TN",
    "full_address": "Burns, TN",
    "website": "https://patriotfundingsolutions.com",
    "employees": 3,
    "category": "iso"
  },
  {
    "id": 211,
    "name": "Crown Capital",
    "leaders": [
      {
        "n": "Ekaterina Usovich",
        "t": "CEO",
        "bg": "Ekaterina Usovich serves as CEO of Crown Capital LLC. She holds an MBA and MS in Human Resource Management, and is also a licensed Real Estate Agent. She leads the company's operations providing small business funding solutions including merchant cash advances, term loans, SBA loans, equipment financing, and lines of credit across the US and Canada from their Minnesota headquarters.",
        "hooks": [
          "Holds both an MBA and MS in Human Resource Management",
          "Licensed Real Estate Agent in addition to running a lending operation",
          "Leads a company serving businesses across both the US and Canada"
        ],
        "li": "https://linkedin.com/in/ekaterinausovich/"
      }
    ],
    "desc": "Crown Capital LLC is a business funding company headquartered in Blaine, Minnesota (Minneapolis metro area), founded in 2017. The company was started by an experienced financial professional with a background on Wall Street who initially worked as a loan broker before assembling a team to build Crown Capital. The company offers a wide range of financial products including merchant cash advances, term loans, SBA loans, lines of credit, equipment financing, and working capital solutions. They serve small businesses across the US and Canada, with a team of 11-50 employees. Crown Capital emphasizes fast funding — many clients receive approval in under 30 minutes and access capital within 24-48 hours with minimal paperwork. The company started small with a core team of trusted partners and has grown into a more robust organization in the alternative lending space.",
    "news": [],
    "location": "Blaine, MN",
    "full_address": "716 County Road 10 NE, Blaine, MN 55434",
    "website": "https://crowncapllc.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 212,
    "name": "Keystone Capital Group",
    "leaders": [
      {
        "n": "Lawrence Beigelman",
        "t": "Founder & CEO",
        "bg": "Lawrence Beigelman founded Keystone Capital Group in 2019 after a successful eight-year career in the financial sector. He launched the company with a vision to provide transparent funding solutions for entrepreneurs, emphasizing no hidden fees and no third-party broker charges. Under his leadership, Keystone Capital Group has funded thousands of business owners across the country and maintains one of the lowest default rates in the industry. The company is registered in both Miami and Fort Lauderdale, Florida.",
        "hooks": [
          "Built Keystone Capital Group from scratch in 2019 after 8 years in financial services",
          "Company has a 4-star rating on Trustpilot with 69 customer reviews",
          "Emphasizes zero third-party broker fees — a differentiator in the MCA space",
          "Claims one of the lowest default rates in the alternative lending industry"
        ],
        "li": "https://linkedin.com/in/lawrence-beigelman-70903492"
      }
    ],
    "desc": "Keystone Capital Group Inc. is a direct funder based in Fort Lauderdale, Florida, founded in 2019 by Lawrence Beigelman. The company provides merchant cash advances, MCA consolidations, equipment financing, business loans, small business funding, lines of credit, working capital, and secured products to small and large businesses nationwide. They position themselves on transparency, never allowing third-party brokers to charge high fees and putting all terms in writing. The company has funded thousands of entrepreneurs and claims one of the lowest default rates in the industry by avoiding overburdening clients with penalties and extra fees. Keystone Capital Group has a 4-star rating on Trustpilot with 69 reviews and maintains offices in both Fort Lauderdale and Miami. The company also offered Employee Retention Credit (ERC) programs. With 11-50 employees, they operate as a mid-sized direct funder in the alternative lending space.",
    "news": [
      {
        "h": "Keystone Capital Group Earns Strong Customer Reviews on Trustpilot",
        "s": "Trustpilot, 2024-2025",
        "d": "The company has accumulated 69 customer reviews on Trustpilot earning a 4-star rating, with customers praising team members Paul and Whitney for their professionalism and transparent approach."
      }
    ],
    "location": "Fort Lauderdale, FL",
    "full_address": "2400 E Commercial Blvd, Suite 517, Fort Lauderdale, FL 33308",
    "website": "https://www.keystonecapgrp.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 214,
    "name": "Summit Business Capital",
    "leaders": [],
    "desc": "Summit Business Capital (operating as sbcfinancing.com) is an alternative lending company that was born out of the 2008 financial crisis and officially opened its doors in 2012. The company focuses on alternative hybrid finance, placing less emphasis on a business owner's credit score and more on the overall health of their business. They position themselves as the #1 online provider of small business loans, offering fast and flexible financing that can provide working capital in as little as 48 hours. Their merchant cash advance program provides up to $500,000 with approvals within 24-48 hours. The company operates from Pennsylvania (724 area code) but maintains a low public profile — no founders, owners, or leadership team members are publicly identified on their website or in available directories. This opacity makes it difficult to confirm whether they operate as a direct funder or broker, though their marketing language suggests direct funding capabilities.",
    "news": [],
    "location": "Pennsylvania",
    "full_address": "Pennsylvania (exact address not publicly available)",
    "website": "https://sbcfinancing.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 215,
    "name": "Frontier Business Funding",
    "leaders": [],
    "desc": "Frontier Business Funding (frontierbusinessfunding.com) is a small business funding company that provides customized financial solutions to small businesses across the USA. The company offers term loans, lines of credit, and equipment financing with funds available within 48 hours through a streamlined application process requiring minimal paperwork. They emphasize hand-crafted pre-approvals and dedicated support. However, extremely limited public information is available about this company — no founder, CEO, team members, physical address, or company history can be found through public sources. The website appears to be a relatively generic small business lending site without identifying leadership or corporate details. Given the complete lack of transparency about the organization behind the website, this may be a very small ISO operation or a lead generation site rather than an established direct funder. No BBB profile, Trustpilot reviews, or news coverage exists for this company.",
    "news": [],
    "location": "Unknown",
    "full_address": "Not publicly available",
    "website": "https://www.frontierbusinessfunding.com",
    "employees": 2,
    "category": "iso"
  },
  {
    "id": 216,
    "name": "Golden Eagle Financials",
    "leaders": [],
    "desc": "Golden Eagle Financials (goldeneaglefinancials.com) is a private money lending and business funding company that operates as an ISO/broker connecting borrowers with a network of private money lenders. The company focuses on 1-4 unit non-owner occupied residential properties, working with Certified Funding Advisors who guide clients through the entire funding process from application to closing. They operate an ISO incentive structure where the first deal earns a 25% rebate of the lender fee, with subsequent deals (2-10) increasing the rebate by 2.5% each until capping at deal 10. They claim a rate guarantee and will beat any outside rate offer. Very limited public information is available about the company's leadership, team, physical location, or founding history. No BBB profile, Trustpilot reviews, or news coverage exists for this entity. The company appears to function as a broker/ISO connecting borrowers with private lenders rather than funding directly.",
    "news": [],
    "location": "Unknown",
    "full_address": "Not publicly available",
    "website": "https://goldeneaglefinancials.com",
    "employees": 3,
    "category": "iso"
  },
  {
    "id": 217,
    "name": "Horizon Funding Group",
    "leaders": [
      {
        "n": "James Celifarco",
        "t": "President & Managing Partner",
        "bg": "James Celifarco is the President and Managing Partner of Horizon Funding Group, his flagship company that opened in 2009. He has been in the Small Business Finance Industry for over 18 years and is recognized nationally alongside his brother John for their work in the space. James built Horizon Funding Group into a complete merchant service firm specializing in merchant cash advance programs, credit card processing, and commercial mortgages from their Brooklyn, New York headquarters.",
        "hooks": [
          "Celebrating 18+ years in the Small Business Finance Industry",
          "Runs the company with his brother John — a family-driven business",
          "Built Horizon from a Brooklyn-based startup in 2009 to a recognized national player",
          "Company expanded from MCA into credit card processing and commercial mortgages"
        ],
        "li": "https://linkedin.com/in/james-celifarco-3b573115/"
      },
      {
        "n": "John Celifarco",
        "t": "Managing Partner",
        "bg": "John Celifarco serves as Managing Partner of Horizon Funding Group alongside his brother James. Based in New York, he is recognized nationally for his work in the Small Business Finance Industry. Together with James, he has built Horizon Funding Group into a multi-service financial firm offering merchant cash advances, credit card processing, and commercial mortgages to small businesses that don't qualify for traditional bank loans.",
        "hooks": [
          "Nationally recognized alongside brother James in the small business finance industry",
          "Co-manages a Brooklyn-based operation covering MCA, credit card processing, and commercial mortgages",
          "Company focuses on businesses that don't qualify for traditional bank financing"
        ],
        "li": "https://linkedin.com/in/john-celifarco-a8152717"
      }
    ],
    "desc": "Horizon Funding Group is a Brooklyn-based financial brokerage company founded in 2009 by brothers James and John Celifarco. The company operates as a complete merchant service firm specializing in merchant cash advance programs, credit card processing, and commercial mortgages. They serve as an alternative for small businesses that don't qualify for traditional bank loans, requiring only 1 year of business history (or 6 months with $15,000+ monthly deposits). The company provides funding through a simple, 100% online underwriting process with capital available in as little as 24 hours. With 50-99 employees, Horizon Funding Group has grown significantly from its founding. The related entity Horizon Business Funding LLC operates from 27 William St, New York, NY. The company has faced some BBB complaints including issues around unauthorized ACH withdrawals and misrepresentation of BBB accreditation status. Despite this, the Celifarco brothers are nationally recognized figures in the small business finance industry. The company operates primarily as a broker/ISO connecting small businesses with funding sources.",
    "news": [
      {
        "h": "Horizon Funding Group Faces BBB Complaints Over Business Practices",
        "s": "Better Business Bureau, 2025",
        "d": "BBB complaints include allegations of unauthorized ACH withdrawals after loan cancellation requests and misrepresentation of BBB accreditation status on company emails."
      },
      {
        "h": "Horizon Funding Group Expands to 50-99 Employees",
        "s": "6sense Company Profile, 2024",
        "d": "Company data indicates Horizon Funding Group has grown to between 50-99 employees, reflecting significant expansion since its founding in 2009."
      }
    ],
    "location": "Brooklyn, NY",
    "full_address": "3423 Ave S, Brooklyn, NY 11234",
    "website": "https://horizonfundinggroup.com",
    "employees": 60,
    "category": "iso"
  }
]
