[
  {
    "id": 1004,
    "name": "501 Advance",
    "leaders": [
      {
        "n": "Adam Abraham",
        "t": "Managing Partner",
        "bg": "Managing Partner at 501 Advance LLC, a merchant cash advance company based in New York City. Leads the firm's merchant cash advance operations, providing short-term business financing based on future credit card sales with daily or weekly repayment structures.",
        "hooks": [
          "Leads MCA firm established November 2024 at 29 Broadway in NYC's Financial District",
          "Manages merchant cash advance portfolio with focus on personalized client strategies"
        ],
        "li": "https://www.linkedin.com/in/adam-abraham-049880285"
      }
    ],
    "desc": "501 Advance LLC is a merchant cash advance company established in November 2024 that provides immediate business capital based on future credit card sales. The firm offers short-term financing with daily or weekly repayment structures and takes a personalized approach, strategizing funding solutions based on each client's unique business goals. The company operates from New York City's Financial District.",
    "news": [
      {
        "h": "501 Advance LLC Incorporated in New York",
        "s": "NY Department of State, November 2024",
        "d": "501 Advance LLC was established as a Limited Liability Company in New York on November 19, 2024, with a registered address at 29 Broadway, New York, NY 10006."
      },
      {
        "h": "501 Advance Active in MCA Legal Collections",
        "s": "UniCourt, 2024",
        "d": "Court records show 501 Advance LLC filing collection cases against merchants, indicating active portfolio management and enforcement of merchant cash advance contracts."
      }
    ],
    "location": "New York, NY",
    "full_address": "29 Broadway, New York, NY 10006",
    "website": "https://www.501advance.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1005,
    "name": "60 Day Capital",
    "leaders": [
      {
        "n": "Paul Cook",
        "t": "Funding Specialist",
        "bg": "Funding Specialist at 60 Day Capital, working directly with business owners and ISO brokers to facilitate short-term business funding. Operates within the company's Great Neck, New York headquarters, connecting merchants with fast approval processes and competitive commission structures.",
        "hooks": [
          "Works at one of the higher-commission ISO partner programs in the MCA industry",
          "Specializes in fast-track funding approvals for small business merchants"
        ],
        "li": "https://www.linkedin.com/in/paul-cook-7b0828197/"
      }
    ],
    "desc": "60 Day Capital is a short-term business capital provider headquartered in Great Neck, New York, positioning itself as a leader in funding American businesses. The company operates a robust ISO partner program, paying among the highest commissions in the industry with dedicated relationship managers bridging brokers and in-house underwriters. They offer fast, reliable, and transparent funding solutions for both personal and business financial needs with streamlined approval processes.",
    "news": [
      {
        "h": "60 Day Capital Expands ISO Partner Program",
        "s": "Company Website, 2024",
        "d": "60 Day Capital has been expanding its ISO partner network, offering among the highest commissions in the industry with dedicated relationship managers for each broker partner."
      }
    ],
    "location": "Great Neck, NY",
    "full_address": "Great Neck, New York, United States",
    "website": "https://60daycapital.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1115,
    "name": "Alliance Commercial Capital",
    "leaders": [],
    "desc": "Alliance Commercial Capital is a New York-based commercial lending brokerage offering a comprehensive suite of financing products including commercial real estate loans, SBA loans, factoring, construction loans, hard money loans, equipment loans, equipment leasing, and business lines of credit. The firm works one-on-one with clients to assess business objectives and match them with appropriate financing and lenders, specializing in low and medium-rise new construction in the five boroughs of New York. They also offer a Micro Ticket Leasing Program for transactions ranging from $500 to $2,500 and can assist with long-term, multi-stage financing plans.",
    "news": [
      {
        "h": "Alliance Commercial Capital Offers Diverse Lending Portfolio",
        "s": "Company Website, 2024",
        "d": "Alliance Commercial Capital continues to serve business owners, real estate investors, and fix-and-flip redevelopers with comprehensive commercial financing solutions across New York City."
      }
    ],
    "location": "New York, NY",
    "full_address": "New York, NY, United States",
    "website": "https://alliancecommercialcapital.com",
    "employees": 10,
    "category": "iso"
  },
  {
    "id": 1119,
    "name": "Alternative Solutions Funding",
    "leaders": [],
    "desc": "Alternative Solutions Funding is a merchant cash advance lender that evaluates businesses based on credit card receipts to determine funding amounts and repayment capacity. The company provides contracts outlining advance amounts and interest owed, serving businesses that need quick access to working capital. Their application process is available online with a focus on fast approval and funding for small businesses across various industries.",
    "news": [
      {
        "h": "Alternative Solutions Funding Operates Online MCA Platform",
        "s": "Company Website, 2024",
        "d": "Alternative Solutions Funding continues to operate its online merchant cash advance platform, providing business funding based on credit card receipt analysis and streamlined application processes."
      }
    ],
    "location": "United States",
    "full_address": "United States",
    "website": "https://www.alternativesolutionsfunding.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1122,
    "name": "American Merchant Group",
    "leaders": [
      {
        "n": "Alex McAloon",
        "t": "CEO & Founder",
        "bg": "Founder and CEO of American Capital Group (parent of American Merchant Capital Group), a private lending and technology company founded in 2011. Holds a BS in Marketing & Leadership from Binghamton University School of Management (2001-2005). Previously worked at Gain Capital before launching American Capital Group, which has funded over $750 million to small businesses and served over 10,000 clients.",
        "hooks": [
          "Built American Capital Group from startup to $750M+ in total funded volume since 2011",
          "Leads parent company overseeing subsidiaries including Line of Credit Depot, US Credit Source, Reverse Consolidation, TRBO, and FastWaySBA",
          "Binghamton University Marketing & Leadership graduate who pivoted from Gain Capital to small business lending"
        ],
        "li": "https://www.linkedin.com/in/alex-mcaloon/"
      },
      {
        "n": "Gleb Yukelis",
        "t": "Managing Partner",
        "bg": "Managing Partner at American Merchant Capital Group LLC, working alongside CEO Alex McAloon to manage the company's lending operations and technology solutions. Co-leads the firm's merchant cash advance and small business funding portfolio from the company's Financial District headquarters at 11 Broadway in New York City.",
        "hooks": [
          "Co-leads a lending firm that has funded over $750 million to small businesses",
          "Managing Partner at a company offering approvals up to $1 million with minimal documentation requirements"
        ],
        "li": ""
      }
    ],
    "desc": "American Merchant Capital Group is a private lending and technology company founded in 2011 that provides small businesses access to capital and business technology solutions to other financial services providers. The company has funded over $750 million and served more than 10,000 clients, offering bridge loans, equipment financing, unsecured lines of credit, SBA programs, and merchant cash advances with approvals up to $1 million. The parent entity American Capital Group operates specialized subsidiaries including Line of Credit Depot, US Credit Source, Reverse Consolidation, TRBO, and FastWaySBA.",
    "news": [
      {
        "h": "American Merchant Group Surpasses $750M in Funded Volume",
        "s": "Company Website, 2024",
        "d": "American Merchant Capital Group has funded over $750 million to small businesses since its founding in 2011, serving more than 10,000 clients across the United States."
      },
      {
        "h": "American Merchant Group Maintains Strong BBB Profile",
        "s": "Better Business Bureau, 2025",
        "d": "American Merchant Capital Group LLC continues to maintain its BBB business profile at its 11 Broadway, New York location, offering financing solutions to small businesses."
      }
    ],
    "location": "New York, NY",
    "full_address": "11 Broadway, Suite 334, New York, NY 10004",
    "website": "https://amgmca.com",
    "employees": 30,
    "category": "funder"
  },
  {
    "id": 1123,
    "name": "AmpAdvance",
    "leaders": [
      {
        "n": "John Tejada",
        "t": "Managing Partner",
        "bg": "Managing Partner at AMP Advance, a business lending platform founded in 2015. Has spent years specializing in crafting custom financing solutions for businesses, focusing on finding tailored options to propel businesses to new heights. Leads the company's operations from its Aventura, Florida base while managing lending across all 50 states.",
        "hooks": [
          "Leads AMP Advance which has operated since 2015 offering same-day funding decisions",
          "Manages a multi-product lending platform covering working capital, equipment financing, MCAs, SBA loans, and lines of credit",
          "Based in Aventura, FL with BBB-accredited business operations"
        ],
        "li": ""
      }
    ],
    "desc": "AMP Advance is an online business lending platform founded in 2015 that provides fast, flexible small business loans across the United States. The company offers a wide range of financing products including working capital loans, unsecured business loans, startup financing, merchant cash advances, equipment financing, accounts receivable financing, revenue-based funding, and business lines of credit. AMP Advance provides instant pre-qualification without affecting credit scores, same-day decisions and funding, and works with business owners who have fair or poor credit, focusing on overall business performance and cash flow rather than credit score alone.",
    "news": [
      {
        "h": "AMP Advance Maintains BBB Accreditation",
        "s": "Better Business Bureau, 2025",
        "d": "AMP Advance continues to maintain its BBB business profile in Aventura, Florida, providing financial services to small businesses across the United States."
      },
      {
        "h": "AMP Advance Expands State-by-State Lending Coverage",
        "s": "Company Website, 2024",
        "d": "AMP Advance has expanded its localized lending presence with dedicated landing pages and resources for small business owners in all 50 states."
      }
    ],
    "location": "Aventura, FL",
    "full_address": "97 Newkirk Street, 3rd Floor, Jersey City, NJ 07306",
    "website": "https://ampadvance.com",
    "employees": 20,
    "category": "funder"
  },
  {
    "id": 1132,
    "name": "Banco",
    "leaders": [
      {
        "n": "Manuel Rivero",
        "t": "General Director (CEO)",
        "bg": "General Director of Hey Banco, the Mexican neobank that became an independent bank in January 2026 after splitting from Banregio Grupo Financiero. Previously led the digital banking strategy at BanRegio, where he championed the creation of Hey Banco as the bank's digital arm in 2019. Under his leadership, Hey Banco grew to over 500,000 customers and obtained its own banking license from Mexico's CNBV in July 2023.",
        "hooks": [
          "Led Hey Banco from digital arm of Banregio to fully independent bank with its own banking license in 2026",
          "Built the neobank to 500,000+ customers and $778 million in funding",
          "Positioned Hey Banco as Mexico's only digital bank offering a complete suite of financial products"
        ],
        "li": "https://www.linkedin.com/company/heybanco"
      }
    ],
    "desc": "Hey Banco (commonly referred to as 'Banco') is a Mexican neobank that began as the digital arm of Banregio Grupo Financiero in August 2019 and became a fully independent bank on January 31, 2026. The company offers a complete suite of digital banking products including checking accounts, savings accounts, credit cards, and SME lending, all with entirely digital onboarding and management. Hey Banco has amassed over 500,000 customers, reports assets of 1,589 million pesos, and launched with $778 million in funding. The bank is positioned as Mexico's only digital bank offering products comparable to traditional institutions.",
    "news": [
      {
        "h": "Hey Banco Launches as Independent Digital Bank in Mexico",
        "s": "Multiple Sources, January 2026",
        "d": "Hey Banco began operating as an independent bank on January 31, 2026, leaving behind its status as the digital arm of Banregio to function with its own banking license from Mexico's CNBV."
      },
      {
        "h": "Hey Banco Obtains Banking License from Mexico's CNBV",
        "s": "Fintech Global, July 2023",
        "d": "Hey Banco obtained its own banking license from Mexico's National Banking and Securities Commission (CNBV), clearing the path for its spin-off from Banregio Grupo Financiero."
      },
      {
        "h": "Hey Banco Surpasses 500,000 Customers",
        "s": "Industry Reports, 2025",
        "d": "The neobank exceeded 500,000 customers with assets of 1,589 million pesos, demonstrating strong growth in Mexico's digital banking market."
      }
    ],
    "location": "San Pedro Garza Garcia, NL, Mexico",
    "full_address": "Av. Pedro Ramirez Vazquez No. 200 Int.12 Parque Corporativo Ucaly, San Pedro Garza Garcia, Nuevo Leon 66278, Mexico",
    "website": "https://banco.hey.inc",
    "employees": 200,
    "category": "bank"
  },
  {
    "id": 1133,
    "name": "BCA Capital Partners",
    "leaders": [
      {
        "n": "Adam Geller",
        "t": "Director of Underwriting",
        "bg": "Director of Underwriting at BCA Capital Partners (Business Cash Advance Capital Partners), a woman-owned and operated direct funder based in Nashville, Tennessee. Leads the company's underwriting operations for merchant cash advance and business cash advance products, evaluating business health and potential rather than relying solely on credit history.",
        "hooks": [
          "Leads underwriting at a woman-owned direct funding company founded in 2021",
          "Oversees credit evaluation focused on business health rather than credit score alone"
        ],
        "li": "https://www.linkedin.com/in/adam-geller/"
      }
    ],
    "desc": "BCA Capital Partners (Business Cash Advance Capital Partners) is a woman-owned and operated direct funder founded in 2021, headquartered in Nashville, Tennessee. The company provides merchant cash advances and business cash advances with flexible repayment structures based on sales volume. BCA focuses on transparency, urgency, and exceptional customer service, offering funding without requiring collateral. Their underwriting considers overall business health and potential rather than credit history alone, and approved funds can be deposited within days of application.",
    "news": [
      {
        "h": "BCA Capital Partners Continues Nashville Operations",
        "s": "Yelp, February 2026",
        "d": "BCA Capital Partners maintains active operations at its Nashville, Tennessee location at 100 Oceanside Dr, providing business financing solutions."
      },
      {
        "h": "BCA Capital Partners Expands ISO Partner Network",
        "s": "Company Website, 2024",
        "d": "BCA Capital Partners expanded its partnership opportunities, allowing ISOs and other funders to offer BCA's merchant cash advance solutions to their clients."
      }
    ],
    "location": "Nashville, TN",
    "full_address": "100 Oceanside Dr, Nashville, TN 37204",
    "website": "https://www.bca247.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1134,
    "name": "Bentley Funding",
    "leaders": [],
    "desc": "Bentley Funding is a New York-based commercial lending company specializing in bridge loans, hard money loans, fix-and-flip financing, and construction mortgages for business owners and real estate investors across the U.S. and Canada. The firm leverages connections with various banks, insurance companies, and direct lenders to offer short and long-term loans, lines of credit, working capital, SBA loans, and equipment financing. Bentley Funding focuses on providing creative and custom-fit financing solutions with aggressive loan terms tailored to each deal, investor profile, background, and experience.",
    "news": [
      {
        "h": "Bentley Funding Offers Diverse Commercial Lending Products",
        "s": "Company Website, 2024",
        "d": "Bentley Funding continues to provide a wide range of commercial lending products including bridge loans, hard money, and construction mortgages to business owners and real estate investors."
      }
    ],
    "location": "New York, NY",
    "full_address": "65 St, New York City, NY 10004",
    "website": "https://www.bentleyfunding.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1135,
    "name": "Bespoke Financial",
    "leaders": [
      {
        "n": "George Mancheril",
        "t": "CEO & Co-Founder",
        "bg": "CEO and Co-Founder of Bespoke Financial, the nation's first fintech lender focused on the cannabis industry. Former Goldman Sachs US Interest Rates Trader managing a $2 billion book of risk, followed by roles at Macquarie Group (EM Credit Trading) and Guggenheim Partners (VP, structured credit). NYU Stern School of Business graduate (2008) with majors in Finance and Statistics. Over 14 years of experience in asset-based lending, off-balance sheet financing, and structured credit.",
        "hooks": [
          "Former Goldman Sachs trader who pivoted to build the nation's first cannabis-focused fintech lender",
          "Led Bespoke Financial to close a $125 million credit facility and finance $800M+ in cannabis industry GMV",
          "NYU Stern graduate with 14+ years in structured credit and asset-based lending",
          "Built cannabis lending platform operating across 15 US states"
        ],
        "li": "https://www.linkedin.com/in/george-mancheril-44396a2b/"
      },
      {
        "n": "Jeff Ghitman",
        "t": "Co-Founder, Chairman & CEO",
        "bg": "Co-Founder, Chairman and CEO of Bespoke Financial. Executive advisor and entrepreneur focused on the intersection of finance and operations in consumer product and agriculture supply chains. Since 2015, has served as a trusted advisor to some of the largest supply chains in hemp and cannabis, leading to the founding of Bespoke Financial in 2018.",
        "hooks": [
          "Co-founded the first licensed commercial lender to the US cannabis industry in 2018",
          "Brings deep expertise in consumer product and agriculture supply chain finance",
          "Advisor to the largest supply chains in hemp and cannabis since 2015"
        ],
        "li": "https://www.linkedin.com/in/jeffghitman/"
      },
      {
        "n": "Brittney Lifsey",
        "t": "Executive Vice President of Finance",
        "bg": "EVP of Finance at Bespoke Financial with over 10 years of experience in public and private accounting. Joined Bespoke in December 2019 as VP of Finance, focusing on formalizing internal controls to track loan origination and collection activity while refining the credit underwriting process. CPA-certified professional.",
        "hooks": [
          "CPA who built out financial controls for the nation's first cannabis lending platform",
          "Over a decade of public and private accounting experience applied to cannabis fintech"
        ],
        "li": "https://www.linkedin.com/in/brittney-lifsey/"
      }
    ],
    "desc": "Bespoke Financial, founded in 2018, is the nation's first licensed commercial fintech lender focused on the cannabis industry. Backed by Snoop Dogg's Casa Verde Capital, Sweat Equity Ventures, Greenhouse Capital Partners, and other investors, the company raised $28 million in equity over 4 rounds and closed a $125 million credit facility in December 2021. Bespoke has financed more than $800 million in GMV across the US cannabis industry, operating in 15 states from California to Maine with lines of credit up to $15 million. Products include general lines of credit, inventory financing, purchase money financing, invoice financing, and dispensary financing. The company also partnered with LeafLink and BLAZE to push cannabis payments and B2B buy-now-pay-later services. Note: Crunchbase lists the company status as permanently closed, though this has not been confirmed by other sources.",
    "news": [
      {
        "h": "Bespoke Financial Closes $125 Million Credit Facility",
        "s": "GlobeNewsWire, December 2021",
        "d": "Bespoke Financial announced the closing of a $125 million credit facility from institutional investment funds to expand lending capacity and fund growth in the cannabis industry."
      },
      {
        "h": "Bespoke Financial Raises $8 Million Series A",
        "s": "TechCrunch, April 2021",
        "d": "Cannabis lender Bespoke Financial closed an $8 million Series A round led by Casa Verde Capital and Sweat Equity Ventures to expand operations."
      },
      {
        "h": "Bespoke Financial Partners with BLAZE for Cannabis B2B Buy Now Pay Later",
        "s": "GlobeNewsWire, July 2022",
        "d": "Bespoke Financial and BLAZE Solutions partnered to provide dispensaries with B2B buy-now-pay-later services in California and Massachusetts."
      },
      {
        "h": "Bespoke Financial and PayQwick Launch Fintech Partnership",
        "s": "GlobeNewsWire, April 2022",
        "d": "Bespoke Financial and PayQwick launched a fintech partnership serving cannabis operators and banks, expanding digital payment infrastructure for the industry."
      }
    ],
    "location": "Los Angeles, CA",
    "full_address": "445 S Figueroa St, Los Angeles, CA 90071",
    "website": "https://bespokefinancial.com",
    "employees": 40,
    "category": "funder"
  }
]
