[
  {
    "id": 1359,
    "name": "Positiviti Lending",
    "leaders": [
      {
        "n": "Jan E Hale",
        "t": "Managing Agent, Positiviti Partners",
        "bg": "Managing Agent for Positiviti Partners at Positiviti Lending. Based in Tarpon Springs, FL. Previously served as CEO at Enercel-Vet (2011-2014) and Co-Owner of DSI Marketing Solutions Group. Also held the role of Executive Producer on the East Coast. Oversees the Positiviti microlending platform's partner operations and agent network.",
        "hooks": [
          "Previously CEO at Enercel-Vet biotech venture",
          "Based in Tarpon Springs, FL managing microlending operations",
          "Background spanning executive producing and biotech before fintech"
        ],
        "li": "https://www.linkedin.com/in/drjanhale/"
      },
      {
        "n": "Rudolfo Beltran Jr.",
        "t": "VP of Sales, Marketing & CRM",
        "bg": "Vice President of Sales and Marketing at Positiviti Lending, responsible for marketing outreach, sales strategy, and CRM management. Leads the company's efforts to acquire capital providers and expand the microlending platform's reach to American investors looking for alternative investment opportunities.",
        "hooks": [
          "Heads sales and CRM for microlending platform serving Kenya",
          "VP-level leadership at intersection of fintech and social impact"
        ],
        "li": "https://www.linkedin.com/in/rudolfo-beltran-jr-b0736024/"
      },
      {
        "n": "Dan Smith",
        "t": "Microlending Consultant & Capital Acquisition",
        "bg": "Capital Acquisition Consultant for Positiviti Lending. Helps underbanked entrepreneurs in developing nations access capital through 30-day microloans while providing up to 24% annual returns for capital providers. Runs DSI Marketing Solutions Group and manages CRM operations for the Positiviti platform. Active LinkedIn content publisher on the platform's social impact mission.",
        "hooks": [
          "Runs his own marketing firm DSI Marketing alongside Positiviti work",
          "Publishes LinkedIn content on social impact investing and microlending returns"
        ],
        "li": "https://www.linkedin.com/in/dsimarketing/"
      }
    ],
    "desc": "Positiviti Lending is a peer-to-peer microloan lending platform established in September 2018, headquartered in Clovis, California. The company provides everyday American lenders the opportunity to build wealth (12%-36% APR returns) while supporting the growth of underserved entrepreneurs in developing countries, primarily Kenya. Positiviti facilitates administrative support for the microfinance operations of Open Valley, a local lender in Kenya, connecting individual lenders with entrepreneurs via 30-day microloans ranging from $5 to $500. The platform reports a default rate of less than 1%. Positiviti is a sponsored program within World Workforce International Inc., a 501(c)(5) nonprofit organization's framework. The company is not a bank, is not FDIC insured, and does not guarantee returns. Approximately 11 employees. Note: Positiviti is a microlending platform focused on international lending to Kenya, not a traditional MCA or domestic small business funder.",
    "news": [
      {
        "h": "Positiviti Lending exhibits at MMS Dallas conference to recruit capital providers",
        "s": "MMS Dallas",
        "d": "2024-01-01"
      },
      {
        "h": "Positiviti reports sub-1% default rate on Kenya microloan portfolio",
        "s": "Positiviti Partners",
        "d": "2024-01-01"
      }
    ],
    "location": "Clovis, CA",
    "full_address": "2137 Herndon Ave, Suite 104, Clovis, CA 93611",
    "website": "https://positivitilending.com",
    "employees": 11,
    "category": "funder"
  },
  {
    "id": 1361,
    "name": "Presto Prestamo dba 239Loans.com",
    "leaders": [
      {
        "n": "Steven O. Ruiz",
        "t": "Founder & Owner",
        "bg": "Founder of Presto Prestamo LLC and owner of 239Loans.com in Fort Myers, FL. Spent 30+ years building $100M+ businesses, including serving as President at Coca-Cola. Previously held roles at One Park Financial, Assurance Management Group, and Great Health Works. Founded Presto Prestamo in December 2024. Brings deep understanding of both corporate operations and small business financing needs, with a focus on serving the Hispanic/Latino business community in Southwest Florida and nationwide.",
        "hooks": [
          "*30+ years building $100M+ businesses including President at Coca-Cola",
          "Founded 239Loans to serve Hispanic/Latino business owners in SWFL",
          "Transitioned from corporate leadership at Coca-Cola to small business funding"
        ],
        "li": "https://www.linkedin.com/in/stevenoruiz/"
      }
    ],
    "desc": "Presto Prestamo LLC, doing business as 239Loans.com, is a Latino-owned and Spanish-speaking business funding brokerage based in Fort Myers, Southwest Florida. Founded by Steven O. Ruiz, the company specializes in connecting minority business owners with access to business loans including SBA loans, business lines of credit, working capital, factoring, and equipment leasing. The company offers funding from $5,000 to $5,000,000, with pre-approvals in 24 hours and over 70% approval rates. Applicants never pay upfront fees. The company serves business owners incorporated in the United States, Puerto Rico, and Guam, with 10 years of experience in funding businesses and a vast network of lenders, funders, and finance companies. Based in Fort Myers, 239 Loans caters to local SWFL businesses while extending services nationwide. Estimated 2-5 employees.",
    "news": [
      {
        "h": "Presto Prestamo LLC launches 239Loans.com to serve Hispanic/Latino small business community",
        "s": "239Loans.com",
        "d": "2024-12-01"
      },
      {
        "h": "239Loans expands business capital programs including SBA, lines of credit, and equipment leasing",
        "s": "239Loans.com",
        "d": "2025-01-01"
      }
    ],
    "location": "Fort Myers, FL",
    "full_address": "13550 Reflections Parkway #504, Fort Myers, FL 33907",
    "website": "https://www.239loans.com",
    "employees": 3,
    "category": "iso"
  },
  {
    "id": 1362,
    "name": "Prime Plus Capital",
    "leaders": [
      {
        "n": "John Henry DaSilva",
        "t": "Managing Director",
        "bg": "Managing Director of Prime Plus Capital, headquartered at 111 Town Square Place, Suite 1203, Jersey City, NJ. A sales professional with several years of experience in the business finance sector who has worked under the tutelage of financial industry titans. Leads Prime Plus Capital's strategic partnerships and capital network relationships to serve small business owners seeking growth capital, debt restructuring, and expansion pathways.",
        "hooks": [
          "Leads a boutique capital advisory from Jersey City's Town Square Place",
          "Mentored by financial industry titans in business finance sector"
        ],
        "li": "https://www.linkedin.com/in/johnhenrydasilva"
      }
    ],
    "desc": "Prime Plus Capital is a business finance advisory and funding company headquartered in Jersey City, New Jersey. The company was formed to serve business owners by helping them meet and exceed their goals for growth and individual market share. Prime Plus Capital provides access to an expansive capital network as well as strategic consulting, focusing on raising capital, restructuring debt, and charting pathways to substantial expansion. Products include SBA 504/7a loans, lines of credit, and merchant cash advances. The company operates as a boutique advisory connecting small businesses with appropriate funding solutions from its network of lenders and funders. Approximately 2 employees. Business hours Monday to Friday 9AM-6PM EST, Saturday by appointment.",
    "news": [
      {
        "h": "Prime Plus Capital expands SBA loan and merchant cash advance product offerings",
        "s": "Prime Plus Capital",
        "d": "2024-01-01"
      }
    ],
    "location": "Jersey City, NJ",
    "full_address": "111 Town Square Place, Suite 1203, Jersey City, NJ 07310",
    "website": "https://primepluscapital.com",
    "employees": 2,
    "category": "iso"
  },
  {
    "id": 1364,
    "name": "Probably Funding",
    "leaders": [
      {
        "n": "Donald Hansen",
        "t": "Managing Member & Co-Founder",
        "bg": "Co-Founder and Managing Member of Probably Funding (Probably LLC). Also serves as Co-Founder & CEO of Regents Capital Corporation, a Costa Mesa-based equipment financing company founded in 2013 that has originated over $1.1 billion to more than 2,200 customers nationwide. Under Hansen's leadership, Regents has grown 100% year over year. With three decades of experience in the equipment financing industry, Hansen oversees all aspects of Regents' strategic direction and growth goals. Probably Funding was established in December 2019 as an extension of Regents Capital's operations.",
        "hooks": [
          "*Co-founded Regents Capital which originated over $1.1 billion in equipment financing",
          "Three decades of experience in equipment financing industry",
          "Grew Regents Capital 100% year over year as CEO"
        ],
        "li": "https://www.linkedin.com/in/donhansen"
      },
      {
        "n": "Dennis Odiorne",
        "t": "Managing Member & Co-Founder",
        "bg": "Co-Founder and Managing Member of Probably Funding (Probably LLC). Also Co-Founder & President of Regents Capital Corporation, where he oversees operational strategies and lending operations. Co-founded Regents Capital with Don Hansen in 2013. The duo launched Probably Funding in 2019 as a working capital and equipment financing arm extending Regents Capital's reach into small business working capital loans.",
        "hooks": [
          "Co-founded both Regents Capital and Probably Funding with Don Hansen",
          "President of Regents Capital overseeing operational strategies"
        ],
        "li": "https://www.linkedin.com/in/dennisodiorne"
      },
      {
        "n": "Hemi Shah",
        "t": "Director of Operations",
        "bg": "Director of Operations at Probably Funding, managing day-to-day operational workflows. Previously served as Credit Officer at US Business Funding. Brings lending operations and credit analysis experience to Probably Funding's working capital and equipment financing platform.",
        "hooks": [
          "Previously Credit Officer at US Business Funding",
          "Manages operations for a company born from $1.1B Regents Capital"
        ],
        "li": "https://www.linkedin.com/in/hemi-shah"
      }
    ],
    "desc": "Probably Funding (legally Probably LLC) is an independent business funding company established in December 2019 as an extension of Regents Capital Corporation, headquartered in Costa Mesa, California. The company provides small business working capital loans and equipment financing solutions ranging from $10,000 to $250,000 with competitive rates and simple qualification requirements. Founded by Donald Hansen and Dennis Odiorne — the same duo behind Regents Capital (which has originated over $1.1 billion in equipment financing) — Probably Funding believes in the power of Main Street USA and the positive impact small businesses play on local, regional, and national economies. The company offers flexible funding options with quick access to funds and employs staff working remotely nationwide. Approximately 16 employees. BBB-accredited business based in Costa Mesa, CA.",
    "news": [
      {
        "h": "Probably Funding parent Regents Capital extends and upsizes corporate notes to $30 million",
        "s": "Secured Finance Network",
        "d": "2025-09-01"
      },
      {
        "h": "Regents Capital extends and upsizes bank credit facility to $150 million",
        "s": "Secured Finance Network",
        "d": "2025-11-01"
      },
      {
        "h": "Regents Capital marks a decade of success in equipment finance",
        "s": "National Equipment Finance Association (NEFA)",
        "d": "2024-01-01"
      }
    ],
    "location": "Costa Mesa, CA",
    "full_address": "Costa Mesa, CA",
    "website": "https://probablyfunding.com",
    "employees": 16,
    "category": "funder"
  },
  {
    "id": 1365,
    "name": "ProfitShare Partners",
    "leaders": [
      {
        "n": "Andrew Maren",
        "t": "Co-Founder & CEO",
        "bg": "Serial entrepreneur and ex-banker who founded ProfitShare Partners in 2017 to give access to funding to small businesses excluded from traditional financing channels. Previously served as Group Chairman and Group Managing Director at EmpowerGroup Holdings, overseeing operational strategies and business development initiatives. Earlier career included roles as a Structured Lending Specialist at RMB (Rand Merchant Bank). Based in Johannesburg, South Africa. Advocates for financial inclusivity as a business imperative and has been featured in BizCommunity discussing ProfitShare's model.",
        "hooks": [
          "*Ex-banker at RMB turned fintech founder democratizing SME funding in South Africa",
          "Led EmpowerGroup Holdings as Group Chairman before founding PSP",
          "Featured in BizCommunity discussing financial inclusivity as business imperative"
        ],
        "li": "https://www.linkedin.com/in/andrewmaren"
      },
      {
        "n": "Kagiso Bagwasi",
        "t": "Co-Founder & COO",
        "bg": "Co-Founder and Chief Operating Officer of ProfitShare Partners since 2017. Oversees day-to-day operations of the fintech platform including purchase order funding, contract finance, invoice purchasing, import finance, and production/manufacturing finance. Part of the founding team that developed the unique revenue-sharing model that provides funding to SMEs without taking equity or creating debt.",
        "hooks": [
          "Co-built a revenue-sharing funding model that avoids equity dilution for SMEs",
          "Oversees operations spanning purchase order funding to import finance"
        ],
        "li": "https://www.linkedin.com/in/kagiso-bagwasi"
      },
      {
        "n": "Sisa Ngebulana",
        "t": "Co-Founder",
        "bg": "Co-Founder of ProfitShare Partners. Part of the founding trio alongside Andrew Maren and Kagiso Bagwasi that launched PSP in 2017 to address the funding gap for South African SMEs through an innovative revenue-sharing fintech model.",
        "hooks": [
          "Part of founding trio behind South Africa's revenue-based financing pioneer"
        ],
        "li": ""
      }
    ],
    "desc": "ProfitShare Partners (PSP) is a South African fintech company founded in 2017, headquartered in Johannesburg. The company provides innovative short-term capital solutions for small to medium-sized enterprises (SMEs) that are typically excluded from traditional financing channels. PSP developed a unique financing model based on revenue sharing — providing funding to SMEs in exchange for a share of their future revenue per transaction, allowing businesses to access capital without taking on debt or diluting ownership. Services include purchase order funding, contract finance, invoice purchasing, import finance, and production/manufacturing finance. The company has championed the #GetSAWorking campaign in partnership with Hot 91.9FM, providing a R43 million financial boost to South African SMEs. ProfitShare celebrated 8 years of breaking barriers for South African SMEs in 2025. Approximately 15 employees. Note: ProfitShare Partners is a South African company, not Canadian — the revenue-based financing model operates in the South African market.",
    "news": [
      {
        "h": "ProfitShare Partners celebrates 8 years of breaking barriers for South African SMEs",
        "s": "BizCommunity",
        "d": "2025-01-01"
      },
      {
        "h": "ProfitShare Partners and Hot 91.9FM #GetSAWorking campaign provides R43M financial boost to SMEs",
        "s": "IOL / The Star",
        "d": "2024-01-01"
      },
      {
        "h": "ProfitShare Partners CEO Andrew Maren discusses financial inclusivity as business imperative",
        "s": "BizCommunity",
        "d": "2024-01-01"
      }
    ],
    "location": "Johannesburg, South Africa",
    "full_address": "Investment Place Office Park, Ground Floor - Block C, 10th Road, Hyde Park, Johannesburg, Gauteng 2196, South Africa",
    "website": "https://profitsharepartners.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1366,
    "name": "Promofi",
    "leaders": [
      {
        "n": "Carlos Manuel Alvarez",
        "t": "Founder",
        "bg": "Founder of Promofi Inc, a B2B buy-now-pay-later fintech platform based in Miami, FL. Graduate of Boston College (2021) with concentrations in Operations Management. Built Promofi to address the gap between small businesses and their marketing/trade show expenses by offering flexible BNPL payment solutions. Leverages automation, technology, and AI to bring financial accessibility to the marketing and trade show industries.",
        "hooks": [
          "Boston College graduate who built a B2B BNPL platform for marketing expenses",
          "Targeting the niche intersection of fintech and trade show industry"
        ],
        "li": "https://www.linkedin.com/in/carlos-m-alvarez/"
      }
    ],
    "desc": "Promofi Inc is a Miami, Florida-based fintech company that specializes in providing financial solutions tailored for small businesses, focusing on financing marketing, trade show, and operating expenses. The company operates as a B2B buy-now-pay-later (BNPL) financing platform, offering businesses the ability to run marketing campaigns and attend trade shows with no upfront costs. Promofi partners with marketing agencies and trade show booth exhibit agencies to offer clients a seamless BNPL solution. The platform leverages automation, technology, and AI to bring ease to the financial aspects of running a business, allowing companies to apply, set up accounts, and choose payment options. Promofi aims to redefine the marketing and trade show industries by making investment in business growth straightforward and accessible. Approximately 10 employees.",
    "news": [
      {
        "h": "Promofi launches B2B BNPL platform for marketing and trade show expenses",
        "s": "Promofi / LinkedIn",
        "d": "2023-01-01"
      }
    ],
    "location": "Miami, FL",
    "full_address": "Miami, FL",
    "website": "https://promofi.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1367,
    "name": "Prosper Funding Group",
    "leaders": [],
    "desc": "Prosper Funding Group is a business funding solutions company founded in 2015, based in Reno, Nevada. The company provides individual and small business owners and entrepreneurs access to capital through a network of reputed lenders. Products include merchant cash advances, real estate capital, short-term loans, long-term loans, SBA funds, equipment leasing, lines of credit, invoice factoring, and startup funding. Prosper Funding Group reviews client goals and presents matching programs, typically delivering offers within 24 hours with no fees or obligation to apply. Note: This is NOT the same company as Prosper Marketplace (prosper.com), the peer-to-peer lending platform founded in 2005 in San Francisco. Prosper Funding Group is a separate entity operating as a business loan brokerage out of Reno, NV. Approximately 2-10 employees.",
    "news": [
      {
        "h": "Prosper Funding Group expands product offerings to include real estate financing and startup funding",
        "s": "Prosper Funding Group",
        "d": "2024-01-01"
      }
    ],
    "location": "Reno, NV",
    "full_address": "P.O. Box 5786, Reno, NV 89513",
    "website": "https://prosperfundinggroup.com",
    "employees": 5,
    "category": "iso"
  },
  {
    "id": 1368,
    "name": "Proto Financial",
    "leaders": [
      {
        "n": "Steven Sung",
        "t": "Founder & CEO",
        "bg": "Founder and Chief Executive Officer of Proto Financial Corp, established in 2016 in Westbury, New York. Has over a decade of experience in commercial finance, working with a diverse range of clients from small businesses to Fortune 500 companies. Under his leadership, Proto Financial has helped more than 20,000 businesses worldwide access funding up to $1.5 million through working capital, equipment financing, and merchant cash advances.",
        "hooks": [
          "*Helped 20,000+ businesses worldwide through Proto Financial since 2016",
          "Decade-plus of commercial finance experience spanning SMBs to Fortune 500"
        ],
        "li": ""
      },
      {
        "n": "Andrew Salvoni",
        "t": "Team Lead, Sales & Manager",
        "bg": "Team Lead for Sales and Manager at Proto Financial Corp in the Westbury, NY office. Leads the sales team in originating working capital, equipment financing, and merchant cash advance deals. Works directly with small business owners to match them with appropriate funding solutions.",
        "hooks": [
          "Leads sales operations at a firm that has funded 20,000+ businesses"
        ],
        "li": ""
      },
      {
        "n": "James Giovanakis",
        "t": "Senior Funding Manager",
        "bg": "Senior Funding Manager at Proto Financial Corp. Manages funding operations and client relationships for the company's merchant cash advance and business lending products. Based in the New York area.",
        "hooks": [
          "Senior funding manager at a high-volume MCA and lending operation"
        ],
        "li": ""
      }
    ],
    "desc": "Proto Financial Corp is a financial services company founded in 2016, headquartered in Westbury, New York. The company provides tailored small business loan solutions including working capital, equipment financing, merchant cash advances, term loans, and business lines of credit — with funding available up to $1.5 million. Proto Financial boasts an 85% approval rate for its merchant cash advance program and can approve applications in as little as 4 hours. Since founding, the company has helped more than 20,000 businesses worldwide. The MCA program offers advances based on future revenue without relying on traditional credit scores, offering a fast and flexible alternative to bank loans. Approximately 10-20 employees.",
    "news": [
      {
        "h": "Proto Financial Corp surpasses 20,000 businesses funded worldwide",
        "s": "Proto Financial",
        "d": "2024-01-01"
      },
      {
        "h": "Proto Financial launches expanded equipment financing and business line of credit products",
        "s": "Proto Financial",
        "d": "2024-01-01"
      }
    ],
    "location": "Westbury, NY",
    "full_address": "1025 Old Country Rd, Suite 319, Westbury, NY 11590",
    "website": "https://protofinancial.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1369,
    "name": "Quasar Capital Partners, LLC",
    "leaders": [
      {
        "n": "Brian Center",
        "t": "Founder & CEO",
        "bg": "Finance industry veteran with over three decades of experience providing clients with trusted expertise. Founded Quasar Capital Partners in 2020 in Cedar Park, Texas. Previously served as President and Chief Credit Officer for Far West Capital. Earlier, co-owned and served as president of Comresco Capital LLC, a factoring company founded in 2002 and sold to Bibby Financial in 2007. Received his Bachelor of Business Administration in Economics from Texas Tech University. Built Quasar Capital with a commitment to transparency, integrity, and flexibility in factoring services.",
        "hooks": [
          "*Previously sold factoring company Comresco Capital to Bibby Financial in 2007",
          "Texas Tech BBA in Economics, three decades in commercial finance",
          "Former President & Chief Credit Officer at Far West Capital"
        ],
        "li": "https://www.linkedin.com/in/briancenter"
      },
      {
        "n": "John Center",
        "t": "President",
        "bg": "President of Quasar Capital Partners, announced via PR Newswire in 2021. Works alongside founder Brian Center to lead the company's strategic direction and growth in invoice factoring and asset-based lending for small businesses across the US and Canada.",
        "hooks": [
          "Named President of Quasar Capital via formal PR Newswire announcement",
          "Leads strategic growth for factoring facilities up to $20M"
        ],
        "li": ""
      },
      {
        "n": "Karol Guerrero",
        "t": "Chief Financial Officer & Controller",
        "bg": "Seasoned factoring finance executive with approximately 30 years of expertise in the factoring industry, including operations, underwriting, management, and accounting. Joined Quasar Capital Partners' leadership team as CFO and Controller. Brings a superior track record of delivering results and creating value across factoring finance operations.",
        "hooks": [
          "30 years of factoring industry expertise spanning operations to accounting",
          "Named CFO in ABL Advisor announcement highlighting her track record"
        ],
        "li": "https://www.linkedin.com/in/karol-guerrero-79367a43/"
      },
      {
        "n": "Tanya Fontenot",
        "t": "Vice President, Business Development",
        "bg": "Vice President of Business Development at Quasar Capital Partners, responsible for growing the company's client base and broker relationships across the US and Canada. Drives new business origination for Quasar's invoice factoring and asset-based lending solutions.",
        "hooks": [
          "Leads business development for a factoring firm with $20M facility sizes"
        ],
        "li": ""
      }
    ],
    "desc": "Quasar Capital Partners LLC is a commercial finance company founded in 2020 by finance industry veteran Brian Center, headquartered in Cedar Park, Texas. The company specializes in providing invoice factoring, asset-based lending, and cash flow solutions designed to accelerate small business success across the United States and Canada. Quasar offers customized factoring services with facility sizes up to $20 million, distinguished by a commitment to transparency, integrity, and flexibility. Additional financing products include cash advances and small term loans. The leadership team brings combined decades of factoring and commercial lending experience, including Brian Center's prior roles at Far West Capital and Comresco Capital (sold to Bibby Financial in 2007). The company's leadership includes John Center as President, Karol Guerrero as CFO, and a team of relationship managers, underwriters, and business development officers. Approximately 10-15 employees.",
    "news": [
      {
        "h": "Quasar Capital Partners names Karol Guerrero as CFO and Controller",
        "s": "ABL Advisor",
        "d": "2024-01-01"
      },
      {
        "h": "Quasar Capital Partners announces John Center as President",
        "s": "PR Newswire",
        "d": "2021-07-01"
      },
      {
        "h": "Finance industry veteran Brian Center launches Quasar Capital Partners with focus on small business factoring",
        "s": "PR Newswire / Quasar Capital",
        "d": "2020-01-01"
      }
    ],
    "location": "Cedar Park, TX",
    "full_address": "1210 Cottonwood Creek Trail, Cedar Park, TX 78613",
    "website": "https://www.quasarcapitalpartners.com",
    "employees": 12,
    "category": "funder"
  },
  {
    "id": 1370,
    "name": "Quick Fix Capital",
    "leaders": [
      {
        "n": "Dennis Williams",
        "t": "Principal",
        "bg": "Principal at Quick Fix Capital, a revenue-based financing provider founded in 2015 as a sister portfolio to Lendini. Education from the University of Dayton. Based in the Trenton, NJ area. Oversees Quick Fix Capital's operations providing revenue-based financing to small businesses through the Funding Metrics LLC entity.",
        "hooks": [
          "University of Dayton graduate running a revenue-based financing operation",
          "Built Quick Fix Capital as sister portfolio to Lendini since 2015"
        ],
        "li": "https://www.linkedin.com/in/dennis-williams-6171308/"
      }
    ],
    "desc": "Quick Fix Capital (legally Funding Metrics LLC dba Quick Fix Capital) is a revenue-based financing provider founded in 2015, headquartered in Bensalem, Pennsylvania. The company was created when its sister portfolio Lendini (established in 2014) identified a growing need in the market for revenue-based financing tailored to specific business needs. Quick Fix Capital provides businesses with capital based on the estimated projection of future receipts, offering a flexible financing model where repayment adjusts with business revenue. The company positions itself as a fast-moving funder and operates through partner channels via Lendini's ISO network. Quick Fix Capital emphasizes speed of funding and works with businesses that may not qualify for traditional bank financing. Approximately 11-50 employees.",
    "news": [
      {
        "h": "Quick Fix Capital expands revenue-based financing offerings through Lendini partner network",
        "s": "Quick Fix Capital",
        "d": "2024-01-01"
      },
      {
        "h": "Funding Metrics LLC (Quick Fix Capital parent) grows ISO partner program",
        "s": "Funding Metrics",
        "d": "2024-01-01"
      }
    ],
    "location": "Bensalem, PA",
    "full_address": "3220 Tillman Drive, Suite 200, Bensalem, PA 19020",
    "website": "https://quickfixcapital.com",
    "employees": 25,
    "category": "funder"
  }
]
