[
  {
    "id": 183,
    "name": "2M7 Financial Solutions",
    "leaders": [
      {
        "n": "Avrohom (Avi) Bernstein",
        "t": "CEO & Founder",
        "bg": "Founded 2M7 Financial Solutions in 2008 to address the financing gap for Canadian small and medium-sized businesses. Under his leadership, 2M7 has funded over $100 million across 5,000+ customers, achieving a 97% approval rate. Based in the Greater Toronto Area, Bernstein has been a vocal advocate for alternative lending in Canada, describing the market as having significant untapped potential.",
        "hooks": [
          "Built 2M7 from scratch in 2008 to over $100M funded and 5,000+ customers across Canada",
          "Receives 200-300 MCA applications per month, achieving a 97% approval rate",
          "Featured in deBanked discussing the state of alternative funding in Canada",
          "Expanding team in 2024-2025 with new hires in finance, analytics, and systems management"
        ],
        "li": "https://www.linkedin.com/in/avrohom-bernstein-28506592/"
      }
    ],
    "desc": "2M7 Financial Solutions is a Canadian alternative lending company founded in 2008, specializing in merchant cash advances for small and medium-sized businesses. Headquartered in Toronto, Ontario, 2M7 provides fast working capital without traditional bank requirements, offering 24-hour approval and no hidden fees. The company has funded over $100 million and served more than 5,000 customers with a 97% approval rate. 2M7 operates across all Canadian provinces except Quebec, requiring a minimum of $15,000 in monthly revenue and 3 months of business operation. The company continues to expand, recently hiring across controller, financial analyst, and systems management roles.",
    "news": [
      {"h": "2M7 Financial Solutions Featured on Alternative Funding in Canada", "s": "deBanked, July 2019", "d": "CEO Avi Bernstein discussed the growth of alternative funding in Canada, describing the MCA market as 'low hanging fruit' with high demand from SMBs seeking faster approval than traditional banks."},
      {"h": "2M7 Financial Solutions Expands Team with Key Hires", "s": "LinkedIn, 2024-2025", "d": "Company added Matthew Zaffino as Controller (May 2025), Ronen Tsyrlin as Financial Analyst (Dec 2024), and Nikita Khinkis as Manager of Systems & Submissions (Oct 2024), signaling continued growth."},
      {"h": "2M7 Named Top Canadian MCA Provider", "s": "Finder Canada, 2024", "d": "Listed among leading Canadian merchant cash advance providers with same-day funding capabilities and a transparent fee structure."}
    ],
    "location": "Toronto, ON, Canada",
    "full_address": "3605 Weston Rd, Toronto, ON M9L 1V7, Canada",
    "website": "https://www.2m7.ca",
    "employees": 13,
    "category": "funder"
  },
  {
    "id": 184,
    "name": "SharpShooter Funding",
    "leaders": [
      {
        "n": "Paul Pitcher",
        "t": "Managing Partner & Founder",
        "bg": "Studied International Marketing and Finance at the University of Tampa, where he also played golf at a collegiate level. Started in financial sales under the mentorship of John Horrigan at Wynn Point Financial. Worked in sports marketing sales for the Washington Wizards and Capitals before founding First Down Funding in Annapolis, Maryland in 2012. Launched SharpShooter Funding in 2015 as the Canadian arm, partnering with pro wrestling legend Bret 'The Hitman' Hart as company commissioner. Moved to Toronto in 2017 to grow the Canadian market.",
        "hooks": [
          "Partnered with pro wrestling legend Bret 'The Hitman' Hart, who serves as SharpShooter's commissioner — company name inspired by Hart's signature finishing move",
          "Also runs First Down Funding in the US, founded in 2012, making him experienced in both US and Canadian alternative lending markets",
          "Started career in sports marketing with the Washington Wizards and Capitals before pivoting to fintech",
          "SharpShooter has an A+ BBB rating and is a member of the Canadian Lenders Association"
        ],
        "li": "https://www.linkedin.com/in/paulpitcher/"
      }
    ],
    "desc": "SharpShooter Funding is a Canadian small business financing company founded in 2015, serving as the Canadian arm of First Down Funding. Based in Toronto, SharpShooter provides alternative business loans and merchant cash advances to SMBs across all Canadian provinces and territories. The company offers funding up to $250,000 with interest rates ranging from 5.49% to 22.79% and terms of 1-5 years. SharpShooter maintains an A+ BBB rating with zero complaints over the past three years and is a member of the Canadian Lenders Association. The company's brand was inspired by WWE legend Bret Hart's finishing move, and Hart himself serves as company commissioner.",
    "news": [
      {"h": "SharpShooter Funding Joins the Canadian Lenders Association", "s": "Canadian Lenders Association, 2019", "d": "SharpShooter became a member of the CLA, solidifying its position in the Canadian alternative lending ecosystem alongside other established lenders."},
      {"h": "Paul Pitcher Featured on Alternative Lending in Canada", "s": "deBanked, June 2019", "d": "Pitcher discussed his journey from US sports marketing to Canadian alternative lending, detailing how he built SharpShooter to serve underbanked Canadian SMBs."},
      {"h": "SharpShooter Funding Maintains A+ BBB Rating", "s": "BBB, 2024", "d": "Company sustained its top rating from the Better Business Bureau with zero complaints filed over the past three years, demonstrating strong customer satisfaction."}
    ],
    "location": "Toronto, ON, Canada",
    "full_address": "801 Eglinton Ave West, Suite 400, Toronto, ON M5N 1E3, Canada",
    "website": "https://sharpshooterfunding.ca",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 187,
    "name": "LoanBuilder (PayPal)",
    "leaders": [
      {
        "n": "Michelle Gill",
        "t": "EVP & GM, Small Business & Financial Services",
        "bg": "Leads PayPal's merchant lending solutions including PayPal Business Loan and PayPal Working Capital. Previously SVP of QuickBooks Money Platform at Intuit. Before that, served as CFO and EVP of Consumer Lending and Capital Markets at SoFi, where she streamlined multiple lending businesses and re-architected the balance sheet strategy. Earlier spent 14 years at Goldman Sachs, rising to Partner co-leading the Structured Finance business. Also worked at Sixth Street Partners.",
        "hooks": [
          "Oversees PayPal's $30B+ lending operation that has served 420,000+ business accounts since 2013",
          "Achieved Net Promoter Scores of 76 and 85 for PayPal Business Loan and Working Capital respectively, with 90%+ repeat usage",
          "Career spans Goldman Sachs (14 years, Partner), SoFi (CFO then EVP), Intuit, and now PayPal",
          "Leading PayPal's push to establish PayPal Bank, a proposed Utah-chartered industrial loan company for SMB lending"
        ],
        "li": "https://www.linkedin.com/in/gillmichelle"
      },
      {
        "n": "Alex Chriss",
        "t": "Former President & CEO (departed Feb 2026)",
        "bg": "Served as PayPal CEO from September 2023 to February 2026. Previously led Intuit's Small Business and Self-Employed Group. Under his leadership, PayPal surpassed $30B in global SMB loan originations and submitted applications to establish PayPal Bank. Replaced by former HP CEO Enrique Lores effective March 2026.",
        "hooks": [
          "Under his watch, PayPal crossed $30B in SMB loan originations and filed for a Utah industrial bank charter",
          "Stated during Q4 earnings that securing capital remains 'a significant hurdle for small businesses striving to grow and scale'",
          "Departed PayPal in February 2026, replaced by former HP CEO Enrique Lores"
        ],
        "li": "https://www.linkedin.com/in/alexchriss/"
      }
    ],
    "desc": "LoanBuilder is PayPal's SMB lending arm, now branded as PayPal Business Loan and PayPal Working Capital. PayPal entered small business lending in 2013 with Working Capital (repaid as a percentage of PayPal sales) and expanded in 2017 with PayPal Business Loan (fixed-repayment term loans available to non-PayPal merchants). The platform was bolstered by PayPal's $183M acquisition of Swift Financial (which operated the LoanBuilder brand) in 2017. As of March 2025, PayPal has surpassed $30 billion in global loan originations, extending more than 1.4 million loans and cash advances to over 420,000 business accounts worldwide. Both products achieve exceptional Net Promoter Scores (76 and 85) with over 90% customer renewal rates. PayPal filed applications in December 2025 to establish PayPal Bank, a Utah-chartered industrial loan company, to deepen its SMB lending capabilities.",
    "news": [
      {"h": "PayPal Surpasses $30B in Global Small Business Lending", "s": "PayPal Newsroom / PYMNTS, March 2025", "d": "PayPal announced it has originated over $30 billion in loans and cash advances to more than 420,000 business accounts globally since launching its first lending solution in 2013."},
      {"h": "PayPal Submits Applications to Establish Industrial Bank", "s": "PayPal Newsroom, December 2025", "d": "PayPal filed with the Utah Department of Financial Institutions and FDIC to establish PayPal Bank, aimed at expanding financial services access for US small businesses."},
      {"h": "PayPal Replaces CEO Alex Chriss with HP's Enrique Lores", "s": "Fortune / American Banker, February 2026", "d": "PayPal replaced CEO Alex Chriss with former HP CEO Enrique Lores following challenges in improving branded e-commerce checkout performance."},
      {"h": "PayPal: Our Merchants Grow After Taking a Business Loan", "s": "deBanked, February 2025", "d": "PayPal highlighted data showing that merchants who take PayPal business loans experience meaningful business growth, reinforcing the value proposition of its lending products."}
    ],
    "location": "San Jose, CA",
    "full_address": "2211 North First Street, San Jose, CA 95131",
    "website": "https://www.paypal.com/us/business/financial-services/working-capital-loan",
    "employees": 25000,
    "category": "funder"
  },
  {
    "id": 188,
    "name": "EZ Business Funding",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO / Owner",
        "bg": "EZ Business Funding, also known as Merchant Capital Funding LLC (MCF, LLC), was established in 2008 as a private company providing merchant cash advances and small business loans from its Manhattan office. The company maintains a low public profile with limited executive visibility.",
        "hooks": [
          "Operating since 2008 from 75 Maiden Lane in Manhattan's Financial District",
          "Provides working capital advances ranging from $5,000 to $5,000,000",
          "Also operates under the name Merchant Capital Funding LLC (MCF, LLC)"
        ],
        "li": ""
      }
    ],
    "desc": "EZ Business Funding is a private small business lending company established in 2008, headquartered in Manhattan's Financial District. Also known as Merchant Capital Funding LLC (MCF, LLC), the company provides merchant cash advances and business funding ranging from $5,000 to $5,000,000. EZ Business Funding offers a streamlined application process with funding available in as little as 24 hours. The company is a small operation with approximately 6-10 employees and annual revenue in the $1M-$5M range. It maintains a relatively low public profile in the alternative lending space.",
    "news": [
      {"h": "EZ Business Funding Listed on deBanked UCC Filing Directory", "s": "deBanked, ongoing", "d": "EZ Business Funding appears in the deBanked UCC filing database, confirming active merchant cash advance origination activity."},
      {"h": "EZ Business Funding Maintains Manhattan Operations", "s": "Business Directories, 2024", "d": "Company continues to operate from 75 Maiden Lane in Manhattan, providing MCA funding to small businesses nationwide."}
    ],
    "location": "New York, NY",
    "full_address": "75 Maiden Lane, Floor 10, New York, NY 10038",
    "website": "https://ezfund.us",
    "employees": 8,
    "category": "funder"
  },
  {
    "id": 189,
    "name": "ProMerchant",
    "leaders": [
      {
        "n": "Brett Husak",
        "t": "Co-Chief Executive Officer & Founder",
        "bg": "Seasoned payment processing entrepreneur with over a decade of experience in banking and fintech. Founded and sold multiple payment companies including Flow Payments, Deft Payment Systems, and Cape Cod Merchant Services. Co-founded 33 Operations and Payblox Technologies. After ProMerchant's closure in 2024, founded GetPayBlox. Earned a Certificate of Specialization in Entrepreneurship and Innovation from Harvard Business School Online (2023-2024).",
        "hooks": [
          "Founded and sold multiple payment companies (Flow Payments, Deft Payment Systems, Cape Cod Merchant Services) all acquired by Waitr in 2021",
          "After ProMerchant closed in April 2024, launched GetPayBlox — a new payment processing venture",
          "Harvard Business School Online certificate in Entrepreneurship and Innovation (2023-2024)",
          "Career spans founding, scaling, and exiting payment processing companies — serial entrepreneur in fintech"
        ],
        "li": "https://www.linkedin.com/in/bretthusak/"
      }
    ],
    "desc": "ProMerchant was a Boston-based payment processing company founded in 2018 that provided credit card processing solutions to small and mid-sized merchants in retail and e-commerce. The company was acquired in August 2021 by Waitr, Inc. (a food delivery platform later rebranded as ASAP Inc.) alongside Flow Payments and Cape Cod Merchant Services. ProMerchant CLOSED on April 1, 2024. The company had offered innovative payment models including flat-rate and interchange-plus pricing. Some reports from late 2025 suggest the company may have resumed operations independently after restructuring, but its status remains unclear. Co-CEO Brett Husak subsequently founded GetPayBlox, a new payment processing venture.",
    "news": [
      {"h": "ProMerchant Closes Operations", "s": "Industry Reports, April 2024", "d": "ProMerchant shut down operations on April 1, 2024, after its parent company ASAP Inc. (formerly Waitr) went through financial difficulties and restructuring."},
      {"h": "Waitr Closes ProMerchant, Flow Payments and Cape Cod Merchant Services Acquisitions", "s": "BusinessWire, August 2021", "d": "Food delivery company Waitr completed acquisitions of three payment processing companies — ProMerchant, Flow Payments, and Cape Cod Merchant Services — to diversify into merchant services."},
      {"h": "Brett Husak Launches GetPayBlox After ProMerchant Closure", "s": "LinkedIn, April 2023", "d": "Former ProMerchant Co-CEO Brett Husak founded GetPayBlox, a new payment processing platform, continuing his serial entrepreneurship in the payments space."}
    ],
    "location": "Boston, MA",
    "full_address": "501 Boylston Street, Floor 10, Boston, MA 02116",
    "website": "https://www.promerchant.com",
    "employees": 50,
    "category": "technology"
  },
  {
    "id": 190,
    "name": "Fundshop",
    "leaders": [
      {
        "n": "Brandon Sciortino",
        "t": "Founder & CEO",
        "bg": "Founded Fundshop in 2017 after gaining experience in the alternative lending industry as VP of Sales at First Premier Funding and in roles at Imperial Advance. Recognized as one of the most knowledgeable and skilled individuals in the fintech industry with deep understanding of alternative lending. Attended Suffolk County Community College. Based in the New York City metropolitan area with expertise in credit, finance, banking, and financial analysis.",
        "hooks": [
          "Founded Fundshop in 2017 after building sales experience at First Premier Funding and Imperial Advance",
          "Built Fundshop to 14 employees across 3 continents (North America, Europe, Africa)",
          "Recognized by peers as 'one of the most knowledgeable and skilled individuals in the Fintech industry' with deep alternative lending expertise",
          "Operates from Hauppauge, Long Island — offering funding up to $1M+ with 24-hour turnaround"
        ],
        "li": "https://www.linkedin.com/in/brandon-sciortino-623380101/"
      }
    ],
    "desc": "Fundshop is a small business finance broker and marketplace founded in 2017, headquartered in Hauppauge, New York. The company provides hassle-free access to small business loans including merchant cash advances, commercial business loans, and equipment financing, with funding up to $1M+ and flexible low rates. Fundshop emphasizes fast funding within 24 hours with no collateral required in most cases. The company operates with approximately 14 employees across three continents (North America, Europe, and Africa), connecting small businesses with appropriate funding packages tailored to their needs.",
    "news": [
      {"h": "Fundshop Featured on Inc.com Company Profile", "s": "Inc.com, 2024", "d": "Fundshop listed on Inc.com's company directory as a growing fintech company providing small business loan solutions."},
      {"h": "Fundshop Expands Global Operations", "s": "Company Reports, 2024", "d": "Fundshop expanded its team across three continents, with employees in North America, Europe, and Africa supporting its small business lending marketplace."}
    ],
    "location": "Hauppauge, NY",
    "full_address": "150 Motor Parkway, Suite LL70, Hauppauge, NY 11788",
    "website": "https://www.gofundshop.com",
    "employees": 14,
    "category": "iso"
  },
  {
    "id": 191,
    "name": "FLG Partners",
    "leaders": [
      {
        "n": "Laureen DeBuono",
        "t": "Former Managing Partner (2020-2025), Active Partner",
        "bg": "Highly seasoned CEO, COO, CFO, and Board Member with 30+ years of executive experience. Joined FLG Partners in 2011, served on the firm's Management Committee from 2014 to 2017, and was elected Managing Partner in 2020, leading transformational growth of the firm through early 2025. Continues as an active Partner focused on CEO and Board Advisory work and executive coaching. Based in the San Francisco Bay Area.",
        "hooks": [
          "Led FLG Partners as Managing Partner through transformational growth from 2020 to 2025",
          "30+ years of executive experience across CEO, COO, CFO, and Board Member roles",
          "Now focused on CEO/Board Advisory work and executive coaching — shifting from firm management to client-facing leadership",
          "FLG has assisted in raising over $6 billion in growth financing, IPO, and M&A transactions since 2021"
        ],
        "li": "https://www.linkedin.com/in/ldebuono/"
      },
      {
        "n": "Doug Lehrmann",
        "t": "Founding Partner",
        "bg": "Co-founded FLG Partners in 2004 with over 35 years of financial management experience at public and private companies. BA in History from Saint Mary's College of California (1969), MBA in Finance from UC Berkeley Haas School of Business (1971). Has served as CFO nurturing five startups, raising over $100 million in VC and bank credit, and filing S-1s for two IPOs. Career spans semiconductor, technology, solar, and consumer product companies.",
        "hooks": [
          "Co-founded FLG Partners in 2004 — the firm has now served over 600 clients from early stage to Fortune 500",
          "MBA from UC Berkeley Haas School of Business, career spanning 35+ years as a hands-on CFO",
          "Nurtured 5 startups as CFO, raising over $100M in venture capital and filing 2 IPO S-1s",
          "Also founded Buell Wetsuits & Surf as COO/CFO — an entrepreneur outside finance as well"
        ],
        "li": "https://www.linkedin.com/in/doug-lehrmann-2886495/"
      }
    ],
    "desc": "FLG Partners is a premier CFO consulting and Board advisory firm founded in 2004 and headquartered in Palo Alto, California. The firm provides interim, fractional, and full-time CFO leadership to public and private companies, startups, and nonprofits needing experienced C-suite financial talent. FLG Partners is NOT a lender or direct participant in the small business lending ecosystem — it is a professional services firm that provides CFO advisory services to companies across industries, including technology, life sciences, and consumer products. The firm's 25+ partners each average over 25 years of CFO experience. FLG has served over 600 clients and assisted in raising over $6 billion in growth financing, IPO, and M&A transactions since January 2021. Note: This company may be misclassified in a lending/funding database as it is a CFO advisory firm, not a lender.",
    "news": [
      {"h": "FLG Partners Elects Laureen DeBuono as Managing Partner", "s": "GlobeNewsWire, April 2020", "d": "FLG Partners elected Laureen DeBuono as Managing Partner, leading the firm's next phase of growth across the US and globally."},
      {"h": "FLG Partners Surpasses $6B in Client Financing Transactions", "s": "FLG Partners, 2024", "d": "Since January 2021, FLG has assisted in raising over $6 billion in growth financing, IPO, and M&A transactions for its portfolio of clients."},
      {"h": "FLG Partners Continues Expansion of CFO Partnership", "s": "FLG Partners, 2025", "d": "The firm continues recruiting experienced CFOs as partners, expanding its roster of C-suite advisors serving companies from early-stage to Fortune 500."}
    ],
    "location": "Palo Alto, CA",
    "full_address": "228 Hamilton Avenue, 3rd Floor, Palo Alto, CA 94301",
    "website": "https://flgpartners.com",
    "employees": 40,
    "category": "service_provider"
  },
  {
    "id": 192,
    "name": "Balanced Business Funding",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO / Founder",
        "bg": "Balanced Business Funding has an extremely limited online presence, with no discoverable information about its leadership team, executives, or founding history through public web searches. The company may operate under a different name, have ceased operations, or maintain a very low profile in the business funding industry.",
        "hooks": [
          "Company has minimal public web presence — may operate under a different name or brand",
          "Listed in industry databases as a business funder but lacks discoverable leadership information"
        ],
        "li": ""
      }
    ],
    "desc": "Balanced Business Funding is listed as a business funder, but the company has an extremely limited online presence. Extensive web searches across LinkedIn, deBanked, FunderIntel, and general search engines returned no website, executive information, address, or company details. The company may operate under a different trade name, may have ceased operations, or maintains an unusually low public profile. Without verifiable information, its current operating status, product offerings, and market position cannot be confirmed.",
    "news": [],
    "location": "Unknown",
    "full_address": "Unknown",
    "website": "",
    "employees": 0,
    "category": "funder"
  },
  {
    "id": 194,
    "name": "Advance Funds Network",
    "leaders": [
      {
        "n": "Irving Betesh",
        "t": "Chief Revenue Officer",
        "bg": "Joined Advance Funds Network in 2016 while still in his third year of college, ultimately dropping out to fully commit to AFN. Now manages a diverse team of 60 individuals and works with business owners generating over $75,000 per month seeking financing, as well as B2B professionals with clients needing business funding. Has grown with the company for nearly a decade.",
        "hooks": [
          "Dropped out of college in his third year to fully commit to Advance Funds Network — has been with the company since 2016",
          "Manages a team of 60 people across sales and business development at AFN",
          "Focuses on business owners making $75K+/month and B2B professionals needing financing for their clients",
          "AFN generates $14M in annual revenue and has a 97% 5-star rating on Trustpilot"
        ],
        "li": "https://www.linkedin.com/in/irving-betesh-38820198/"
      },
      {
        "n": "Douglas Haddad",
        "t": "Chief Experience Officer",
        "bg": "Serves as Chief Experience Officer at Advance Funds Network, overseeing the customer experience and operational delivery of business financing solutions. Also holds the title of Chief Vertical Officer, focusing on specialized industry verticals within AFN's lending portfolio.",
        "hooks": [
          "Dual role as Chief Experience Officer and Chief Vertical Officer at AFN",
          "Responsible for the customer journey that contributes to AFN's 97% 5-star Trustpilot rating",
          "AFN has been serving businesses since 2007-2008, providing up to $5M in financing"
        ],
        "li": "https://www.linkedin.com/in/douglas-h-5516b110"
      }
    ],
    "desc": "Advance Funds Network (AFN) is a business financing company founded in 2007-2008, headquartered in Brooklyn, New York. Despite being initially described as a UK-based MCA provider, AFN actually operates across the USA and Canada, providing flexible funding solutions to small and medium-sized businesses. Services include business term loans, working capital loans, lines of credit, merchant cash advances, consolidation loans, and equipment financing, with amounts up to $5 million. The company generates approximately $14 million in annual revenue and employs about 57 people. AFN maintains an outstanding reputation on Trustpilot with 97% of customers giving 5-star ratings. Businesses need at least $25,000 in average monthly revenue to qualify.",
    "news": [
      {"h": "Advance Funds Network Maintains Top Trustpilot Ratings", "s": "Trustpilot / ConsumerAffairs, 2025", "d": "AFN continues to earn exceptional customer reviews, with 97% of Trustpilot reviewers giving 5-star ratings for its business financing services."},
      {"h": "AFN Offers Same-Day Funding Solutions", "s": "AdvanceFundsNetwork.com, 2024", "d": "The company emphasizes its same-day funding capability, providing businesses with rapid access to capital through a streamlined application process."},
      {"h": "Advance Funds Network Expands Financing Products", "s": "Company Website, 2024", "d": "AFN expanded its product lineup beyond traditional MCAs to include term loans, lines of credit, equipment financing, and debt consolidation for businesses across the US and Canada."}
    ],
    "location": "Brooklyn, NY",
    "full_address": "464 Kings Highway, 2nd Floor, Brooklyn, NY 11223",
    "website": "https://advancefundsnetwork.com",
    "employees": 57,
    "category": "funder"
  },
  {
    "id": 195,
    "name": "Beacon Funding Corporation",
    "leaders": [
      {
        "n": "Samuel N. Oliva",
        "t": "Founder & CEO",
        "bg": "Founded Beacon Funding Corporation in 1990 to fill a void in equipment financing for small businesses struggling to secure traditional capital. 1977 graduate of Western Illinois University (Accounting), MBA from University of Chicago (1989) with highest honors. CPA who started his career in 1978 at a small accounting firm and has been managing partner at ECS Financial Services for over 40 years. Also founded Liventus Inc., an IT consultancy, in 2002. His combined companies employ over 250 people.",
        "hooks": [
          "Founded Beacon Funding in 1990 — has now facilitated over $1.7 billion in equipment financing across 29,000+ businesses",
          "MBA from University of Chicago with highest honors, plus CPA — rare combination of finance credentials",
          "Runs three companies simultaneously: Beacon Funding (equipment finance), ECS Financial Services (CPA firm), and Liventus (IT consultancy) with 250+ combined employees",
          "Received an honorary doctorate from Western Illinois University in 2019 recognizing his business achievements"
        ],
        "li": "https://www.linkedin.com/in/samuel-oliva/"
      },
      {
        "n": "Toby McDonough",
        "t": "President",
        "bg": "Leads Beacon Funding's vision, strategy, and operations with over 25 years of experience in the equipment financing industry. Holds the Certified Lease & Finance Professional (CLFP) credential, demonstrating mastery of equipment leasing and finance. Focuses on providing equipment financing solutions to small and medium-sized businesses across niche markets throughout the US.",
        "hooks": [
          "Over 25 years of experience in equipment financing with CLFP certification",
          "Leads operations at a company that has funded $1.7B+ across 29,000+ businesses since 1990",
          "Beacon Funding ranked #27 on Fortune's Best Small and Medium Workplaces in Chicago 2024",
          "Company earned 2024 Great Place to Work certification and Monitor's 2025 Best Companies in Equipment Finance (Culture Category)"
        ],
        "li": "https://www.linkedin.com/in/tobymcdonough/"
      }
    ],
    "desc": "Beacon Funding Corporation is an equipment financing company founded in 1990, headquartered in Northbrook, Illinois. The company has facilitated over $1.7 billion in equipment financing transactions, serving more than 29,000 businesses nationwide, positioning it among the top 15% of equipment financing providers by transaction volume (per ELFA). Beacon specializes in small-ticket equipment financing with average funded amounts of $150,000, covering niche equipment including tow trucks, embroidery machines, boom trucks, screen printing equipment, and cranes. The company offers financing from $10,000 to $1,000,000+ with approval often available within 2-3 business days. Beacon Funding employs approximately 104 people and has earned multiple workplace awards including 2024 Great Place to Work certification and ranking #27 on Fortune's Best Small and Medium Workplaces in Chicago.",
    "news": [
      {"h": "Beacon Funding Earns Great Place to Work Certification 2024", "s": "Great Place to Work, 2024", "d": "Beacon Funding earned the 2024 Great Place to Work certification and was ranked #27 on Fortune's Best Small and Medium Workplaces in Chicago list."},
      {"h": "Beacon Funding Named Among Monitor's 2025 Best Companies in Equipment Finance", "s": "Monitor Daily, 2025", "d": "Recognized in the Culture Category of Monitor's 2025 Best Companies in Equipment Finance, highlighting the company's strong workplace culture."},
      {"h": "Beacon Funding Surpasses $1.7 Billion in Equipment Financing", "s": "Beacon Funding, 2024", "d": "The company announced crossing $1.7 billion in total equipment financing transactions since founding in 1990, serving over 29,000 businesses nationwide."}
    ],
    "location": "Northbrook, IL",
    "full_address": "3400 Dundee Road, Suite 180, Northbrook, IL 60062",
    "website": "https://www.beaconfunding.com",
    "employees": 104,
    "category": "funder"
  }
]
