[
  {
    "id": 1187,
    "name": "Cromwell Capital",
    "leaders": [
      {
        "n": "Ryan McMillan",
        "t": "Finance Consultant & Direct Funder",
        "bg": "Ryan McMillan is a finance consultant and direct funder at Cromwell Capital LLC, specializing in providing working capital for small businesses. He is a graduate of West Virginia University and is based in Manhasset, New York. Ryan focuses on MCA, invoice factoring, and revenue-based financing products for SMB clients seeking fast access to capital.",
        "hooks": [
          "West Virginia University graduate now running direct funding operations",
          "Based in Manhasset, NY serving businesses from Florida-headquartered firm",
          "Specializes in fast-turnaround working capital for small businesses"
        ],
        "li": "https://www.linkedin.com/in/ryan-mcmillan-545796b3/"
      }
    ],
    "desc": "Cromwell Capital is a direct funder and business capital provider headquartered in Dania Beach, Florida. The company provides small business owners with working capital and funding through MCA (merchant cash advances), invoice factoring/financing, lines of credit, and revenue-based financing. Cromwell Capital tailors financial plans to fit unique business situations, offering fast processing and approval for quick capital access. The company targets small and midsize businesses seeking alternatives to traditional bank lending, with a focus on flexible funding solutions. Cromwell has posted about reaching $6 million funded as a recent milestone. The company also works with ISOs through a partner signup program.",
    "news": [
      {"h": "Cromwell Capital Celebrates $6 Million Funded Milestone", "s": "LinkedIn, 2025", "d": "Ryan McMillan announced Cromwell Capital reached $6 million in total funding deployed to small businesses, marking growth for the direct funder."},
      {"h": "Cromwell Capital Expands ISO Partner Signup Program", "s": "DailyFunder Forum", "d": "Cromwell Capital actively recruited ISO partners through industry forums, expanding its broker channel for deal flow."},
      {"h": "Cromwell Capital Listed on LoanNexus Platform", "s": "LoanNexus", "d": "The company was listed on the LoanNexus business lending marketplace platform under MCA and revenue-based financing categories."}
    ],
    "location": "Dania Beach, FL",
    "full_address": "398 E Dania Beach Blvd, Dania Beach, FL 33004",
    "website": "https://www.cromwellcapital.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1189,
    "name": "Custom Capital Funding",
    "leaders": [
      {
        "n": "Unknown — Founder/CEO",
        "t": "Founder",
        "bg": "The founder of Custom Capital Funding has years of experience as a direct lender providing capital to ISOs and brokers. The company positions itself as a 100% direct funder operating from Brooklyn, New York, with a focus on building strong ISO relationships and offering competitive commission structures. Leadership details are not publicly disclosed on the company website.",
        "hooks": [
          "Runs a 100% direct funder model out of Brooklyn, NY",
          "Focuses exclusively on ISO/broker channel partnerships"
        ],
        "li": ""
      }
    ],
    "desc": "Custom Capital Funding is a 100% direct funder headquartered in Brooklyn, New York, specializing in providing merchant cash advances and business funding products. The company works primarily through ISO (Independent Sales Organization) and broker channels rather than directly with end merchants. Custom Capital has years of experience in the direct lending space and positions itself as a partner-first funder, offering late-night funding calls, programs designed to fit any merchant profile, and competitive commission structures for brokers. The company provides various funding programs with different terms, rates, and payback structures. Custom Capital emphasizes its direct funding model, meaning it underwrites and funds deals from its own capital rather than brokering to other funders.",
    "news": [
      {"h": "Custom Capital Funding Expands ISO Partner Programs", "s": "Company Website, 2024", "d": "Custom Capital expanded its suite of funding programs available to ISO partners, offering more flexible terms and higher approval rates for small business merchants."},
      {"h": "Custom Capital Funding Operates as Direct Funder in Brooklyn", "s": "Industry Directory", "d": "The company continues to operate as a direct funder from its Brooklyn headquarters, differentiating itself from brokers by funding deals from its own balance sheet."}
    ],
    "location": "Brooklyn, NY",
    "full_address": "1202 Avenue U, Suite 1100, Brooklyn, NY 11229",
    "website": "https://customcapitalfunding.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1191,
    "name": "Dealstruck",
    "leaders": [
      {
        "n": "Ethan Senturia",
        "t": "Co-Founder & Former CEO",
        "bg": "Ethan Senturia co-founded Dealstruck in 2012 and served as CEO until the company shut down in 2016. He graduated Summa Cum Laude from the Wharton School of Business and began his career as a credit research analyst at Lehman Brothers and Barclays Capital. Before Dealstruck, he was on the founding team of Ampush, a performance marketing company, where he served as VP of Online Media. At Dealstruck he raised over $150M in institutional debt and equity and led a 70-person team. After Dealstruck's collapse, he wrote the book 'Unwound: Real-time Reflections from a Stumbling Entrepreneur' about the experience.",
        "hooks": [
          "*Wharton Summa Cum Laude graduate who wrote a book about his startup failure",
          "Raised $150M+ at Dealstruck before the company's collapse",
          "*Author of 'Unwound' — candid entrepreneurial failure memoir",
          "Former Lehman Brothers analyst who became a fintech founder"
        ],
        "li": "https://www.linkedin.com/in/ethansenturia/"
      },
      {
        "n": "Russell McLoughlin",
        "t": "Co-Founder & CTO",
        "bg": "Russell McLoughlin co-founded Dealstruck with Ethan Senturia in 2012 and served as Chief Technology Officer. He was recognized as one of San Diego's top tech executives in 2016. McLoughlin built the technology platform that powered Dealstruck's crowdlending marketplace, enabling small businesses to access multiple loan products and investors to choose specific investments. He was instrumental in developing the company's digital underwriting capabilities.",
        "hooks": [
          "Named one of San Diego's top tech executives",
          "Built the technology platform for Dealstruck's crowdlending marketplace",
          "Co-founded one of the first multi-product SMB lending platforms"
        ],
        "li": "https://www.linkedin.com/in/russellmcloughlin/"
      }
    ],
    "desc": "Dealstruck was an online peer-to-peer lending platform for small and medium-sized businesses, founded in 2012 and headquartered in Carlsbad, California (San Diego area). It was the first crowdlending platform to offer multiple loan products to SMBs and allow investors to choose specific investments. The company raised $19.5M in total funding over 5 rounds. Dealstruck stopped accepting new loan applications on November 15, 2016, after a failed acquisition deal with CAN Capital (a $33M offer that was turned down) led to financial instability. The company had struggled with profitability, often covering out-of-pocket costs and waiving fees, and suffered significant defaults including an $800K fraudulent loan. In December 2018, substantially all assets were acquired by iBusiness Funding, LLC. The Dealstruck brand was later sold to another company unconnected to the original founders. STATUS: DEFUNCT — ceased operations in 2016, assets acquired 2018.",
    "news": [
      {"h": "How Dealstruck Arrived, 'Disrupted,' and Died — A Cautionary Online Lending Tale", "s": "deBanked, Oct 2018", "d": "deBanked published a detailed post-mortem of Dealstruck's rise and fall, documenting how the company collapsed after turning down a $33M acquisition offer from CAN Capital."},
      {"h": "Popular Business-Lending Marketplace Dealstruck Restructures", "s": "PR Newswire, Dec 2018", "d": "iBusiness Funding acquired substantially all of Dealstruck's assets, integrating the platform and technology into their SMB lending operations."},
      {"h": "What Happened to Dealstruck & Why Did It Fail?", "s": "SunsetHQ", "d": "Analysis of Dealstruck's failure cited the rejected CAN Capital acquisition, profitability struggles, and the broader online lending bubble bursting in 2016 following the Lending Club scandal."},
      {"h": "Ethan Senturia Publishes 'Unwound' Book on Dealstruck Experience", "s": "Amazon/Wharton Knowledge, 2017", "d": "Former CEO Ethan Senturia published a memoir about his entrepreneurial journey and the collapse of Dealstruck, featured on Wharton Knowledge podcast."}
    ],
    "location": "Carlsbad, CA",
    "full_address": "Carlsbad, CA (office closed — company defunct since 2016)",
    "website": "https://www.dealstruck.com",
    "employees": 0,
    "category": "funder"
  },
  {
    "id": 1192,
    "name": "deBanked",
    "leaders": [
      {
        "n": "Sean Murray",
        "t": "President & Chief Editor, Founder",
        "bg": "Sean Murray is the founder, President, and Chief Editor of deBanked, the most influential media publication in the MCA and alternative lending industry. He is a merchant cash advance industry veteran who has been instrumental in funding over $100 million to small businesses through sales and underwriting efforts before launching deBanked (originally Merchant Processing Resource) in 2010. Murray also founded Raharney Capital, LLC, the parent company of deBanked, and created the Broker Fair Conference, which has grown into the largest gathering of MCA and business loan brokers in the country. He also launched deBanked CONNECT, which in 2026 drew a record 1,100+ signups at the Fontainebleau Miami Beach. Murray is a hands-on journalist who has personally written hundreds of articles covering the alternative finance industry.",
        "hooks": [
          "*Founded THE industry publication for MCA/alt lending — deBanked",
          "*Created Broker Fair, the largest MCA broker conference in the US",
          "Personally funded $100M+ to small businesses before becoming an editor",
          "deBanked CONNECT Miami 2026 drew record 1,100+ industry signups"
        ],
        "li": "https://www.linkedin.com/in/semurray"
      },
      {
        "n": "Stephanie Vasquez",
        "t": "Advertising & Marketing Manager",
        "bg": "Stephanie Vasquez handles advertising and marketing at deBanked, managing the publication's sponsor and advertiser relationships. She is a marketing and brand professional with over seven years of experience. Stephanie manages ad sales for deBanked's digital platform, print magazine, and industry events including Broker Fair and deBanked CONNECT conferences. She can be reached at stephanie@debanked.com for advertising inquiries.",
        "hooks": [
          "Manages advertising for the MCA industry's leading publication",
          "Seven years of marketing and brand management experience",
          "Oversees sponsor relationships for Broker Fair and deBanked CONNECT events"
        ],
        "li": "https://www.linkedin.com/in/stephanie-rvasquez/"
      }
    ],
    "desc": "deBanked is THE industry media publication and news platform for the merchant cash advance (MCA) and alternative lending space, operated by Raharney Capital, LLC from Brooklyn, New York. Founded in 2010 by Sean Murray (originally as Merchant Processing Resource before rebranding), deBanked covers the full spectrum of alternative finance including MCA, business lending, P2P lending, fintech, and industry regulation. The publication produces a print magazine, daily digital news coverage, and video content (deBanked TV). deBanked also organizes two major industry conferences: Broker Fair (the largest gathering of MCA and business loan brokers, held annually in NYC — next June 1, 2026) and deBanked CONNECT (held in Miami, San Diego, and other cities — the Miami 2026 event at the Fontainebleau set an industry all-time record with 1,100+ signups). The company has 2-10 employees and is headquartered at 325 Gold Street in Brooklyn. deBanked is widely considered the most important trade publication in the small business lending industry, with its coverage regularly cited by participants across the MCA ecosystem.",
    "news": [
      {"h": "deBanked CONNECT Miami 2026 Sets Industry All-Time Record with 1,100+ Signups", "s": "deBanked, Feb 2026", "d": "The deBanked CONNECT MIAMI 2026 event at the Fontainebleau Miami Beach surpassed all expectations, setting a small business finance industry record for conference signups."},
      {"h": "Broker Fair Returns to NYC — June 1, 2026", "s": "deBanked, Feb 2024", "d": "The annual Broker Fair conference, the largest gathering of MCA and business loan brokers in the US, announced its next NYC event date."},
      {"h": "Broker Battle 2025 Crowns Champions", "s": "deBanked, Feb 2025", "d": "deBanked's Broker Battle competition found its 2025 champions, with brokers competing for cash prizes, trophies, and the top broker title at a live event."},
      {"h": "deBanked Covers Shopify Capital's $1B Quarter", "s": "deBanked, 2025", "d": "deBanked reported that Shopify Capital purchased $1B in business loans and MCAs in Q2 alone, bringing the 2025 first-half total to $1.8B — highlighting the publication's role in tracking industry scale."}
    ],
    "location": "Brooklyn, NY",
    "full_address": "325 Gold Street, Suite 502, Brooklyn, NY 11201",
    "website": "https://debanked.com",
    "employees": 8,
    "category": "service_provider"
  },
  {
    "id": 1193,
    "name": "Decimal Factor",
    "leaders": [
      {
        "n": "Manoj Karkhanis",
        "t": "Founder & CEO",
        "bg": "Manoj Karkhanis is a serial entrepreneur who founded Decimal Factor in 2008, at the height of the financial crisis, when high street banks were unwilling to help small businesses. He has grown the company into a leading FCA-regulated credit brokerage firm operating across the UK and USA. Manoj has led the company to arrange over GBP 50 million in funding for SMEs through their digital credit brokerage platform. He is based in London with global operations spanning the UK, USA, India, Mexico, and Singapore.",
        "hooks": [
          "*Serial entrepreneur who founded fintech firm during the 2008 financial crisis",
          "Built a digital lending platform that has arranged GBP 50M+ for SMEs",
          "Runs operations across 5 countries: UK, USA, India, Mexico, Singapore",
          "FCA-regulated credit broker bridging the gap between banks and SMBs"
        ],
        "li": "https://www.linkedin.com/in/manoj-karkhanis-21b392/"
      },
      {
        "n": "Amit Mehta",
        "t": "Senior Executive",
        "bg": "Amit Mehta brings experience spanning entrepreneurship and investment banking to Decimal Factor. He has worked with Gem Investments and Dunn Loren Merrifield, an investment bank based in Lagos, where his role included origination of deals for financial advisory and corporate bonds. He has raised capital for Money on Mobile India and has extensive experience across emerging markets. Amit holds an Engineering degree from Mangalore University (Manipal) and an MBA in International Business from Bristol University, UK.",
        "hooks": [
          "Investment banking background spanning Africa and emerging markets",
          "MBA from Bristol University with engineering foundation from Manipal",
          "Raised capital for Money on Mobile India",
          "Experience in corporate bond origination from Lagos-based investment bank"
        ],
        "li": ""
      }
    ],
    "desc": "Decimal Factor is an FCA-regulated digital credit brokerage firm founded in 2008 by serial entrepreneur Manoj Karkhanis, headquartered at Level 39 One Canada Square in Canary Wharf, London. The company provides small business loans ranging from GBP 5K to GBP 500K with flexible repayment options, acting as an alternative finance broker that matches SMEs with appropriate lenders. Decimal Factor's digital platform has successfully arranged over GBP 50 million in funding for SMEs, providing real-time comparisons and funding decisions from multiple lenders. The company is authorized by the Financial Conduct Authority (FRN: 727177) and operates internationally across the UK, USA, India, Mexico, and Singapore. Decimal Factor was incorporated in May 2008 as a private limited company and has positioned itself at the intersection of payments and lending in the fintech space. The company uses technology solutions including Digilytics RevEl for processing bank statements as part of their underwriting workflow.",
    "news": [
      {"h": "Decimal Factor Partners with Digilytics for Bank Statement Processing", "s": "Mortgage Finance Gazette, Dec 2020", "d": "Decimal Factor adopted Digilytics RevEl solution to automate bank statement processing, enhancing their digital lending workflow and underwriting speed."},
      {"h": "Decimal Factor Expands Global Operations to Five Countries", "s": "Company Website", "d": "The company expanded its digital credit brokerage operations beyond the UK to include the USA, India, Mexico, and Singapore, broadening its SME lending reach."},
      {"h": "Decimal Factor Reaches GBP 50 Million in SME Funding Arranged", "s": "Company Website", "d": "The platform reached a milestone of arranging over GBP 50 million in funding for small and medium enterprises through its digital brokerage model."}
    ],
    "location": "London, UK",
    "full_address": "Level 39, One Canada Square, Canary Wharf, London, E14 5AB, UK",
    "website": "https://decimalfactor.co.uk",
    "employees": 25,
    "category": "iso"
  },
  {
    "id": 1194,
    "name": "Delancey Street Lending Inc",
    "leaders": [
      {
        "n": "Maxinder Soni",
        "t": "Founder & Chief Marketing Officer",
        "bg": "Maxinder Soni is the Founder and CMO of Delancey Street Group LLC. He started his first business at age 17 and brings a lifetime of entrepreneurial experience and digital marketing expertise to the business debt relief industry. At age 22, he created and successfully sold one of the largest reverse mortgage websites. Soni leads the company's marketing strategy and client acquisition efforts from their Midtown Manhattan headquarters.",
        "hooks": [
          "*Started first business at age 17, sold major reverse mortgage website at 22",
          "Built one of the largest reverse mortgage websites before pivoting to debt relief",
          "Combines digital marketing expertise with deep lending industry knowledge"
        ],
        "li": "https://www.linkedin.com/in/maxinder-soni/"
      },
      {
        "n": "Steven M. Raiser",
        "t": "Founding Partner & Chief Legal Officer",
        "bg": "Steven Raiser is a founding partner and Chief Legal Officer of Delancey Street Group LLC. He is an attorney, former prosecutor, and commissioned military officer with combat deployment in Iraq. Raiser combines legal mastery, leadership under pressure, and strategic insight to guide complex business debt restructuring and litigation. His military and prosecutorial background brings a unique perspective to navigating high-stakes debt relief negotiations.",
        "hooks": [
          "*Former prosecutor and military officer with Iraq combat deployment",
          "Combines legal, military, and prosecutorial backgrounds for debt negotiations",
          "Guides complex MCA debt restructuring from a legal-first approach"
        ],
        "li": ""
      },
      {
        "n": "Vinay Metharamani",
        "t": "CEO & Founder",
        "bg": "Vinay Metharamani serves as CEO and Founder at Delancey Street, bringing experience in financial restructuring and client strategy. He oversees the company's operations and strategic direction from the New York headquarters, managing the firm's approach to business debt solutions including MCA debt relief, debt settlement, and business restructuring services.",
        "hooks": [
          "Leads a debt relief firm that operates on both sides of the lending table",
          "CEO overseeing MCA debt restructuring operations from Midtown Manhattan"
        ],
        "li": "https://www.linkedin.com/in/vinay-metharamani-259493178/"
      }
    ],
    "desc": "Delancey Street is a business debt relief and settlement company headquartered in Midtown Manhattan, New York. The company specializes in helping business owners struggling with merchant cash advance (MCA) debt, unsecured business debt, and other forms of business financing obligations. Delancey Street's team includes attorneys, former prosecutors, and former lending industry insiders who have operated on both sides of the lending table, giving them insight into how funders think and negotiate. The firm offers MCA debt restructuring, business debt settlement, and legal defense services, with programs designed to help businesses become debt-free in 6-18 months. They also provide hard money lending services for real estate, including commercial bridge loans, fix-and-flip financing, and construction loans with rates of 8-12% and terms of 3-24 months. The company uses AI in its lending decision-making process and has expanded services to Los Angeles and other markets nationwide. Delancey Street was founded by entrepreneurs and legal professionals who recognized the need for business owners to have advocates against aggressive MCA collection practices.",
    "news": [
      {"h": "Delancey Street Expands MCA Debt Relief Services Nationwide", "s": "Company Website, 2025", "d": "Delancey Street expanded its MCA defense and business debt relief services to serve clients across all 50 states from its New York headquarters."},
      {"h": "Hard Money Lender Delancey Street Bringing Commercial Bridge Loans to NYC", "s": "HousingWire", "d": "Delancey Street announced expansion of its hard money lending operations with commercial bridge loans in the New York City market."},
      {"h": "Delancey Street Launches ISO Partnership Program", "s": "Company Announcement, Oct 2025", "d": "The company launched a partnership program for ISOs, expanding its channel strategy to work with independent sales organizations in the business debt relief space."}
    ],
    "location": "New York, NY",
    "full_address": "54 W 40th St, New York, NY 10018",
    "website": "https://www.delanceystreet.com",
    "employees": 20,
    "category": "service_provider"
  },
  {
    "id": 1195,
    "name": "delt.ai",
    "leaders": [
      {
        "n": "Jose de la Luz Lopez",
        "t": "Founder & CEO (now COO at Albo)",
        "bg": "Jose de la Luz Lopez co-founded delt.ai in 2019 and served as CEO, building a Y Combinator-backed digital banking platform for businesses in Latin America. Under his leadership, delt.ai conducted over 130,000 transactions and granted over $90 million in loans and credit lines to Mexican SMBs. He has experience in finance including investments, Latam stocks, startup financial management, and corporate finance. Following Albo's $20M acquisition of delt.ai in 2023, Jose joined Albo as Chief Operating Officer.",
        "hooks": [
          "*Y Combinator W20 founder who built a $90M+ lending platform in Mexico",
          "Transitioned from founder/CEO to COO at acquiring company Albo",
          "Built digital banking serving 130,000+ SMB transactions in Latin America"
        ],
        "li": "https://www.linkedin.com/in/josedelaluzlopez/"
      },
      {
        "n": "Alejandro Cedeno",
        "t": "Co-Founder & CTO",
        "bg": "Alejandro Cedeno co-founded delt.ai and served as CTO, building the technical infrastructure for the company's digital banking and lending platform. He is a software engineer focused on efficient software architecture design, applying best practices from algorithms and data structures to complex workflows. His interests span AI and fintech, particularly how both can work together to deliver financial solutions for businesses in Latin America.",
        "hooks": [
          "Software architect who built a Y Combinator fintech platform from scratch",
          "Passionate about AI and fintech convergence for Latin American markets",
          "Co-built platform tackling the $450B+ business payments market in Mexico"
        ],
        "li": ""
      }
    ],
    "desc": "delt.ai was a Y Combinator-backed (W20) fintech company based in Mexico City that provided digital banking and lending services for businesses in Latin America. Founded in 2019 by Jose de la Luz Lopez and Alejandro Cedeno, the company built a natively digital alternative to traditional banking with integrated payment gateways and API integrations targeting the $450B+ business payments market in Mexico. delt.ai conducted over 130,000 transactions and granted over $90M in loans and credit lines to SMBs. The company raised debt financing by processing $25M in digital assets on the TrueFi blockchain platform for DeFi-based business lending. In August 2023, Mexican neobank Albo acquired delt.ai for $20 million, making Albo the only neobank in Mexico with both credit and debit products for consumers and SMBs. Following the acquisition, delt.ai's CEO Jose de la Luz joined Albo as COO. The company had approximately 26 employees at the time of acquisition. STATUS: ACQUIRED by Albo for $20M in August 2023.",
    "news": [
      {"h": "Albo Acquires delt.ai for $20 Million", "s": "Contxto / PR Newswire, Aug 2023", "d": "Mexican neobank Albo confirmed the $20M acquisition of Y Combinator-backed delt.ai, becoming the only neobank in Mexico with credit and debit products for both consumers and SMEs."},
      {"h": "delt.ai Raises $25M Through DeFi Blockchain Platform TrueFi", "s": "delt.ai Blog / LatamList", "d": "delt.ai secured $25M in debt financing by processing digital assets on the TrueFi blockchain platform, pioneering DeFi-powered business lending in Mexico."},
      {"h": "delt.ai Celebrates 1 Billion Pesos in Transactions", "s": "delt.ai Blog", "d": "The company reached a milestone of 1 billion Mexican pesos in processed transactions, demonstrating significant traction in the Mexican SMB market."},
      {"h": "Plug and Play Announces Investment in delt.ai", "s": "Plug and Play Tech Center", "d": "Global innovation platform Plug and Play invested in delt.ai, citing the company's mission to democratize access to digital banking in Latin America."}
    ],
    "location": "Mexico City, Mexico",
    "full_address": "Mexico City, CDMX, Mexico (acquired by Albo, Aug 2023)",
    "website": "https://delt.ai",
    "employees": 26,
    "category": "bank"
  },
  {
    "id": 1196,
    "name": "DFL Capital",
    "leaders": [
      {
        "n": "Daniel Levine",
        "t": "Founder & Owner",
        "bg": "Daniel Levine is the Founder and Owner of DFL Capital, a business financing firm he started out of passion for providing capital consulting services to fellow business owners. He focuses on a consultative approach to business lending, helping small businesses access working capital, lines of credit, equipment financing, and merchant cash advances without predatory lending practices. Daniel is based in Rochester, New York and can be reached at (716) 249-4243.",
        "hooks": [
          "Founded DFL Capital to provide ethical capital consulting to small businesses",
          "Takes a consultative approach — not predatory lending tactics",
          "Based in Rochester, NY serving businesses across North America"
        ],
        "li": "https://www.linkedin.com/in/daniel-levine-dfl/"
      }
    ],
    "desc": "DFL Capital is a small business lending and capital consulting firm founded in 2023 by Daniel Levine, based in Rochester, New York. The company takes a consultative approach to business financing, helping clients find the right loan product for their needs rather than using predatory lending practices. DFL Capital offers a range of products including working capital loans, lines of credit, equipment financing, merchant cash advances, term loans, invoice factoring, and revenue-based financing. The company operates through related entities including DFL Consulting LLC and aims to secure the best rates for clients across multiple lending products. DFL Capital serves businesses in all industries across North America with a focus on fast funding, easy applications, and flexible terms. The company differentiates itself through its capital consulting model, working closely with business owners to understand their needs before recommending financing solutions.",
    "news": [
      {"h": "DFL Capital Launches Capital Consulting Services for Small Businesses", "s": "Company Website, 2023", "d": "Daniel Levine founded DFL Capital with a mission to provide transparent, consultative capital solutions for small business owners across North America."},
      {"h": "DFL Capital Expands Product Suite to Include Multiple Financing Options", "s": "Company Website", "d": "The company expanded beyond MCAs to offer lines of credit, equipment financing, term loans, invoice factoring, and revenue-based financing products."}
    ],
    "location": "Rochester, NY",
    "full_address": "Rochester, NY (specific street address not publicly listed)",
    "website": "https://www.dflcapital.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1197,
    "name": "Diamond Stone Funding",
    "leaders": [
      {
        "n": "Gedalya Kish",
        "t": "ISO Relations",
        "bg": "Gedalya Kish handles ISO relations at Diamond Stone Funding, managing the company's relationships with independent sales organizations and brokers who bring deal flow to the firm. He is based at the company's Ramsey, New Jersey headquarters and works on expanding the company's partner network for small business funding deals.",
        "hooks": [
          "Manages ISO partner relationships for a New Jersey-based funder",
          "Based in Ramsey, NJ working with brokers across the business funding space"
        ],
        "li": "https://www.linkedin.com/in/gedalya-kish-6126b9243/"
      }
    ],
    "desc": "Diamond Stone Funding is a small business financing company headquartered in Ramsey, New Jersey. The company provides sustainable financing solutions aimed at empowering small business owners to facilitate corporate growth and security. Diamond Stone offers funding for equipment purchases, renovation, payroll coverage, and debt consolidation, serving a wide range of industries including restaurants, law firms, medical practices, and more. The company operates with a straightforward application process: businesses complete an online application, the underwriting team reviews it, and upon approval, funds are sent directly to the business's bank account. Diamond Stone Funding works with ISOs and brokers as its primary deal flow channel and serves businesses across the United States from its New Jersey headquarters.",
    "news": [
      {"h": "Diamond Stone Funding Continues Small Business Lending Operations from New Jersey", "s": "Company Website", "d": "Diamond Stone Funding maintains its headquarters in Ramsey, NJ, providing personalized funding solutions across multiple industries."},
      {"h": "Diamond Stone Funding Expands ISO Partner Relationships", "s": "LinkedIn", "d": "The company actively recruits ISO partners through LinkedIn and industry channels to expand its small business funding deal pipeline."}
    ],
    "location": "Ramsey, NJ",
    "full_address": "663 E Crescent Ave, Ramsey, NJ 07446",
    "website": "https://diamondstonefunding.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1198,
    "name": "DigiFi",
    "leaders": [
      {
        "n": "Joshua Jersey",
        "t": "Co-Founder & CEO",
        "bg": "Joshua Jersey co-founded DigiFi in 2017 and serves as CEO. He previously co-founded Promise Financial, a marketplace lending platform focused on life event financing. Before entering fintech, Joshua worked at Lee Equity Partners as Vice President, Golden Gate Capital, and Bain & Company as a management consultant. He holds an AB in East Asian Studies from Princeton University (2004-2008). Jersey brings deep experience in growth investing and lending technology, having built DigiFi out of frustration with legacy loan origination technology at his previous lending company.",
        "hooks": [
          "*Princeton East Asian Studies graduate turned fintech CEO",
          "Previously co-founded Promise Financial (marketplace lending for life events)",
          "Former Bain consultant and Lee Equity Partners VP turned lending tech founder",
          "Built DigiFi after being frustrated by legacy lending technology at his own company"
        ],
        "li": "https://www.linkedin.com/in/joshuajersey/"
      },
      {
        "n": "Bradley Vanderstarren",
        "t": "Co-Founder & President",
        "bg": "Bradley Vanderstarren co-founded DigiFi in 2017 and serves as President. He previously co-founded Promise Financial with Joshua Jersey, where he served as President. Bradley started his career as a Senior Consultant at Oliver Wyman (2009) before joining Lee Equity Partners as Vice President (2011). In 2019, he also founded Satellite Innovations, Inc., providing skilled engineers and private workspaces for US companies. He began his career as a Summer Intern at Deloitte in 2007.",
        "hooks": [
          "Oliver Wyman consultant turned fintech co-founder",
          "Also founded Satellite Innovations providing engineering talent",
          "Lee Equity Partners VP who co-founded two lending companies",
          "Serial co-founder: Promise Financial, DigiFi, and Satellite Innovations"
        ],
        "li": "https://www.linkedin.com/in/bradley-vanderstarren-14412422"
      },
      {
        "n": "Matthew Norton",
        "t": "Co-Founder & CTO",
        "bg": "Matthew Norton co-founded DigiFi in 2017 and serves as Chief Technology Officer, leading the technical architecture of the company's cloud-based loan origination platform. He previously worked with Jersey and Vanderstarren at Promise Financial. Norton leads the engineering team that has built DigiFi's no-code configuration tools, AI agent capabilities, and developer toolkit that enables lenders to automate and customize their loan origination workflows.",
        "hooks": [
          "Built the technology stack powering $100B+ in processed loan applications",
          "Leads development of DigiFi's AI agent for automated lending tasks",
          "Third-time co-founding with the same team (Promise Financial, DigiFi)"
        ],
        "li": ""
      }
    ],
    "desc": "DigiFi is a cloud-based digital loan origination platform founded in 2017 by Joshua Jersey, Bradley Vanderstarren, and Matthew Norton, headquartered in Miami, FL (with a New York office at 25 Broadway). The platform automates the end-to-end loan origination process for consumer, mortgage, small business, and commercial lending. DigiFi-enabled lenders have processed more than $100 billion in loan applications. The company reached approximately $15M in annual revenue as of mid-2025 with about 50 employees across 4 continents. DigiFi's tech stack includes React, Node.js, and Lua, and the platform is SOC 2 Type II compliant. In 2025, DigiFi launched an AI Agent purpose-built to automate nuanced loan origination tasks such as conditions, stipulations, and verification activities. Key partnerships include Ascent (application optimization, Jan 2025), ValidiFI (automated credit decisioning, Dec 2024), Scienaptic AI (AI-powered credit decisions), and Carrington Labs (cash flow underwriting, Aug 2025). The founders previously built Promise Financial together and created DigiFi after being frustrated by legacy origination technology. THIS IS A HYPERVERGE COMPETITOR in the lending technology/underwriting automation space — DigiFi's AI agent and automated decisioning capabilities directly compete with HyperVerge's document analysis and underwriting products for the same lender customers.",
    "news": [
      {"h": "DigiFi Launches AI Agent for Automated Lending Tasks", "s": "DigiFi Blog, 2025", "d": "DigiFi released a purpose-built AI Agent that automates loan origination tasks including conditions, stipulations, and verification activities, with plans to expand to autonomous background processing."},
      {"h": "DigiFi Partners with Ascent to Optimize Loan Originations", "s": "PR Newswire, Jan 2025", "d": "Ascent Platform and DigiFi partnered to enable lenders to rapidly build and deploy custom digital applications integrated with DigiFi's LOS, with Ascent shown to cut application abandonment in half."},
      {"h": "Carrington Labs Partners with DigiFi for Cash Flow Underwriting", "s": "Carrington Labs, Aug 2025", "d": "Carrington Labs integrated with DigiFi to bring automated cash flow underwriting capabilities to the loan origination platform."},
      {"h": "ValidiFI Partners with DigiFi for Automated Credit Decisioning", "s": "Industry News, Dec 2024", "d": "ValidiFI partnered with DigiFi to empower lenders with automated, streamlined credit decisioning within the DigiFi platform."}
    ],
    "location": "Miami, FL",
    "full_address": "1111 Brickell Ave, FL 10, Miami, FL 33131",
    "website": "https://www.digifi.io",
    "employees": 50,
    "category": "competitor"
  }
]
