[
  {
    "id": 1212,
    "name": "Essential Funding Group",
    "leaders": [
      {
        "n": "Richard Kim",
        "t": "Managing Partner",
        "bg": "Leads Essential Funding Group as Managing Partner, overseeing the company's direct MCA funding operations. Built the firm's ISO partnership model, focusing on B-D grade merchant cash advance paper with 30-180 day terms. Manages relationships with ISOs nationwide from the company's Southfield, Michigan base.",
        "hooks": [
          "Runs a direct funder model that exclusively works through ISO partnerships rather than brokering or co-brokering deals",
          "Offers 10-12 points on funded maximum for ISO partners based on risk assessment",
          "Focused on short-term MCA funding with weekly payment options"
        ],
        "li": "https://www.linkedin.com/company/essential-funding-group"
      }
    ],
    "desc": "Essential Funding Group is a direct merchant cash advance funder based in Southfield, Michigan. The company funds directly to merchants through ISO channels and does not broker or co-broker deals, operating strictly as an ISO partnership business. They actively onboard ISOs for B-D grade MCA paper with funding terms of 30-180 days and weekly funding options, offering 10-12 points on the funded maximum based on risk assessment. The company also operates the website myessentialfunding.com for its partner and merchant-facing operations.",
    "news": [
      {
        "h": "Essential Funding Group actively recruiting ISO partners on DailyFunder",
        "s": "DailyFunder",
        "d": "2023"
      },
      {
        "h": "Company maintains direct funder model with ISO-only distribution channel",
        "s": "DailyFunder",
        "d": "2023"
      }
    ],
    "location": "Southfield, MI",
    "full_address": "25231 Lois Ln, Southfield, MI 48033",
    "website": "myessentialfunding.com",
    "employees": "2-10",
    "category": "funder"
  },
  {
    "id": 1213,
    "name": "Evergreen Funding, Inc.",
    "leaders": [
      {
        "n": "Meredith Lax Singleton",
        "t": "President",
        "bg": "Serves as President of Evergreen Funding, Inc. Previously worked as Director of Human Resources and Vice President for over ten years in the consumer finance and asset-based lending industries. Transitioned into business ownership at Evergreen Funding where she leads operations, compliance, and client experience management.",
        "hooks": [
          "Made the transition from corporate HR and VP roles in consumer finance to business ownership in the MCA space",
          "Over a decade of experience across consumer finance and asset-based lending industries",
          "Leads operations, compliance, and client experience at Evergreen Funding"
        ],
        "li": "https://www.linkedin.com/in/meredith-lax-singleton/"
      }
    ],
    "desc": "Evergreen Funding, Inc. is a working capital solutions provider based in Hewlett, New York, serving small to midsize businesses. The company funds accounts receivable by purchasing outstanding invoices, providing immediate funding for companies experiencing cash flow issues or seeking constant access to capital. Founded in 2018, Evergreen Funding offers capital ranging from $10,000 to $1,000,000 with approval in as little as 24 hours. The company also provides solutions for overleveraged merchants and extreme cash flow situations through its relationships with various underwriters.",
    "news": [
      {
        "h": "Evergreen Funding listed on DailyFunder as funding solutions provider for overleveraged merchants",
        "s": "DailyFunder",
        "d": "2023"
      },
      {
        "h": "Company provides working capital solutions ranging from $10K to $1M with 24-hour approval turnaround",
        "s": "evgfund.com",
        "d": "2024"
      }
    ],
    "location": "Hewlett, NY",
    "full_address": "1573 Broadway, Hewlett, NY 11557",
    "website": "evgfund.com",
    "employees": "2-10",
    "category": "funder"
  },
  {
    "id": 1214,
    "name": "EZ Capital Group",
    "leaders": [
      {
        "n": "Gordon Akman",
        "t": "CEO",
        "bg": "Serves as CEO of EZ Capital Group, Inc., leading the fintech company's operations from its New York City headquarters at 160 Pearl Street. Oversees a team providing unsecured business loans and merchant cash advances to businesses that have struggled to obtain funding from traditional lenders.",
        "hooks": [
          "Leads a fintech platform that matches small businesses with lenders across multiple financing products",
          "Based in NYC's Financial District serving businesses that cannot access traditional bank lending",
          "Platform approach connects borrowers with multiple lender options including MCA, equipment financing, and lines of credit"
        ],
        "li": "https://www.linkedin.com/in/gordon-akman-0526869"
      }
    ],
    "desc": "EZ Capital Group, Inc. is a financial technology company headquartered in New York City's Financial District. The company operates a smart business financing platform that matches small and medium business owners with tailored lending solutions from a network of lending partners. EZ Capital offers a range of products including merchant cash advances, equipment financing, accounts receivable financing, commercial real estate loans, startup loans, and business lines of credit. The platform emphasizes accessibility for businesses that have struggled to obtain funding from traditional lenders, focusing on revenue-based rather than credit-score-based underwriting. The company has earned a 4.1/5 rating on Trustpilot from satisfied borrowers.",
    "news": [
      {
        "h": "EZ Capital maintains 4.1/5 Trustpilot rating with repeat customers citing faster rates on second loans",
        "s": "Trustpilot",
        "d": "2025"
      },
      {
        "h": "Platform continues expansion of business financing options including MCA and equipment financing",
        "s": "ezcapital.com",
        "d": "2024"
      }
    ],
    "location": "New York, NY",
    "full_address": "160 Pearl St, New York, NY 10005",
    "website": "ezcapital.com",
    "employees": "11-50",
    "category": "funder"
  },
  {
    "id": 1215,
    "name": "FaaStrak",
    "leaders": [
      {
        "n": "Ken Brokaw",
        "t": "Founder & CEO",
        "bg": "Founded FaaStrak in 2015 to help businesses discover and utilize different financial products. Over 11 years, conquered the markets of equipment leasing, working capital, startup funding, and business lines of credit. Raised $710K from investors including Ubiquiti Networks, Stacked Capital, and advisory board member John F. Brock III (former CEO of Coca-Cola Enterprises). Grew the company to $1.1M revenue with a 12-person team.",
        "hooks": [
          "Built a fintech platform with 85% approval rate by smart-matching businesses to optimal lenders",
          "Secured advisory from John F. Brock III, former CEO of Coca-Cola Enterprises",
          "Led acquisition of Sparkir in 2022, adding $260M in equipment financing originations experience",
          "Grew FaaStrak to $1.1M revenue and $3.5M valuation with lean 12-person team"
        ],
        "li": "https://www.linkedin.com/in/kenbrokaw"
      },
      {
        "n": "Ryan Chen",
        "t": "COO",
        "bg": "Became COO of FaaStrak following the 2022 acquisition of Sparkir, where he managed the sales team. Focuses on the success of FaaStrak's newly joined sales teams and operational integration post-acquisition. Brings equipment leasing and financing expertise from his time leading Sparkir's operations.",
        "hooks": [
          "Joined through Sparkir acquisition bringing 15+ years of equipment financing experience",
          "Manages integration of combined sales teams across FaaStrak's financing platform",
          "Oversees daily operations supporting the company's multi-product lending marketplace"
        ],
        "li": "https://www.linkedin.com/company/faastrak"
      }
    ],
    "desc": "FaaStrak is a fintech company headquartered in Charlotte, North Carolina, that uses technology to process verified business, personal, and cash flow data to match businesses with ideal financial products. Founded in 2015, the platform offers a digitalized service that finds the right funding for businesses with over 85% approval rates, providing personalized offers from top lenders in business financing. Products include business loans, equipment leasing, working capital, business lines of credit, startup funding, and cash advances. In 2022, FaaStrak acquired Sparkir, an equipment leasing broker with $260M in originations for 11,000+ U.S. businesses. The company hit $1.1M revenue in 2024 with a 12-person team and achieved a $3.5M valuation. Annual revenue reached $3M in 2025.",
    "news": [
      {
        "h": "FaaStrak acquires equipment leasing broker Sparkir, adding $260M origination experience",
        "s": "PRD Newswire",
        "d": "2022-06"
      },
      {
        "h": "Company reaches $1.1M revenue with 12-person team and $3.5M valuation",
        "s": "Latka",
        "d": "2024"
      },
      {
        "h": "FaaStrak announces two new products ahead of London Tech Week",
        "s": "PRWeb",
        "d": "2023"
      }
    ],
    "location": "Charlotte, NC",
    "full_address": "1300 South Blvd, Ste D, Charlotte, NC 28203",
    "website": "faastrak.com",
    "employees": "12-16",
    "category": "iso"
  },
  {
    "id": 1216,
    "name": "FAC Solutions",
    "leaders": [],
    "desc": "FAC Solutions is a full-service business lender based in Boca Raton, Florida, offering a variety of financing products to businesses worldwide. Founded in 2020, the company provides cash advances/MCA, equipment leasing and financing, invoice factoring and financing, lines of credit, SBA loans, and term loans. With a combined 50 years of experience in the financial world, FAC Solutions positions itself as a comprehensive financing partner for small and medium-sized businesses. The company is listed on LoanNEXUS and maintains an active LinkedIn presence promoting working capital and business line of credit products.",
    "news": [
      {
        "h": "FAC Solutions listed on LoanNEXUS lending marketplace platform",
        "s": "LoanNEXUS",
        "d": "2024"
      },
      {
        "h": "Company continues expansion of multi-product business lending from Boca Raton headquarters",
        "s": "facsolutions.biz",
        "d": "2024"
      }
    ],
    "location": "Boca Raton, FL",
    "full_address": "2200 North Federal Highway, Suite 214, Boca Raton, FL 33431",
    "website": "facsolutions.biz",
    "employees": "2-10",
    "category": "funder"
  },
  {
    "id": 1217,
    "name": "Fairbrook Funding",
    "leaders": [
      {
        "n": "Lance Robinson Jr.",
        "t": "Founder & Managing Director",
        "bg": "Founded Fairbrook Funding to provide strategic financial solutions for small businesses. Specializes in navigating equipment financing policies, guidelines, and programs with a sharp focus on SBA loans, term loans, business lines of credit, working capital solutions, and franchise financing. Focuses on cultivating business relationships and simplifying the financing process for entrepreneurs.",
        "hooks": [
          "Built a multi-product business financing company covering SBA loans, equipment financing, and franchise funding",
          "Specializes in simplifying complex financing processes for small business owners",
          "Operates from Plano, Texas serving nationwide business financing needs"
        ],
        "li": "https://www.linkedin.com/in/lance-robinson-fairbrookfunding/"
      }
    ],
    "desc": "Fairbrook Funding is a business financing company based in Plano, Texas, offering a range of financing solutions including equipment financing, SBA loans, business lines of credit, working capital, mortgage lending, home renovation loans, and commercial financing. The company focuses on providing tailored solutions that simplify the process for entrepreneurs, allowing them to concentrate on core business operations. Fairbrook Funding has a BBB business profile and has not raised institutional funding, operating as an independent financing advisory and brokerage firm. Their popular programs include equipment loans and leases, working capital loans, business lines of credit, SBA loans, and franchise financing.",
    "news": [
      {
        "h": "Fairbrook Funding maintains active BBB business profile in Plano, Texas",
        "s": "BBB",
        "d": "2024"
      },
      {
        "h": "Company expands equipment financing and SBA loan advisory services",
        "s": "fairbrookfunding.com",
        "d": "2024"
      }
    ],
    "location": "Plano, TX",
    "full_address": "Plano, TX 75023",
    "website": "fairbrookfunding.com",
    "employees": "2-10",
    "category": "funder"
  },
  {
    "id": 1218,
    "name": "Faith Funding Partners",
    "leaders": [],
    "desc": "Faith Funding Partners is a merchant cash advance funder operating in the alternative business lending space. The company maintains a low public profile with limited online presence across industry directories such as FunderIntel, deBanked, and DailyFunder. Despite multiple searches across business databases, LinkedIn, BBB, and MCA industry resources, detailed information about the company's leadership, specific address, and operational details remains limited. The company appears to operate as a smaller or newer entrant in the MCA funding market.",
    "news": [],
    "location": "Unknown",
    "full_address": "Unknown",
    "website": "Unknown",
    "employees": "Unknown",
    "category": "funder"
  },
  {
    "id": 1220,
    "name": "Fast A/R Funding",
    "leaders": [
      {
        "n": "Matthew Begley",
        "t": "CEO (now COO of Republic Business Credit)",
        "bg": "CEO of Fast A/R Funding who built his career in commercial finance with an emphasis on asset-based lending and factoring. Former President of Siemens First Capital Commercial Finance, LLC. Following Republic Business Credit's acquisition of Fast A/R Funding in 2019, became COO of Republic and helped establish the West Coast office. Led a team of industry veterans who financed invoices totaling more than $10 billion.",
        "hooks": [
          "Former President of Siemens First Capital Commercial Finance with deep ABL expertise",
          "Led Fast A/R Funding to win FactoringClub's Best Factoring Company Award in 2018",
          "Transitioned to COO of Republic Business Credit after acquisition, overseeing West Coast expansion",
          "Team has collectively financed over $10 billion in invoices across their careers"
        ],
        "li": "https://www.linkedin.com/in/matthew-begley-10486b4/"
      }
    ],
    "desc": "Fast A/R Funding is an invoice factoring company that provides selective factoring through a proprietary, paperless software platform. Originally based in Sherman Oaks, California, the company was acquired by Republic Business Credit in December 2019 along with Continental Business Credit. Fast A/R Funding is the small-ticket factoring product within Republic Business Credit's platform, offering quick approval and business funding through factoring for one transparent fee. The company's seamless invoice management system combined with a fast approval process earned it the FactoringClub's Best Factoring Company Award for 2018 and the Emerging Growth Company of the Year award from the Louisiana ACG chapter. Post-acquisition, Republic Business Credit operates from New Orleans with offices in Los Angeles, Houston, Chicago, Nashville, and Minnesota.",
    "news": [
      {
        "h": "Republic Business Credit acquires Continental Business Credit and Fast A/R Funding to expand platform",
        "s": "Secured Finance Network",
        "d": "2019-12"
      },
      {
        "h": "Fast A/R Funding wins FactoringClub's Best Factoring Company Award",
        "s": "FactoringClub",
        "d": "2018"
      },
      {
        "h": "TAB Bank provides Fast A/R Funding with a rediscount credit facility to support growth",
        "s": "Fast A/R Funding Blog",
        "d": "2019"
      },
      {
        "h": "Republic Business Credit celebrates 15th anniversary highlighting Fast A/R Funding integration success",
        "s": "PR Newswire",
        "d": "2025"
      }
    ],
    "location": "Sherman Oaks, CA (now part of Republic Business Credit, New Orleans, LA)",
    "full_address": "Sherman Oaks, CA (Republic HQ: New Orleans, LA)",
    "website": "fastarfunding.com",
    "employees": "11-50 (as part of Republic Business Credit)",
    "category": "funder"
  },
  {
    "id": 1222,
    "name": "FilmHedge",
    "leaders": [
      {
        "n": "Jon Gosier",
        "t": "Founder & CEO",
        "bg": "Serial entrepreneur, investor, and innovator who founded FilmHedge in 2020. Co-founded programmatic advertising company Audigent, which was acquired by Experian in 2024 for a reported $200-300 million. As founder of Southbox Capital (d/b/a Gosier Holdings), oversees a diverse $200M+ portfolio spanning technology, real estate, venture capital, and credit facilities. Named 2025 EY Southeast Entrepreneur of the Year. Has a Wikipedia page and IMDB profile as a producer.",
        "hooks": [
          "Co-founded Audigent, sold to Experian in 2024 for reported $200-300M — brings major exit credibility",
          "Named 2025 EY Southeast Entrepreneur of the Year by Ernst & Young",
          "Presented at World Economic Forum Davos 2025 on film and TV financing",
          "Oversees $200M+ portfolio through Southbox Capital across tech, real estate, and credit"
        ],
        "li": "https://www.linkedin.com/in/jongos/"
      },
      {
        "n": "Chandler Heinz",
        "t": "COO",
        "bg": "Serves as Chief Operating Officer of FilmHedge, managing the operational side of the fintech lending platform. Works closely with the founding team to scale FilmHedge's private credit operations serving TV and film producers. Oversees the platform's underwriting and deal execution processes.",
        "hooks": [
          "Leads operations at one of the largest and fastest-growing private financiers of Film/TV productions",
          "Manages deal execution for productions in the $3M-$50M budget range",
          "Operates from FilmHedge's Atlanta Tech Square headquarters"
        ],
        "li": "https://www.linkedin.com/company/filmhedge"
      },
      {
        "n": "Mickey Vetter",
        "t": "Co-Founder",
        "bg": "Co-Founder of FilmHedge who participated alongside Jon Gosier at the World Economic Forum in Davos 2025, meeting with institutional finance and entertainment executives to discuss new financing products and advocate for industry-wide adoption of film and TV financing solutions.",
        "hooks": [
          "Represented FilmHedge at Davos 2025 World Economic Forum activities",
          "Part of the founding team that has directed over $200M to film and TV productions since 2020",
          "Helps drive institutional interest in film financing as an asset class"
        ],
        "li": "https://www.linkedin.com/company/filmhedge"
      }
    ],
    "desc": "FilmHedge is an Atlanta-based fintech platform that provides private credit and bridge lending to qualified TV and film producers. Founded in 2020, the company offers short-term bridge and gap loans for media projects in the $3M to $50M budget range, lending up to 10% of total budget with a maximum of $25M per project. FilmHedge securitizes distribution deals, tax credits, pre-sales, minimum guarantees, and bonded films for its network of investors including hedge funds, PE funds, and family offices. The company allocated over $100M to 20+ productions in 2021 alone and has directed $200M+ total to film/TV since launch. 10% of all major U.S. Film/TV productions apply for FilmHedge lending. The company closed a $5M Series A in 2023 led by Collab Capital, WOCStar, SCADPro, and TriplePoint Capital alongside a $100M credit facility. In May 2025, FilmHedge launched ScreenPoints.com, a marketplace for buying, selling, and trading screen credits, and unveiled an AI platform at Cannes for institutional investor underwriting.",
    "news": [
      {
        "h": "FilmHedge launches AI platform at Cannes Film Festival and debuts ScreenPoints.com marketplace",
        "s": "Digital Journal",
        "d": "2025-05"
      },
      {
        "h": "CEO Jon Gosier named 2025 EY Southeast Entrepreneur of the Year",
        "s": "Yahoo Finance",
        "d": "2025-06"
      },
      {
        "h": "FilmHedge founders present at World Economic Forum Davos 2025 on film financing",
        "s": "European Business Magazine",
        "d": "2025-01"
      },
      {
        "h": "Elizabeth Bay Productions strikes financing and distribution deal with FilmHedge",
        "s": "Deadline",
        "d": "2024-07"
      }
    ],
    "location": "Atlanta, GA",
    "full_address": "75 5th Street NW, Suite 2000, Atlanta, GA 30308",
    "website": "filmhedge.com",
    "employees": "10-12",
    "category": "funder"
  },
  {
    "id": 1223,
    "name": "Finance Factory",
    "leaders": [
      {
        "n": "Matt Sochurek",
        "t": "Co-Founder & CEO",
        "bg": "Co-founded Finance Factory in 2006 and serves as CEO. Was instrumental in helping Finance Store achieve Inc. 500 honors for two straight years. Has helped establish over $1 billion in funding for entrepreneurs nationwide through the Finance Factory platform. Recognized as one of LendingTree's top startup funding experts.",
        "hooks": [
          "Built Finance Factory to over $1 billion in total funding for entrepreneurs since 2006",
          "Previously helped Finance Store achieve Inc. 500 honors two consecutive years",
          "Ranked as one of LendingTree's top startup funding experts",
          "Company generates $5.6M annual revenue as of 2024"
        ],
        "li": "https://www.linkedin.com/in/mattsochurek"
      },
      {
        "n": "Ed Wienecke",
        "t": "Co-Founder & President",
        "bg": "Co-founded Finance Factory in 2006 and serves as President. Has been instrumental in growing and leading multiple fintech and real estate investment companies, with several ranked as top 200 fastest growing companies by Inc. Magazine. Developed Finance Factory's process by applying lessons learned from working with entrepreneurs and angel investors at the IRA Network.",
        "hooks": [
          "Led multiple fintech and real estate companies ranked in Inc. Magazine's top 200 fastest growing",
          "Brings experience from working with entrepreneurs and angel investors at the IRA Network",
          "Co-built a firm with A+ BBB rating accredited since 2011",
          "Oversees nationwide operations from Towson, Maryland headquarters"
        ],
        "li": "https://www.linkedin.com/in/ed-wienecke-13550a5"
      }
    ],
    "desc": "Finance Factory is a nationwide boutique small business financing firm headquartered in Towson, Maryland. Founded in 2006, the company operates as a full-service business finance and consulting firm that helps early-stage business owners obtain capital to launch or grow. Finance Factory acts as an online marketplace connecting business owners to a network of lending partners, offering startup funding, personal loans, unsecured business loans, retirement funding (ROBS), real estate investment financing, equipment financing and leasing, SBA loans, merchant cash advances, franchise funding, and acquisition funding. The company has established over $1 billion in funding for entrepreneurs nationwide, maintains an A+ BBB rating (accredited since 2011), and is ranked as one of LendingTree's top startup funding experts. Annual revenue reached $5.6M in 2024 with approximately 11 employees across operations in North America and Asia.",
    "news": [
      {
        "h": "Finance Factory delivers small business funding solutions with $1B total funding milestone",
        "s": "PR Newswire",
        "d": "2016"
      },
      {
        "h": "Company maintains A+ BBB rating and LendingTree top startup funding expert ranking",
        "s": "BBB / LendingTree",
        "d": "2025"
      },
      {
        "h": "Finance Factory reaches $5.6M annual revenue with global team across two continents",
        "s": "ZoomInfo",
        "d": "2024"
      }
    ],
    "location": "Towson, MD",
    "full_address": "600 Fairmount Ave, Ste 206, Towson, MD 21286",
    "website": "financefactory.com",
    "employees": "11",
    "category": "iso"
  }
]
