[
  {
    "id": 1371,
    "name": "QuickFi",
    "leaders": [
      {
        "n": "Bill Verhelle",
        "t": "Founder & CEO",
        "bg": "Founded Innovation Finance USA LLC (QuickFi) in 2018 after co-founding First American Equipment Finance in 1996, which he led as CEO until 2015 and is now part of Royal Bank of Canada. Holds a JD from Cornell Law School (1998), MBA from UCLA Anderson (1992), and a Bachelor's from University of Michigan. Named one of the 10 Best CEOs of 2020 by IndustryEra. Based in Naples, FL. Built QuickFi into the industry's first B2B embedded lending platform powered by agentic AI, serving banks and global OEMs in the $1 trillion equipment finance market.",
        "hooks": [
          "*Cornell Law JD + UCLA Anderson MBA",
          "Sold First American Equipment Finance to Royal Bank of Canada",
          "*Named Top 10 CEO of 2020 by IndustryEra",
          "Three consecutive FinTech Breakthrough Awards winner"
        ],
        "li": "https://www.linkedin.com/in/verhelle/"
      },
      {
        "n": "Nate Gibbons",
        "t": "Chief Experience Officer (CXO)",
        "bg": "Co-founder of QuickFi and CLFP (Certified Lease & Finance Professional). Previously VP of Learning and Development at First American Equipment Finance. Winner of the 2023 Cindy Spurdle Award of Excellence. Appeared on Bloomberg Radio's Black Business Beat to discuss QuickFi's mission of transparency in SMB/SME business lending. Based in Fairport, NY. Active speaker at Finovate conferences and industry events.",
        "hooks": [
          "Won 2023 Cindy Spurdle Award of Excellence",
          "Appeared on Bloomberg Radio Black Business Beat",
          "CLFP certified lease and finance professional",
          "First American Equipment Finance veteran"
        ],
        "li": "https://www.linkedin.com/in/nathan-gibbons/"
      }
    ],
    "desc": "QuickFi, created by Innovation Finance USA LLC, is an award-winning AI-powered B2B embedded lending platform for the $1.3 trillion equipment finance industry. Founded in 2018 in Fairport, NY by the former leaders of First American Equipment Finance (now part of Royal Bank of Canada), QuickFi partners with banks and global OEMs to provide SMB borrowers with instant, 100% digital equipment financing at the point of sale. The patented platform incorporates agentic AI, machine learning, and blockchain technology to deliver a 3-minute financing process. QuickFi has won multiple awards including Best Overall LendTech Company (FinTech Breakthrough 2025), two Global BankTech Awards (2025), and the BIG Innovation Award for two consecutive years. Joined the American Fintech Council in January 2026. Approximately 20-26 employees. Great Place to Work certified.",
    "news": [
      {
        "h": "QuickFi joins American Fintech Council to advance responsible embedded lending in equipment finance",
        "s": "American Fintech Council",
        "d": "2026-01-01"
      },
      {
        "h": "QuickFi wins Best Overall LendTech Company at 2025 FinTech Breakthrough Awards for fourth year",
        "s": "FinTech Breakthrough Awards",
        "d": "2025-06-01"
      },
      {
        "h": "QuickFi launches Innovation Lab uniting emerging tech and student talent for equipment finance",
        "s": "Equipment Finance News",
        "d": "2025-03-01"
      },
      {
        "h": "QuickFi wins second consecutive BIG Innovation Award for embedded lending platform",
        "s": "Secured Finance Network",
        "d": "2025-01-15"
      }
    ],
    "location": "Fairport, NY",
    "full_address": "Fairport, NY",
    "website": "https://quickfi.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 1372,
    "name": "Quickpay Funding",
    "leaders": [
      {
        "n": "Juan G. Estrada",
        "t": "Co-Founder & CEO",
        "bg": "Co-founded Quickpay Funding in 2015 and grew the company to fund over $100 million annually in accounts receivable. Serves as President & CEO. Joined the International Factoring Association's Advisory Board. Prior senior-level experience at Heller Financial, UPS Capital, Volvo Financial, DaimlerChrysler Financial Services, Citibank-Banamex USA, and eCapital. Team spans six states and two countries with operations in California, Nevada, Texas, Arizona, Iowa, New York, and Mexico City. Fully bilingual English/Spanish.",
        "hooks": [
          "Joined IFA Advisory Board as CEO",
          "Grew Quickpay to $100M+ annual factoring volume",
          "Senior roles at UPS Capital, Volvo Financial, Citibank-Banamex",
          "Bilingual English/Spanish leader in cross-border factoring"
        ],
        "li": "https://www.linkedin.com/in/juanestrada1/"
      },
      {
        "n": "Veronica Beach",
        "t": "Co-Founder, President & COO",
        "bg": "Co-founded Quickpay Funding in 2015 after spending nearly 25 years in logistics and freight factoring. Promoted to President and COO. Named to ABF Journal's Top Women in Asset-Based Lending. Extensive experience in transportation, factoring, trade finance, and credit services. Fully bilingual English/Spanish management team leader. Recognized for building Quickpay's flexible recourse and non-recourse factoring programs.",
        "hooks": [
          "*Named Top Women in Asset-Based Lending by ABF Journal",
          "25+ years in logistics and freight factoring",
          "Built cross-border Mexico/USA factoring programs"
        ],
        "li": "https://www.linkedin.com/in/veronica-beach-7b6671aa/"
      }
    ],
    "desc": "Quickpay Funding is a top-rated invoice factoring company founded in 2015 and headquartered in San Diego, CA. The company provides fast working capital by turning unpaid invoices into immediate cash, with 24/7 same-day funding, transparent pricing, and no monthly minimums. Quickpay serves diverse industries including transportation, agriculture, oil and gas, fresh produce, marine freight, energy services, staffing, and commercial cleaning. The company offers both recourse and non-recourse factoring, cross-border funding between Mexico and USA, fuel advances, and back-office support. The bilingual (English/Spanish) team spans six states and two countries. Funds over $100 million annually in accounts receivable. Acquired by Culain Capital Management in March 2025 to expand nationwide factoring services. Approximately 20-24 employees.",
    "news": [
      {
        "h": "Culain Capital acquires Quickpay Funding to bolster nationwide factoring with transportation and agricultural expertise",
        "s": "ABF Journal",
        "d": "2025-03-01"
      },
      {
        "h": "Quickpay Funding's Veronica Beach recognized as Top Women in Asset-Based Lending",
        "s": "ABF Journal",
        "d": "2024-06-01"
      },
      {
        "h": "Quickpay Funding CEO Juan Estrada joins International Factoring Association Advisory Board",
        "s": "IFA",
        "d": "2024-01-01"
      }
    ],
    "location": "San Diego, CA",
    "full_address": "8825 Aero Drive, Suite 120, San Diego, CA 92123",
    "website": "https://quickpayfunding.com",
    "employees": 22,
    "category": "funder"
  },
  {
    "id": 1373,
    "name": "Quicksilver Capital",
    "leaders": [
      {
        "n": "Michael Puderbeutel",
        "t": "CEO",
        "bg": "CEO of Quicksilver Capital, a small business financing company founded in 2007 in Valley Stream, NY. Under his leadership, Quicksilver has provided over $350 million in working capital solutions to more than 18,000 businesses. Secured a $15 million credit facility from a New York-based private investment firm in 2018 to expand funding capabilities. Also associated with Parkstone Capital LLC as CEO. Over 30 years of experience in financing, sales, and merchant services.",
        "hooks": [
          "Funded $350M+ across 18,000+ businesses",
          "Secured $15M credit facility in 2018",
          "30+ years in financing and merchant services",
          "Also leads Parkstone Capital LLC"
        ],
        "li": "https://www.linkedin.com/in/michael-puderbeutel-14210220"
      }
    ],
    "desc": "Quicksilver Capital is a privately held alternative business funding company founded in 2007 and headquartered in Valley Stream, New York. The company provides working capital solutions primarily through merchant cash advances to small and mid-sized businesses that may not qualify for traditional bank financing. Funding ranges from $10,000 to $250,000 with same-day access to capital. Since founding, Quicksilver has provided more than $350 million in working capital to over 18,000 businesses. The company secured a $15 million credit facility in 2018 from a New York-based private investment firm to expand capabilities. Quicksilver's team has more than 30 years of combined experience in financing, sales, and merchant services. Approximately 11-50 employees.",
    "news": [
      {
        "h": "Quicksilver Capital secures $15 million credit facility from New York private investment firm",
        "s": "deBanked",
        "d": "2018-03-01"
      },
      {
        "h": "Quicksilver Capital surpasses $350 million in total working capital provided to small businesses",
        "s": "Quicksilver Capital",
        "d": "2023-01-01"
      }
    ],
    "location": "Valley Stream, NY",
    "full_address": "181 S Franklin Ave, Suite 300, Valley Stream, NY 11581",
    "website": "https://www.quicksilvercap.com",
    "employees": 30,
    "category": "funder"
  },
  {
    "id": 1374,
    "name": "Qwil",
    "leaders": [
      {
        "n": "Johnny Reinsch",
        "t": "Co-Founder & CEO",
        "bg": "Co-founded Qwil in 2015 after nearly defaulting on his mortgage in 2014 while freelancing when a client didn't pay on time. That personal experience drove him to create a platform enabling freelancers and contractors to get paid early. Led Qwil to raise $24.4 million in equity and $200 million in debt from investors including Jefferies Financial Group. Advanced more than $150 million in pay through the platform. Guided the company through acquisition by LSQ in May 2022, continuing the mission under LSQ's working capital finance umbrella.",
        "hooks": [
          "Personal mortgage crisis inspired founding Qwil",
          "Raised $224M total ($24.4M equity + $200M debt)",
          "Advanced $150M+ in early payments to freelancers",
          "Led Qwil through LSQ acquisition in 2022"
        ],
        "li": "https://www.linkedin.com/in/johnnyreinsch/"
      },
      {
        "n": "Trevor Branon",
        "t": "Co-Founder & Former President",
        "bg": "Co-founded Qwil in September 2015 and served as President until April 2021. Graduated from the College of William & Mary with a degree in Finance and Economics. Fintech executive, entrepreneur, and dealmaker with 15+ years of experience. Now operates as an independent fintech advisor through Sansa Advisors.",
        "hooks": [
          "College of William & Mary finance graduate",
          "15+ years fintech executive experience",
          "Now runs Sansa Advisors independently"
        ],
        "li": "https://www.linkedin.com/in/trevorbranon/"
      },
      {
        "n": "Paul Tiplady",
        "t": "Co-Founder & CTO",
        "bg": "Co-founded Qwil in 2015 as Chief Technology Officer. Built the platform's embedded finance technology that captures payment data proving completed work and enables same-day payments for a flat fee. Developed the alternative data underwriting system that bypasses traditional credit scores using payment information and transaction data.",
        "hooks": [
          "Built Qwil's alternative data underwriting engine",
          "Architected embedded finance platform for staffing market"
        ]
      }
    ],
    "desc": "Qwil (now Qwil Powered by LSQ) is a San Francisco-based fintech founded in 2015 that provides early payment and liquidity solutions for freelancers, contractors, and the contingent staffing market. The company works with on-demand and freelancer marketplaces to enable workers to access payments before invoices are due, charging a flat fee (e.g., 1%) with no interest rates or late fees. Qwil uses alternative data rather than traditional credit scores for underwriting. The platform has advanced more than $150 million in early payments with nearly half of customers becoming repeat users. Raised $24.4 million in equity from investors including PeakSpan Capital and $200 million in debt from Jefferies Financial Group. Acquired by LSQ in May 2022 to serve the contingent staffing market with combined embedded finance and working capital capabilities. Approximately 28 employees. Headquarters at 599 3rd St, Suite 210, San Francisco.",
    "news": [
      {
        "h": "LSQ acquires AP automation and liquidity solution provider Qwil to better serve contingent staffing market",
        "s": "PR Newswire",
        "d": "2022-05-27"
      },
      {
        "h": "Qwil raises $24.4 million in equity and $200 million in debt from Jefferies and PeakSpan Capital",
        "s": "Yahoo Finance",
        "d": "2019-10-01"
      },
      {
        "h": "Qwil advances $150 million in early payments through its embedded finance platform",
        "s": "PYMNTS.com",
        "d": "2019-10-01"
      }
    ],
    "location": "San Francisco, CA",
    "full_address": "599 3rd St, Suite 210, San Francisco, CA 94107",
    "website": "https://www.lsq.com/qwil/",
    "employees": 28,
    "category": "funder"
  },
  {
    "id": 1375,
    "name": "Radium Two Capital",
    "leaders": [
      {
        "n": "Troy Caruso",
        "t": "Founder & CEO",
        "bg": "Founded Radium2 Capital in 2014 and serves as CEO. Began his professional career in the construction industry before his passion for business and finance led him to venture into alternative lending. Named 2017 Man of the Year by the Cooley's Anemia Foundation for his philanthropic work. Based in Bay Shore, New York. Under his leadership Radium2 has raised $106 million in total funding and provides MCAs ranging from $5,000 to $1,000,000 across industries including fitness, construction, cannabis, hospitality, and restaurants.",
        "hooks": [
          "*Named 2017 Man of the Year by Cooley's Anemia Foundation",
          "Construction industry background before pivoting to MCA",
          "Raised $106M in total funding for Radium2",
          "Specializes in cannabis and hospitality verticals"
        ],
        "li": "https://www.linkedin.com/in/troy-caruso-98851a95/"
      }
    ],
    "desc": "Radium2 Capital is a merchant cash advance company founded in 2014 and headquartered in Bay Shore, New York. The company provides working capital to small and medium-sized businesses nationwide, with funding ranging from $5,000 to $1,000,000. Radium2 specializes in industries including fitness studios, construction, cannabis, hospitality, and restaurants. The company has raised $106 million in total funding across 2 rounds. CEO Troy Caruso transitioned from the construction industry to build Radium2 into a prominent alternative lender. The company emphasizes meticulous and thorough service to merchants seeking quick alternative financing. Approximately 30-69 employees.",
    "news": [
      {
        "h": "Radium2 Capital surpasses $106 million in total funding raised for MCA operations",
        "s": "PitchBook",
        "d": "2023-01-01"
      },
      {
        "h": "CEO Troy Caruso named 2017 Man of the Year by Cooley's Anemia Foundation",
        "s": "Cooley's Anemia Foundation",
        "d": "2017-12-01"
      }
    ],
    "location": "Bay Shore, NY",
    "full_address": "28 Garfield Ave, Bay Shore, NY 11706",
    "website": "https://www.radiumtwocapital.com",
    "employees": 50,
    "category": "funder"
  },
  {
    "id": 1376,
    "name": "RAIS Financial",
    "leaders": [
      {
        "n": "Donald Ainsworth",
        "t": "Co-Founder",
        "bg": "Co-founded RAIS Financial and RAIS Together, a peer-to-peer microfinance platform for social impact and financial empowerment. Based in Washington, DC. RAIS Together bridges the gap between impact investors and underserved communities by providing an accessible, user-friendly, and secure environment for facilitating microloans and other financial products. The platform targets artisans, entrepreneurs, and smallholder farmers worldwide.",
        "hooks": [
          "Building P2P microfinance for underserved communities",
          "Based in Washington DC social impact fintech space",
          "Connecting impact investors with artisans and smallholder farmers"
        ]
      }
    ],
    "desc": "RAIS Financial (operating as RAIS Together) is a peer-to-peer lending marketplace for business loans, founded in 2021 and based in Washington, DC. The platform connects lenders and donors with artisans, entrepreneurs, and smallholder farmers to provide affordable capital, enable financial inclusion, and generate measurable social impact. RAIS Together expands access to wealth-generating solutions for underserved populations through a mobile-accessible interface where impact investors can participate in microloans without extensive financial expertise. The platform facilitates micro wealth-generating products to disadvantaged individuals typically underserved by traditional financial institutions. Unfunded — no institutional or angel investors on record. Small team, fewer than 10 employees.",
    "news": [
      {
        "h": "RAIS Together launches P2P platform for social impact investing and microfinance",
        "s": "MindPath Tech / RAIS",
        "d": "2022-01-01"
      }
    ],
    "location": "Washington, DC",
    "full_address": "Washington, DC",
    "website": "https://www.raistogether.com",
    "employees": 5,
    "category": "marketplace"
  },
  {
    "id": 1377,
    "name": "Ramay Capital Finance",
    "leaders": [
      {
        "n": "Juan F. Ramirez Arguello",
        "t": "Founder & CEO",
        "bg": "Founded Ramay Capital Finance LLC in Davie, Florida. Serves as CEO leading the company's diverse small business funding solutions including equipment financing, working capital, startup financing, SBA loans, factoring, and real estate investment loans. Offers funding from $4,000 to $2 million with both secured and unsecured options, typically funded within 2 days. Runs a lean team with both English and Spanish-speaking capability serving businesses across the United States.",
        "hooks": [
          "Offers startup financing — rare among alternative funders",
          "Bilingual English/Spanish funding operation",
          "Covers $4K-$2M range including SBA and equipment finance"
        ],
        "li": "https://www.linkedin.com/in/juan-f-ramirez-a-ceo-founder-2729491b4/"
      }
    ],
    "desc": "Ramay Capital Finance (RCF) is a small business lending company founded in Davie, Florida, providing a diverse array of funding solutions for small businesses across the United States. Products include equipment financing and leasing, working capital and cash advance (bridge funding), startup financing, business loans for renovations, lines of credit, SBA loans, factoring, inventory financing, credit repair solutions, and business loans for real estate investment properties. Funding ranges from $4,000 to $2 million with no application fee, quick 2-day processing, both secured and unsecured options, and flexible collateral requirements. The company operates primarily as a loan broker connecting businesses with its network of national underwriters. Small team of approximately 3-10 employees.",
    "news": [
      {
        "h": "Ramay Capital Finance expands small business funding solutions in South Florida market",
        "s": "Ramay Capital",
        "d": "2023-01-01"
      }
    ],
    "location": "Davie, FL",
    "full_address": "6511 Nova Drive, Davie, FL",
    "website": "https://www.ramaycapital.com",
    "employees": 5,
    "category": "iso"
  },
  {
    "id": 1378,
    "name": "Rapidoo",
    "leaders": [
      {
        "n": "Caspar Gerleve",
        "t": "Co-Founder & CEO",
        "bg": "Co-founded Rapidoo in July 2016 in Sao Paulo, Brazil to provide fast, transparent invoice factoring to small and medium businesses. Led the company through its seed funding from FundersClub and Canary, and its acquisition by One7 in July 2020 for R$50 million. Built an online invoice discounting platform targeting companies with revenues up to R$150,000/month, advancing 85% of invoice value immediately with the remaining 15% retained until full payment.",
        "hooks": [
          "German-Brazilian fintech entrepreneur",
          "Raised from FundersClub and Canary for Brazilian SME factoring",
          "Led Rapidoo through R$50M acquisition by One7 in 2020"
        ]
      },
      {
        "n": "Pedro de Cicco",
        "t": "Co-Founder & COO",
        "bg": "Co-founded Rapidoo in 2016. Served as Chief Operating Officer overseeing the operational side of the invoice discounting platform. Helped build the company's fully online process for discounting commercial drafts for micro and small enterprises in Brazil.",
        "hooks": [
          "Built operations for online invoice factoring in Brazil",
          "Rapidoo co-founder focused on MSE market"
        ]
      }
    ],
    "desc": "Rapidoo is a Brazilian fintech founded in July 2016 in Sao Paulo that provides an online invoice discounting platform for small and medium enterprises (SMEs). The platform enables companies with revenues up to R$150,000/month to anticipate invoices of up to 90 days, receiving 85% of the value immediately with the remaining 15% retained until full payment. Co-founded by Caspar Gerleve, Pedro de Cicco, Thiago Frigo, and Raphael Monteiro. Raised seed funding from FundersClub and Canary. Acquired by One7 in July 2020 for R$50 million (~US$9.3 million), with One7 injecting additional capital to expand financing operations nationwide across Brazil. The startup continues operating independently under the One7 umbrella. Fewer than 10 employees. Based in Tatui, Sao Paulo state.",
    "news": [
      {
        "h": "One7 acquires fintech Rapidoo for R$50 million to expand SME financing across Brazil",
        "s": "PYMNTS.com / Contxto",
        "d": "2020-07-08"
      },
      {
        "h": "Rapidoo raises seed funding from FundersClub and Canary for Brazilian invoice factoring platform",
        "s": "Latin America Technology Review",
        "d": "2018-01-01"
      }
    ],
    "location": "Sao Paulo, Brazil",
    "full_address": "345 Rua Dr. Prudente De Moraes, Tatui, Sao Paulo, 18270-280, Brazil",
    "website": "https://rapidoo.com.br",
    "employees": 8,
    "category": "funder"
  },
  {
    "id": 1379,
    "name": "RBS Funding",
    "leaders": [
      {
        "n": "Eric Gokstein",
        "t": "President",
        "bg": "President of RBS Funding, a merchant cash advance and business funding company based in New York. Holds a Bachelor's Degree in Applied Mathematics and Statistics with a focus on Actuarial Science from Stony Brook University (2006-2010). Leads the company's operations providing same-day working capital to small businesses through MCA products and flexible loan options.",
        "hooks": [
          "Stony Brook University applied math and actuarial science background",
          "Leads same-day MCA funding operations in New York"
        ],
        "li": "https://www.linkedin.com/in/eric-gokstein-21009459"
      }
    ],
    "desc": "RBS Funding (RBS Funding Group Inc.) is a merchant cash advance provider headquartered in New York, with offices at 244 5th Ave, New York City. The company specializes in providing fast, same-day working capital to small businesses through merchant cash advance products and flexible loan options. RBS Funding emphasizes hassle-free funding solutions designed to help businesses grow, with a streamlined application and approval process. The company also operates an ISO partnership program. Led by President Eric Gokstein. Small to mid-sized team.",
    "news": [
      {
        "h": "RBS Funding expands same-day MCA funding operations from New York headquarters",
        "s": "RBS Funding",
        "d": "2023-01-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "244 5th Ave, New York, NY 10001",
    "website": "https://rbsfunding.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1380,
    "name": "Reagan Commercial Capital",
    "leaders": [
      {
        "n": "Reggie Ficklin",
        "t": "Founder",
        "bg": "Founded Reagan Commercial Capital LLC in 2019 in Miami, Florida. Earned his degree in business finance while working as a field inspector for commercial and residential properties. Transitioned into commercial lending after seeing many deals fail at the financing stage, using his property inspection relationships to build a financial network. Now serves as Regional Business Finance, Business Credit, and Real Estate Investment Funding Consultant. Specializes in helping businesses access capital even when denied by traditional lenders.",
        "hooks": [
          "Property inspector turned commercial lending founder",
          "Specializes in funding businesses denied by traditional lenders",
          "Built lending network from real estate inspection relationships"
        ],
        "li": "https://www.linkedin.com/in/reggie-ficklin-3b052a82/"
      }
    ],
    "desc": "Reagan Commercial Capital is a Florida-based loan brokerage founded in 2019 by Reggie Ficklin, headquartered in Miami. The firm works with businesses serving mid-sized and large markets in Florida and across the country, specializing in helping businesses access commercial capital even when denied elsewhere. Services include bridge loans, equipment financing, working capital loans, commercial real estate financing (acquisition, development, refinancing), SBA loans, flexible lines of credit, commercial fix-and-flip funding, and long-term rental property funding. The company also connects clients with equity investors and venture capital. Reagan Commercial Capital operates as a broker connecting businesses with its network of lenders and investors. Very small operation with approximately 1-2 employees.",
    "news": [
      {
        "h": "Reagan Commercial Capital expands horizons with comprehensive real estate investment funding solutions",
        "s": "Digital Journal",
        "d": "2024-01-01"
      }
    ],
    "location": "Miami, FL",
    "full_address": "66 West Flagler Street, Suite 900, Miami, FL 33130",
    "website": "https://reagancommercialcapital.com",
    "employees": 1,
    "category": "iso"
  }
]
