[
  {
    "id": 1305,
    "name": "Masada Funding",
    "leaders": [
      {
        "n": "Mendy Raskin",
        "t": "Head of Operations",
        "bg": "Serves as Head of Operations at Masada Management, which oversees Masada Funding. Also Co-Founder & COO of Bivid, a separate venture. Previously associated with Raskin Risers LLC. Active in the New York-area business community with experience across operations management and business development in financial services.",
        "hooks": [
          "Co-founded Bivid as a separate venture alongside Masada operations",
          "Manages operations for an MCA funder that requires no minimum credit score or broker fees",
          "Masada Funding has assisted thousands of businesses since launching in 2021"
        ],
        "li": "https://www.linkedin.com/in/mendy-raskin-8aa17b53/"
      },
      {
        "n": "Dolly Piddock",
        "t": "Team Member",
        "bg": "Associated with Masada Funding LLC based on LinkedIn profile. Part of the team at the Wilmington, Delaware-based MCA funding platform that provides quick access to capital for small businesses without requiring minimum credit scores.",
        "hooks": [
          "Part of a growing MCA platform that launched in 2021 and scaled rapidly",
          "Works with a funder that can wire funds in as little as one business day"
        ],
        "li": "https://www.linkedin.com/in/dolly-piddock-870925220/"
      }
    ],
    "desc": "Masada Funding is a merchant cash advance funder founded in 2021, headquartered in Wilmington, Delaware. The company provides working capital to small businesses without requiring a minimum credit score or broker fees. Their streamlined process requires only 3 months of business bank statements and a completed application, with funds wired in as little as one business day. Since its founding, Masada Funding has assisted thousands of businesses in procuring working capital. The company operates as a direct funder in the MCA space, serving businesses that may not qualify for traditional bank financing.",
    "news": [
      {
        "h": "Masada Funding continues expanding MCA operations from Wilmington, DE headquarters",
        "s": "masadafunding.com",
        "d": "2025"
      },
      {
        "h": "Masada Funding listed among revenue-based financing companies on Funder Intel",
        "s": "funderintel.com",
        "d": "2025"
      }
    ],
    "location": "Wilmington, DE",
    "full_address": "1811 Silverside Road, Wilmington, DE 19810",
    "website": "https://www.masadafunding.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 1306,
    "name": "Max Advance Merchant Services",
    "leaders": [
      {
        "n": "Michael Puderbeutel",
        "t": "CEO",
        "bg": "CEO of Max Advance LLC since founding in 2007. Also serves as CEO of Parkstone Capital LLC, a commercial real estate firm. Brings extensive experience in specialty finance including factoring, asset-based lending, and small business lending. Based in the New York metropolitan area.",
        "hooks": [
          "Built Max Advance from startup in 2007 to an established MCA funder over 18+ years",
          "Runs dual ventures spanning MCA funding and commercial real estate via Parkstone Capital",
          "Management team boasts 30+ years of combined payment industry expertise"
        ],
        "li": "https://www.linkedin.com/in/michael-puderbeutel/"
      },
      {
        "n": "Ivan Quezada",
        "t": "VP of Business Development",
        "bg": "Serves as Vice President of Business Development at Max Advance LLC in Brooklyn, NY. Responsible for growing the company's ISO and broker relationships and expanding the funding portfolio for small businesses.",
        "hooks": [
          "Leads business development for a Brooklyn-based MCA funder with 18+ years of operations",
          "Drives ISO relationship growth at Max Advance's Brooklyn headquarters"
        ],
        "li": "https://www.linkedin.com/in/ivan-quezada-2a485233/"
      }
    ],
    "desc": "Max Advance LLC is a privately held merchant cash advance funder founded in 2007, headquartered in Brooklyn, New York. The company offers a full line of small business financing services including merchant cash advance, small business financing, and business working capital. The management team brings 30+ years of combined industry expertise across financing, sales, payment processing, and credit card marketing. Max Advance generates approximately $3.8 million in revenue and serves small businesses that may not qualify for traditional bank lending.",
    "news": [
      {
        "h": "Max Advance continues Brooklyn-based MCA operations serving small businesses nationwide",
        "s": "maxadvance.com",
        "d": "2025"
      },
      {
        "h": "Max Advance maintains BBB business profile as factoring service provider",
        "s": "bbb.org",
        "d": "2025"
      }
    ],
    "location": "Brooklyn, NY",
    "full_address": "4208 18th Ave, Brooklyn, NY 11218",
    "website": "https://www.maxadvance.com",
    "employees": 12,
    "category": "funder"
  },
  {
    "id": 1307,
    "name": "Meged Funding",
    "leaders": [
      {
        "n": "Moshe Lud",
        "t": "Co-Founder & Manager",
        "bg": "Co-founded Meged Funding Group in 2021 in Suffern, New York. Serves as Manager handling operations and authorized representative in legal matters. Part of a founding team of passionate financing experts who built Meged into a major MCA player known for competitive rates, extended terms, and funding amounts up to $5 million per file.",
        "hooks": [
          "Co-founded Meged Funding which grew to fund up to $5 million per deal since 2021",
          "Built an MCA funder with a 98% approval rate across industries",
          "Operates with a no-backdoor policy — never remarkets ISO deals to competitors"
        ],
        "li": "https://www.linkedin.com/in/moshe-lud-0b5110236/"
      },
      {
        "n": "Abe Siegel",
        "t": "ISO Relations Representative",
        "bg": "Works with Meged Funding Group handling ISO (Independent Sales Organization) relationships and deal flow. Active on industry platforms like Funder Intel promoting Meged's competitive offerings to brokers and ISOs in the merchant cash advance space.",
        "hooks": [
          "Active voice for Meged Funding across industry forums and communities",
          "Promotes Meged's aggressive terms: max $5M funding, 35-week terms, all US states"
        ],
        "li": ""
      }
    ],
    "desc": "Meged Funding Group Corp is a merchant cash advance funder incorporated in January 2021, headquartered in Suffern, New York. The company has rapidly become a major player in the MCA industry, known for offering competitive rates, extended terms up to 35 weeks, and funding amounts of up to $5 million per file. Meged specializes in B-C paper deals with aggressive terms for D paper as well. They fund nearly all industries and all US states with a 98% approval rate. The company differentiates itself by never backdooring or remarketing ISO deals, and offers lower fees and longer terms to help ISOs close more deals.",
    "news": [
      {
        "h": "Meged Funding Group named among top MCA funders for competitive B-C paper terms",
        "s": "funderintel.com",
        "d": "2025"
      },
      {
        "h": "Meged Funding Group files H-1B LCA for financial analyst position",
        "s": "h1bgrader.com",
        "d": "2024"
      },
      {
        "h": "Meged Funding active in court filings related to MCA agreement enforcement",
        "s": "trellis.law",
        "d": "2024"
      }
    ],
    "location": "Suffern, NY",
    "full_address": "12 Zeck Ct, Suffern, NY 10901",
    "website": "https://www.megedfunding.com",
    "employees": 20,
    "category": "funder"
  },
  {
    "id": 1308,
    "name": "Merchant Cash HQ",
    "leaders": [],
    "desc": "Merchant Cash HQ is a family-owned alternative funding company that has been providing capital solutions to small businesses for over a decade. The company serves as the preferred provider of alternative funding solutions, having provided service to thousands of small business partners throughout the United States. They work with businesses in all industries including restaurants, automotive, manufacturers, florists, wholesalers, HVAC services, and franchises. Most deals are funded in 48 hours or less, with businesses qualifying for up to $250,000 in 24 hours. Repayment terms range from 4 to 18 months with no prepayment penalties. The company does not shy away from harder deals including low credit scores, bankruptcies, or liens.",
    "news": [
      {
        "h": "Merchant Cash HQ continues decade-long operations as family-owned alternative funder",
        "s": "merchantcashhq.com",
        "d": "2025"
      },
      {
        "h": "Merchant Cash HQ offers same-day qualifications up to $250K for small businesses",
        "s": "merchantcashhq.com",
        "d": "2025"
      }
    ],
    "location": "United States",
    "full_address": "",
    "website": "https://merchantcashhq.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1309,
    "name": "Merchant Marketplace",
    "leaders": [
      {
        "n": "Adam Schwartz",
        "t": "CEO",
        "bg": "CEO and co-creator of The Merchant Marketplace with over seven years of experience building fintech platforms. Self-funded over $10 million of his own capital over 7 years in technology. Previously served as both CEO and CTO of Velocity Group USA, which funded over $200 million to business owners across the USA in a four-year span. Built CRMs, underwriting models, investor portals, syndication platforms, phone systems, and mobile apps for both Google and Apple.",
        "hooks": [
          "Previously funded over $200M as CEO/CTO of Velocity Group USA in just four years",
          "Self-funded $10M+ into building fintech infrastructure before launching Merchant Marketplace",
          "Partnered with Shark Tank's Kevin Harrington to launch the first true fintech P2P MCA platform"
        ],
        "li": "https://www.linkedin.com/in/adamsschwartz/"
      },
      {
        "n": "Kevin Harrington",
        "t": "Co-Founder & Strategic Partner",
        "bg": "Original Shark from the hit TV show Shark Tank. Pioneer of the infomercial and As Seen on TV industry. Prolific investor and entrepreneur with decades of experience in building consumer and business brands. Joined The Merchant Marketplace as a strategic partner to bring credibility and visibility to the MCA investment platform.",
        "hooks": [
          "*Original Shark from Shark Tank — brings massive brand recognition to MCA marketplace",
          "Pioneer of the infomercial industry now backing fintech MCA investment platform",
          "Lends his brand to attract accredited investors starting with just $10K minimum"
        ],
        "li": "https://www.linkedin.com/in/kevinharrington/"
      },
      {
        "n": "Paul Boxer",
        "t": "COO & CRO",
        "bg": "Serves as Chief Operating Officer and Chief Revenue Officer of The Merchant Marketplace. Brings operational and revenue leadership experience to the fintech P2P funding platform. Works alongside CEO Adam Schwartz to manage platform operations, investor relations, and business development.",
        "hooks": [
          "Dual COO/CRO role overseeing both operations and revenue for the MCA marketplace",
          "Helps manage a platform fueling growth of over 2,000 businesses"
        ],
        "li": ""
      }
    ],
    "desc": "The Merchant Marketplace is a fintech-driven peer-to-peer funding platform headquartered in Uniondale, New York, that modernizes investing in merchant cash advance deals. Co-founded by Adam Schwartz (CEO) and Kevin Harrington (Original Shark from Shark Tank), the platform launched in May 2023 and serves three stakeholders: small businesses seeking capital, ISO brokers connecting deals, and accredited investors deploying capital for high-yield returns. The platform combines automation, real-time data, and AI underwriting to give investors control and transparency. Investors can start with as little as $10,000 and begin receiving returns within 5 business days of deployment. The platform has fueled the growth of over 2,000 businesses.",
    "news": [
      {
        "h": "Kevin Harrington's Merchant Marketplace launches first true fintech P2P funding platform in MCA space",
        "s": "Yahoo Finance",
        "d": "2023"
      },
      {
        "h": "The Merchant Marketplace announces new launch with industry powerhouse executive",
        "s": "deBanked",
        "d": "2022-09"
      },
      {
        "h": "Merchant Marketplace positions as revolutionary force in small business funding transformation",
        "s": "CEO Weekly",
        "d": "2024"
      }
    ],
    "location": "Uniondale, NY",
    "full_address": "360 RXR Plaza, Uniondale, NY 11556",
    "website": "https://merchantmarketplace.com",
    "employees": 8,
    "category": "marketplace"
  },
  {
    "id": 1310,
    "name": "Merchant Solutions Group",
    "leaders": [
      {
        "n": "Billy Morrissey",
        "t": "President & CEO, Founder",
        "bg": "Founded Merchant Solutions Group in 2007 after a career spanning two decades in real estate and as a stockbroker. Built MSG into one of the nation's leading providers of merchant cash advances, growing to over 60 employees with offices in Lower Manhattan and Chicago. Also launched Liberty Merchant Group as a separate venture to expand MCA business. Under his leadership, MSG has provided more than 5,000 businesses in all 50 states with nearly $200 million in working capital.",
        "hooks": [
          "Pivoted from a 20-year real estate and stockbroker career to found a leading MCA company",
          "Grew MSG from startup to $200M+ funded across 5,000+ businesses in all 50 states",
          "Expanded with two offices (Lower Manhattan and Chicago) and 60+ employees",
          "Also launched Liberty Merchant Group as a parallel MCA growth vehicle"
        ],
        "li": "https://www.linkedin.com/in/billy-morrissey-merchant-solutions/"
      }
    ],
    "desc": "Merchant Solutions Group (MSG) is one of the nation's leading providers of merchant cash advances to small and mid-sized businesses, founded in 2007 by Billy Morrissey. Headquartered at 11 Broadway in Lower Manhattan with an additional office in Chicago, MSG has grown to over 60 employees including junior brokers, brokers, and administrative staff. Since inception, the company has provided more than 5,000 businesses in all 50 states with nearly $200 million in working capital. Morrissey also launched Liberty Merchant Group to expand the MCA business. MSG can provide funding in as little as 3 days with a simple process and dedicated customer service.",
    "news": [
      {
        "h": "Merchant Solutions Group CEO Billy Morrissey launches Liberty Merchant Group to grow MCA business",
        "s": "PR Newswire",
        "d": "2014"
      },
      {
        "h": "Founder of Merchant Solutions Group joins World Business Lenders",
        "s": "PR Newswire",
        "d": "2015"
      },
      {
        "h": "Merchant Solutions Group expands New York City offices at 11 Broadway",
        "s": "merchantsolutionsgroup.com",
        "d": "2024"
      }
    ],
    "location": "New York, NY",
    "full_address": "11 Broadway, Suite 1004, New York, NY 10004",
    "website": "https://www.merchantsolutionsgroup.com",
    "employees": 35,
    "category": "funder"
  },
  {
    "id": 1311,
    "name": "Merit Business Funding",
    "leaders": [
      {
        "n": "William Bromley",
        "t": "Founder",
        "bg": "Founded Merit Business Funding with over 40 years of experience in institutional banking, having done everything from starting and operating to acquiring and merging banks. The idea for Merit came from his deep understanding of banking gaps in the revenue advance space. Partnered with Dave Shollock to launch the company, funding their first deal on November 22, 2022.",
        "hooks": [
          "40+ years in institutional banking — started, operated, acquired, and merged banks",
          "Founded Merit to bridge the gap between traditional banking and revenue-based financing",
          "Merit operates under bank ownership, exempt from September 1 MCA disclosure regulations"
        ],
        "li": ""
      },
      {
        "n": "Dave Shollock",
        "t": "Director of Business Development",
        "bg": "Served as Director of Business Development at Merit Business Funding from June 2022 to May 2025. Based in Philadelphia, PA. Previously held the Director of Business Development role at Samson Funding and returned to Samson after his tenure at Merit. Brought sales and ISO relationship expertise to help build Merit from its first funded deal in November 2022.",
        "hooks": [
          "Helped build Merit Business Funding from first deal to established revenue advance company",
          "Philadelphia-based BD leader with deep ISO relationship network",
          "Featured in Onyx IQ's Executive Interview Series discussing Merit's growth strategy"
        ],
        "li": "https://www.linkedin.com/in/daveshollock/"
      }
    ],
    "desc": "Merit Business Funding is a revenue advance company founded in 2022, located in Miramar, Florida. The company provides working capital to small and medium-sized businesses on a short-term basis (3-12 months) to fuel growth and success. Founded by William Bromley, who brings over 40 years of institutional banking experience, Merit differentiates itself through its TurboFund Revenue Advance product tailored to fast-growing companies. Revenue advances are structured with daily remittances designed not to stress customer cash flow. Companies may receive funds within one business day, with no personal guarantees and no prepayment penalties. Merit operates under bank ownership, which exempts it from certain MCA disclosure regulations.",
    "news": [
      {
        "h": "Merit Business Funding's Dave Shollock featured in Onyx IQ Executive Interview Series",
        "s": "onyxiq.com",
        "d": "2024"
      },
      {
        "h": "Merit Business Funding expands team and ISO partnerships from Miramar, FL headquarters",
        "s": "linkedin.com",
        "d": "2024"
      }
    ],
    "location": "Miramar, FL",
    "full_address": "Miramar, FL",
    "website": "https://www.meritbusinessfunding.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1312,
    "name": "Mint Funding",
    "leaders": [
      {
        "n": "Zalmen Preizler",
        "t": "CEO",
        "bg": "Chief Executive Officer and founder of Mint Funding Inc., based in Monroe, New York. Incorporated the company in December 2021 to operate as a direct funder in the merchant cash advance space. Leads the company's funding operations and ISO relationship management from the Monroe, NY headquarters.",
        "hooks": [
          "Founded Mint Funding as a direct funder providing full access to ISO shops",
          "Runs a Monroe, NY-based MCA funder serving businesses with $25K+ monthly revenue"
        ],
        "li": ""
      },
      {
        "n": "Max P",
        "t": "Funding Specialist",
        "bg": "Works at Mint Funding handling direct funding and merchant cash advance operations. Based in the New York City metropolitan area. Contact point for the company (Max@mintfunding.com). Active in processing MCA applications and managing funder-ISO relationships.",
        "hooks": [
          "Key contact for Mint Funding's direct funder operations",
          "Based in NYC metro area managing MCA deal flow for Monroe, NY-based funder"
        ],
        "li": "https://www.linkedin.com/in/max-p-0253a519a/"
      }
    ],
    "desc": "Mint Funding Inc. is a direct merchant cash advance funder incorporated in December 2021, headquartered in Monroe, New York. The company provides ISO shops with full access to their range of funding services, handling the funding process while ISOs manage the sales pipeline. Mint Funding offers short-term working capital (3-12 months) to businesses across all industries that have been in operation for at least 1 year and generate at least $25,000 in monthly revenue. The application process requires only identification documents, recent bank statements, and cash flow information, with a 5-stage process: Application, Analysis, Funding, Repayment, and Renewal.",
    "news": [
      {
        "h": "Mint Funding continues direct MCA funding operations from Monroe, NY headquarters",
        "s": "mintfunding.com",
        "d": "2025"
      },
      {
        "h": "Mint Funding listed among revenue-based financing companies on industry directories",
        "s": "funderintel.com",
        "d": "2025"
      }
    ],
    "location": "Monroe, NY",
    "full_address": "105 Bakertown Rd, Monroe, NY 10950",
    "website": "https://mintfunding.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1313,
    "name": "MNR Capital Group",
    "leaders": [
      {
        "n": "Jamie Azoulay",
        "t": "Managing Director",
        "bg": "Managing Director at MNR Capital Group with experience in MCA funding and business financing. Previously held a role at Red Sea Funding before joining MNR Capital Group. Based in the United States, leads business development and manages ISO relationships for the company. Active on LinkedIn promoting MNR's funding capabilities and broker programs.",
        "hooks": [
          "Leads a funder with 30 years of combined management team experience in business financing",
          "Pivoted from Red Sea Funding to build MNR Capital Group's deal flow",
          "Offers ISOs up to 18 points when 3 deals fund in a month"
        ],
        "li": "https://www.linkedin.com/in/jamie-azoulay-a0b30379/"
      }
    ],
    "desc": "MNR Capital Group is a merchant cash advance funder headquartered in St. Petersburg, Florida (with Miami operations), providing working capital to small and medium-sized businesses for over 10 years. The company's seasoned management team brings a combined 30 years of experience in business financing. MNR Capital funds deals across nearly every industry with personalized support and streamlined, efficient funding processes. The company is known in the ISO community for aggressive commission structures, offering up to 18 points when brokers fund 3 deals in a month. MNR Capital employs approximately 7 people and focuses on fast, simple funding for both business owners and ISOs.",
    "news": [
      {
        "h": "MNR Capital Group offers 18-point commission structure for high-volume ISO partners",
        "s": "dailyfunder.com",
        "d": "2024"
      },
      {
        "h": "MNR Capital Group described as honest and aggressive B/C paper funder by industry peers",
        "s": "dailyfunder.com",
        "d": "2024"
      }
    ],
    "location": "St. Petersburg, FL",
    "full_address": "7901 4th St N, #7491, St. Petersburg, FL 33702",
    "website": "https://www.mnrcapitalgroup.com",
    "employees": 7,
    "category": "funder"
  },
  {
    "id": 1314,
    "name": "Momentum Business Capital",
    "leaders": [
      {
        "n": "Sam Greenwald",
        "t": "President & CEO",
        "bg": "President and CEO of Momentum Business Capital, based in Miami Beach, Florida. Has been in the payments space since 1999 and founded the company in 2008. Over the past decade-plus, has led the funding of thousands of businesses with millions of dollars across equipment financing, purchase orders, bridge loans, and merchant cash advances. Built the company into a full-service working capital provider serving businesses in all 50 states.",
        "hooks": [
          "In the payments space since 1999 — over 25 years of industry experience",
          "Founded Momentum Business Capital in 2008 and grew it to serve all 50 states",
          "Achieved a 97% approval rating across all submitted applications"
        ],
        "li": "https://www.linkedin.com/in/momentumbusinesscapital/"
      },
      {
        "n": "Yossi Miller",
        "t": "Chief Operating Officer",
        "bg": "Serves as COO at Momentum Business Capital in Miami Beach, Florida. Manages day-to-day operations of the working capital firm including underwriting, funding processes, and customer service. Works alongside CEO Sam Greenwald to maintain the company's high approval rating and fast funding timelines.",
        "hooks": [
          "COO at a firm with 97% approval rating on submitted applications",
          "Oversees operations for a Miami Beach-based funder covering all 50 states"
        ],
        "li": ""
      }
    ],
    "desc": "Momentum Business Capital is a full-service working capital provider founded in 2008, headquartered in Miami Beach, Florida. The company has funded thousands of businesses with millions of dollars across equipment financing, purchase orders, bridge loans, merchant cash advances, and more. Led by CEO Sam Greenwald, who has been in the payments space since 1999, the company serves businesses of all sizes in all 50 states and every time zone. Momentum offers quick cash up to $150,000 for any use in under 7 days with approvals in 48 hours, requiring no financials, tax returns, or personal guarantees. The company has achieved a 97% approval rating on all submitted applications and can fund amounts from $5,000 to $500,000.",
    "news": [
      {
        "h": "Momentum Business Capital maintains BBB accreditation in Miami Beach",
        "s": "bbb.org",
        "d": "2025"
      },
      {
        "h": "Momentum Business Capital continues nationwide working capital operations from Miami Beach HQ",
        "s": "momentumbusinesscapital.com",
        "d": "2025"
      }
    ],
    "location": "Miami Beach, FL",
    "full_address": "4014 Chase Ave, Suite 212, Miami Beach, FL 33140",
    "website": "https://momentumbusinesscapital.com",
    "employees": 8,
    "category": "funder"
  }
]
