[
  {
    "id": 124,
    "name": "Boost Capital Group",
    "leaders": [
      {
        "n": "Juan Felipe Mejia Llano",
        "t": "CFO",
        "bg": "Serves as Chief Financial Officer at Boost Capital Group, overseeing the financial operations of the MCA and business lending company. Boost Capital Group provides merchant cash advances and business loans with rapid 24-hour funding turnaround times.",
        "hooks": [
          "Boost Capital Group emphasizes speed-to-funding with 24-hour turnaround and 5-minute applications",
          "Operating in the competitive MCA space where regulatory scrutiny is increasing, especially in New York"
        ],
        "li": "https://linkedin.com/company/boost-capital-group-llc"
      }
    ],
    "desc": "Boost Capital Group is a merchant cash advance and business lending company that provides business loans with competitive rates and terms. The company emphasizes speed and simplicity, offering funding within 24 hours through a 5-minute application process. They serve small and medium-sized businesses seeking alternative financing solutions including merchant cash advances and business loans.",
    "news": [
      {
        "h": "MCA Industry Faces Increased Regulatory Scrutiny",
        "s": "Industry News, 2024",
        "d": "The MCA industry continues to face regulatory pressure, particularly in New York where laws have been enacted to protect out-of-state borrowers from confessions of judgment."
      },
      {
        "h": "Alternative Lending Market Growth Continues",
        "s": "Industry Reports, 2025",
        "d": "The alternative business lending market, including MCA providers like Boost Capital Group, continues to grow as small businesses seek faster funding alternatives to traditional bank loans."
      }
    ],
    "location": "New York, NY",
    "full_address": "New York, NY",
    "website": "https://boostcapitalgroup.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 125,
    "name": "Progressive Business Capital",
    "leaders": [
      {
        "n": "Jacqueline M. Slosser",
        "t": "CEO",
        "bg": "CEO of Progressive Business Capital (also operating as Progressive Business Funding), a business funding brokerage established in 2014 in Irvine, California. Under her leadership, the company has maintained an A+ BBB rating and built an extensive network of lending partners to serve small and medium-sized businesses.",
        "hooks": [
          "Progressive Business Capital has maintained an A+ BBB rating since its founding in 2014",
          "The company works with an extensive network of direct lenders to find the best rates for businesses"
        ],
        "li": "https://linkedin.com/company/progressive-business-capital"
      },
      {
        "n": "Richard Brazee",
        "t": "Vice President",
        "bg": "VP at Progressive Business Funding, managing business development and operations. The company specializes in connecting small businesses with the best lenders through its extensive funding network, offering same-day merchant cash advances and business loans.",
        "hooks": [
          "Progressive Business Capital offers same-day funding with a wide variety of lending partners",
          "Based in Orange County's Spectrum Center business district in Irvine, CA"
        ],
        "li": "https://linkedin.com/company/progressive-business-capital"
      }
    ],
    "desc": "Progressive Business Capital (ProBizCap) is a business funding broker founded in 2014, specializing in connecting small businesses with merchant cash advances and business loans. The company works with an extensive network of funding companies and direct lenders to find the best rates for businesses of all types. They offer same-day funding and maintain an A+ BBB rating. Their goal is to help businesses get cash at reasonable rates through both traditional small business loans and alternative financing options.",
    "news": [
      {
        "h": "Progressive Business Capital Maintains A+ BBB Rating",
        "s": "BBB, 2024",
        "d": "Progressive Business Funding continues to maintain its A+ rating with the Better Business Bureau after over a decade of operations in the business funding brokerage space."
      },
      {
        "h": "Alternative Business Lending Brokers See Growing Demand",
        "s": "Industry News, 2025",
        "d": "Business funding brokers like Progressive Business Capital continue to see increased demand as small businesses seek faster alternatives to traditional bank lending."
      }
    ],
    "location": "Irvine, CA",
    "full_address": "300 Spectrum Center Dr, Suite 640, Irvine, CA 92618",
    "website": "https://www.probizcap.com",
    "employees": 20,
    "category": "iso"
  },
  {
    "id": 130,
    "name": "Advantage Capital",
    "leaders": [
      {
        "n": "Steven Stull",
        "t": "President & Founder",
        "bg": "Seasoned venture capitalist and private equity investor with more than 35 years of investment experience. Prior to founding Advantage Capital in 1992, spent nine years as an executive at General American Life Insurance Company where he headed the Securities Division and managed portfolios of publicly and privately traded securities. Directs the firm's investment policy, strategic planning, and fundraising.",
        "hooks": [
          "Under Stull's leadership, Advantage Capital has invested over $4 billion in more than 900 companies since 1992",
          "Ranked second on the St. Louis Business Journal's list of largest VC/PE firms with $1.16 billion under management",
          "Focus on driving capital to underserved communities and impact investing"
        ],
        "li": "https://linkedin.com/in/steven-stull/"
      },
      {
        "n": "Scott Murphy",
        "t": "Managing Director & Chief Investment Officer",
        "bg": "Experienced venture capitalist, entrepreneur, and former US Congressman who represented New York from 2009 to 2011. Previously oversaw the firm's $88 million New York portfolio from 2001-2009. Co-founded three high-tech companies including an online auction company sold to eBay and a website building company sold to iXL. Harvard College graduate and CFA charterholder. Former structured finance associate at Bankers Trust.",
        "hooks": [
          "Rare combination of former US Congressman, tech entrepreneur (company sold to eBay), and venture capitalist",
          "As CIO, oversees Advantage Capital's entire portfolio of 417+ active companies",
          "Former president of the Upstate Venture Association of New York"
        ],
        "li": "https://linkedin.com/in/-scott-murphy/"
      },
      {
        "n": "Sandra M. Moore",
        "t": "Managing Director & Chief Impact Officer",
        "bg": "Leads impact measurement and reporting at Advantage Capital, a growth equity firm focused on high-growth businesses in communities where access to investment capital has historically been limited. Plays a key role in the firm's mission to drive lasting economic development in underserved areas.",
        "hooks": [
          "Advantage Capital published its 2024-2025 Annual Impact Report highlighting investments across underserved communities",
          "The firm invested more than $230 million in 2024, including nearly $14 million in the St. Louis metro area"
        ],
        "li": "https://linkedin.com/company/advantagecapital"
      }
    ],
    "desc": "Advantage Capital is a leading impact investment firm founded in 1992 and headquartered in New Orleans, Louisiana. The firm has invested over $4 billion in more than 900 portfolio companies and projects nationwide, with $1.16 billion currently under management. Advantage Capital specializes in growth equity, lending, and mezzanine debt capital investments focused on driving economic development in underserved communities. The firm invests strategically in job-generating small businesses, affordable housing, and renewable energy solutions, with offices in New Orleans, St. Louis, New York, Austin, Washington D.C., and other cities.",
    "news": [
      {
        "h": "Advantage Capital Ranked #2 on St. Louis Business Journal VC/PE List",
        "s": "St. Louis Business Journal, 2025",
        "d": "Advantage Capital ranked second on the region's largest venture capital and private equity firms list with $1.16 billion under management as of December 2024."
      },
      {
        "h": "Advantage Capital Invested Over $230M in 2024",
        "s": "Advantage Capital, 2024",
        "d": "The firm and its partners invested more than $230 million across the country in 2024, continuing its focus on growth-ready businesses in underserved communities."
      },
      {
        "h": "2024-2025 Annual Impact Report Released",
        "s": "Advantage Capital, 2025",
        "d": "Advantage Capital published its annual impact report highlighting investments in job-generating small businesses, affordable housing, and renewable energy across the United States."
      }
    ],
    "location": "New Orleans, LA",
    "full_address": "909 Poydras St, Suite 2230, New Orleans, LA 70112",
    "website": "https://www.advantagecap.com",
    "employees": 100,
    "category": "funder"
  },
  {
    "id": 161,
    "name": "Arc",
    "leaders": [
      {
        "n": "Don Muir",
        "t": "CEO & Co-Founder",
        "bg": "Stanford MBA graduate who co-founded Arc in 2021 while attending Stanford Graduate School of Business. Previously held positions in private equity at Apollo Global Management and Onex, as well as management consulting at Boston Consulting Group (BCG). Also holds a degree in Strategy & Finance from Cornell University's Dyson School of Business. Recently launched F2, an AI-for-finance platform serving 250+ banks and private credit organizations.",
        "hooks": [
          "Co-founded Arc during COVID lockdown in his Menlo Park living room while at Stanford GSB",
          "Positioned Arc to fill the SVB gap after Silicon Valley Bank's collapse in 2023",
          "Arc migrated customer accounts to Fifth Third Bank, the only B2B fintech with funds at a top-20 US bank",
          "Also building F2, an AI-for-finance platform for banks and private credit"
        ],
        "li": "https://linkedin.com/in/don-muir/"
      },
      {
        "n": "Nick Lombardo",
        "t": "Co-Founder & President",
        "bg": "Stanford MBA graduate who co-founded Arc in 2021. Previously served as Private Equity Vice President at AEA Investors LP and as an Investment Banking Analyst in the M&A Group at Credit Suisse. Leads Arc's go-to-market strategy and business operations.",
        "hooks": [
          "All three Arc co-founders met at Stanford GSB and founded the company during their final year",
          "Arc raised $186.5M in total funding including a $150M credit facility"
        ],
        "li": "https://linkedin.com/in/nicholas-m-lombardo/"
      }
    ],
    "desc": "Arc is a fintech platform founded in 2021 that provides software startups with customized financial products including cash management, non-dilutive funding, and AI-powered financial services. In partnership with Stripe and Fifth Third Bank, Arc offers a comprehensive digital banking solution where software founders can borrow, save, and spend in one platform. The company raised $186.5M in total funding ($31M equity + $150M credit facility) and launched Arc Capital Markets in 2024 to connect startups with venture debt lenders. Arc has seen assets under management grow 40%+ following its Fifth Third Bank partnership.",
    "news": [
      {
        "h": "Arc Raises $20M Series A Led by Left Lane Capital",
        "s": "Fintech Futures, 2025",
        "d": "Arc raised $20 million in Series A funding to accelerate growth and expand treasury and software products, bringing total capital raised to $181 million."
      },
      {
        "h": "Arc Launches Capital Markets Venture Debt Marketplace",
        "s": "TechCrunch, January 2024",
        "d": "Arc expanded beyond cash management to offer startups access to venture debt through a new marketplace called Arc Capital Markets."
      },
      {
        "h": "Arc Migrates to Fifth Third Bank via Stripe Partnership",
        "s": "Stripe, July 2024",
        "d": "Arc migrated customer accounts to Fifth Third Bank, becoming the only B2B fintech with underlying funds held at a top-20 US national bank."
      }
    ],
    "location": "San Francisco, CA",
    "full_address": "1481 Folsom St, San Francisco, CA 94103",
    "website": "https://www.joinarc.com",
    "employees": 140,
    "category": "technology"
  },
  {
    "id": 162,
    "name": "Ramp",
    "leaders": [
      {
        "n": "Eric Glyman",
        "t": "CEO & Co-Founder",
        "bg": "Harvard graduate (A.B. in Economics and East Asian Studies, valedictorian from Green Valley High School in Las Vegas). Previously co-founded Paribus, a price-tracking app acquired by Capital One in 2016. Before that, worked as Financial Analyst at Millstein & Co. and Summer Analyst at Houlihan Lokey. Born and raised in Las Vegas, now lives in New York City.",
        "hooks": [
          "Glyman's first startup Paribus was acquired by Capital One in 2016 — then he built Ramp to compete with them",
          "Ramp hit $1B annualized revenue in August 2025, up 110% YoY",
          "Led four fundraising rounds in 2025 alone, tripling valuation from $13B to $32B",
          "Harvard valedictorian who studied Mandarin Chinese at Peking University"
        ],
        "li": "https://linkedin.com/in/eglyman/"
      },
      {
        "n": "Karim Atiyeh",
        "t": "CTO & Co-Founder",
        "bg": "Lebanese-American entrepreneur, Harvard graduate (BA in Electrical and Computer Engineering, MS in Computer Science as Siebel Scholar). Co-founded Paribus with Glyman, which was acquired by Capital One. Previously served as CS50 Teaching Fellow at Harvard and worked at Oliver Wyman. Fluent in Arabic and French.",
        "hooks": [
          "Built Ramp's engineering team from scratch — now processing over $100B in annual purchase volume",
          "Siebel Scholar at Harvard who taught the famous CS50 course before becoming a founder",
          "Lebanese-born engineer who co-founded two successful fintech companies"
        ],
        "li": "https://linkedin.com/in/karimatiyeh/"
      },
      {
        "n": "Will Petrie",
        "t": "Chief Financial Officer",
        "bg": "Promoted to CFO at Ramp in 2025 as part of a series of leadership promotions. Oversees Ramp's financial operations as the company surpassed $1 billion in annualized revenue and achieved free-cash-flow generation.",
        "hooks": [
          "Promoted to CFO during Ramp's breakout year when revenue doubled to $1B+",
          "Ramp is one of the few fintech unicorns that is free-cash-flow positive"
        ],
        "li": "https://linkedin.com/company/ramp"
      }
    ],
    "desc": "Ramp is an American fintech company offering corporate charge cards, expense management, bill-payment software, and AI-powered finance automation. Founded in 2019 and headquartered in New York City, Ramp reached a $32 billion valuation in November 2025 after raising $2.3 billion in total equity. The company reports over $1 billion in annualized revenue (110% YoY growth), 50,000+ customers including Shopify, CBRE, Anduril, Figma, and Notion, and over $100 billion in annual purchase volume. Ramp launched Ramp Travel (with Priceline), Ramp Treasury, and AI Agents in 2025. The company is free-cash-flow positive with 2,200+ enterprise customers.",
    "news": [
      {
        "h": "Ramp Reaches $32 Billion Valuation After $300M Raise",
        "s": "TechCrunch, November 2025",
        "d": "Ramp raised $300M led by Lightspeed Venture Partners at a $32B valuation, its fourth fundraise of 2025, tripling from $13B at the start of the year."
      },
      {
        "h": "Ramp Hits $1 Billion in Annualized Revenue",
        "s": "PR Newswire, August 2025",
        "d": "Ramp reached $1B in annualized revenue, up 110% year-over-year, while surpassing 50,000 customers and $100B in annual purchase volume."
      },
      {
        "h": "Ramp Named to CNBC Disruptor 50 List",
        "s": "CNBC, June 2025",
        "d": "Ramp was recognized on the 2025 CNBC Disruptor 50 list for its AI-powered finance automation platform."
      },
      {
        "h": "Ramp Launches Travel Product with Priceline Partnership",
        "s": "Ramp Blog, June 2025",
        "d": "Ramp debuted Ramp Travel, partnering with Priceline to use AI and automation to streamline corporate travel booking and expense management."
      }
    ],
    "location": "New York, NY",
    "full_address": "28 West 23rd St, Floor 2, New York, NY 10010",
    "website": "https://ramp.com",
    "employees": 1200,
    "category": "technology"
  },
  {
    "id": 163,
    "name": "Brex",
    "leaders": [
      {
        "n": "Pedro Franceschi",
        "t": "CEO & Co-Founder",
        "bg": "Brazilian-born entrepreneur who co-founded Brex in 2017 after dropping out of Stanford. Previously co-founded Pagar.me, the 'Stripe of Brazil,' which processed $1.5B in transactions before being sold. First person to jailbreak the iPhone 3G in Brazil at age 13. Named to Forbes '30 under 30: Finance' in 2019 and Forbes Billionaires list in 2022. Became sole CEO in June 2024 after transitioning from co-CEO model.",
        "hooks": [
          "Capital One is acquiring Brex for $5.15B — Franceschi will continue to lead Brex post-acquisition",
          "Built Brex into a $12.3B company after dropping out of Stanford and going through Y Combinator",
          "First jailbroke the iPhone 3G in Brazil at age 13, co-founded a billion-dollar payments company before age 22"
        ],
        "li": "https://linkedin.com/in/pfranceschi/"
      },
      {
        "n": "Ben Gammell",
        "t": "President & CFO",
        "bg": "Joined Brex when it had just 15 employees in 2018. Previously worked in investment banking at Goldman Sachs and at SoFi. Double degree in commerce and engineering from University of Sydney. Has served as Chief of Staff to the CEO and led Marketing, Business Development, and People teams. Promoted to President in addition to CFO role.",
        "hooks": [
          "Employee #15 at Brex who rose from early hire to President & CFO",
          "Navigating the $5.15B Capital One acquisition as CFO, half cash and half stock",
          "Goldman Sachs and University of Sydney alum who joined Brex before product-market fit"
        ],
        "li": "https://linkedin.com/company/brexhq"
      }
    ],
    "desc": "Brex is a fintech company founded in 2017 offering corporate cards, expense management, and spend management software for fast-growing companies. Headquartered in San Francisco, Brex was valued at $12.3B at its peak and announced a $5.15B acquisition by Capital One in January 2026 (approximately 50% cash and 50% stock). The company serves startups and enterprises with AI-powered financial tools. Brex went through Y Combinator, raised from top investors including Peter Thiel's Founders Fund and Kleiner Perkins, and introduced native stablecoin payments in September 2025. The company leased 100,000 sq ft at 270 Brannan St in San Francisco's SoMa district in 2025, returning to a physical HQ after years of remote-first work.",
    "news": [
      {
        "h": "Capital One to Acquire Brex for $5.15 Billion",
        "s": "Capital One, January 2026",
        "d": "Capital One entered a definitive agreement to acquire Brex for $5.15B in approximately 50% cash and 50% stock, expected to close mid-2026."
      },
      {
        "h": "Brex Transitions to Single CEO Model with Pedro Franceschi",
        "s": "Financial Technology Report, June 2024",
        "d": "Brex moved from a co-CEO model to a streamlined structure with Pedro Franceschi as sole CEO and Henrique Dubugras as chairman."
      },
      {
        "h": "Brex Leases 100,000 Sq Ft Office in San Francisco SoMa",
        "s": "The Real Deal, July 2025",
        "d": "Brex leased 100,000 square feet at 270 Brannan Street in San Francisco's SoMa neighborhood, marking its return to a physical headquarters."
      },
      {
        "h": "Fifth Third Partners with Brex for Commercial Card Technology",
        "s": "PYMNTS, 2025",
        "d": "Fifth Third Bank partnered with Brex to offer commercial card and financial technology services, expanding Brex's enterprise reach."
      }
    ],
    "location": "San Francisco, CA",
    "full_address": "270 Brannan St, San Francisco, CA 94107",
    "website": "https://www.brex.com",
    "employees": 1300,
    "category": "technology"
  },
  {
    "id": 164,
    "name": "Stripe Capital",
    "leaders": [
      {
        "n": "Patrick Collison",
        "t": "CEO & Co-Founder, Stripe",
        "bg": "Irish entrepreneur who co-founded Stripe in 2010 with his brother John. Born in Limerick, Ireland, Patrick dropped out of MIT to build Stripe. Under his leadership, Stripe has grown to process $1.9 trillion in total volume (2025) and is valued at $159 billion. Joined the board of Meta Platforms in April 2025. The Collison brothers maintain over 20% ownership of Stripe.",
        "hooks": [
          "Stripe processed $1.9 trillion in payment volume in 2025, equivalent to 1.6% of global GDP",
          "Stripe Capital disbursed $3.8 billion in loans to SMBs in 2025 with $420M in interest income",
          "Company valued at $159 billion — the most valuable private fintech company in the world",
          "Patrick joined the Meta board in 2025 while running Stripe"
        ],
        "li": "https://linkedin.com/in/patrickcollison/"
      },
      {
        "n": "Tanay Jaeel",
        "t": "Head of Product, Stripe Capital",
        "bg": "Leads product strategy, P&L, and roadmap for Stripe Capital since June 2021. Previously held product roles at Google Payments and Fintech building products to improve consumer financial health. Earlier roles at LinkedIn in Product and BizOps. Schwarzman Scholar who studied public policy and global affairs in Beijing. UC Berkeley graduate with a BS in Business Administration.",
        "hooks": [
          "Stripe Capital funding volume grew 45% from 2024 to 2025, supporting 81,000+ businesses",
          "Businesses accepting Stripe Capital financing grow revenue 27 percentage points faster than peers",
          "Expanded Stripe Capital to Germany in 2024 and grew the platform product for embedded lending"
        ],
        "li": "https://linkedin.com/company/stripe"
      }
    ],
    "desc": "Stripe Capital is the embedded lending product from Stripe, the $159 billion payments infrastructure company. Stripe Capital offers merchant cash advances and loans to businesses processing payments through Stripe, with loans issued by Celtic Bank. In 2025, Stripe Capital disbursed $3.8 billion in loans to SMBs, generating $420 million in interest income, with funding volume growing 45% year-over-year. The product supports over 81,000 businesses and is also available as a platform product enabling platforms to offer lending to their own customers. Stripe Capital has expanded internationally, launching in Germany in 2024.",
    "news": [
      {
        "h": "Stripe Valued at $159 Billion After Tender Offer",
        "s": "CNBC, February 2026",
        "d": "Stripe's valuation surged to $159 billion following a tender offer for employees, up from $91.5 billion a year earlier."
      },
      {
        "h": "Stripe Capital Disbursed $3.8 Billion in 2025",
        "s": "Stripe Annual Letter, 2025",
        "d": "Stripe Capital funding volume grew 45% year-over-year, disbursing $3.8B in loans to SMBs and generating $420M in interest income."
      },
      {
        "h": "Stripe Processes $1.9 Trillion in Total Payment Volume",
        "s": "Stripe, 2025",
        "d": "Businesses running on Stripe generated $1.9 trillion in total volume in 2025, up 34% from 2024, equivalent to roughly 1.6% of global GDP."
      },
      {
        "h": "Stripe Capital Businesses Grow 27% Faster",
        "s": "Stripe Blog, 2025",
        "d": "Stripe reported that businesses accepting Capital financing saw revenue grow 27 percentage points faster than peers on average."
      }
    ],
    "location": "South San Francisco, CA",
    "full_address": "354 Oyster Point Blvd, South San Francisco, CA 94080",
    "website": "https://stripe.com/capital",
    "employees": 10000,
    "category": "funder"
  },
  {
    "id": 165,
    "name": "Toast Capital",
    "leaders": [
      {
        "n": "Aman Narang",
        "t": "CEO & Co-Founder",
        "bg": "Co-founded Toast in 2011 in a basement alongside Steve Fredette and Jonathan Grimm. Holds BS and MS degrees in Computer Science from MIT. Previously led the mobile business unit at Endeca (now Oracle). Became CEO in January 2024 after serving as Co-President and COO. Toast now powers over 100,000 restaurant locations.",
        "hooks": [
          "Toast Capital has accumulated approximately $1 billion in loan originations for restaurants",
          "Toast achieved first-time GAAP profitability in Q4 2024 with $4.96B in annual revenue",
          "Co-founded Toast in a basement — now it powers 100,000+ restaurant locations across US, UK, Canada, and Ireland"
        ],
        "li": "https://linkedin.com/in/aman-narang-155628/"
      },
      {
        "n": "Steve Fredette",
        "t": "President & Co-Founder",
        "bg": "Co-founded Toast after working at Endeca (Oracle) where he co-founded their mobile commerce business, growing it to $10M in revenue in two years. MIT graduate with a BS in Chemistry. Previously worked on mobile app development before the iPhone, creating the first Flickr and Shoebuy.com apps. Leads product and innovation at Toast.",
        "hooks": [
          "Built Toast's product suite from handheld POS to kitchen displays and self-ordering kiosks",
          "MIT chemistry grad who pivoted from creating pre-iPhone mobile apps to building a $30B+ restaurant tech platform",
          "All three Toast co-founders came from Endeca, an enterprise software company acquired by Oracle"
        ],
        "li": "https://linkedin.com/in/stevefredette"
      },
      {
        "n": "Elena Gomez",
        "t": "President & CFO",
        "bg": "Oversees global finance, investor relations, and corporate development at Toast. Also serves as Interim Chief Accounting Officer as of June 2025. Manages Toast Capital's financial performance, noting that bad debt has decreased even as the lending program scales.",
        "hooks": [
          "Guided Toast to first GAAP profitability and $510-530M adjusted EBITDA guidance for 2025",
          "Toast Capital default rates remain in line with expectations while the program continues to scale"
        ],
        "li": "https://linkedin.com/company/toast-inc"
      }
    ],
    "desc": "Toast is a cloud-based restaurant management software company (NYSE: TOST) headquartered in Boston's Seaport District. Founded in 2011, Toast offers a comprehensive platform including point-of-sale, kitchen display systems, online ordering, payroll, and Toast Capital — a lending product providing restaurants with $5,000 to $300,000 in financing. Toast Capital has accumulated approximately $1 billion in loan originations. Toast powers over 100,000 restaurant locations across the US, UK, Canada, and Ireland. The company achieved $4.96B in 2024 revenue (28% YoY growth), first-time GAAP profitability, and projects $510-530M in adjusted EBITDA for 2025.",
    "news": [
      {
        "h": "Toast Achieves First-Time GAAP Profitability in Q4 2024",
        "s": "Yahoo Finance, February 2025",
        "d": "Toast reported record growth and first-time GAAP profitability, with 2024 annual revenue of $4.96B representing 28% year-over-year growth."
      },
      {
        "h": "Toast Capital Reaches $1 Billion in Loan Originations",
        "s": "Toast, 2024",
        "d": "Toast Capital accumulated approximately $1 billion in loan originations to restaurants, with healthy demand and defaults in line with expectations."
      },
      {
        "h": "Toast Expands Non-Payments FinTech Revenue",
        "s": "PYMNTS, Q3 2025",
        "d": "Non-payments fintech products including Toast Capital contributed $58 million in gross profit in Q3 2025, adding 11 basis points to the overall FinTech take rate."
      }
    ],
    "location": "Boston, MA",
    "full_address": "333 Summer St, Boston, MA 02210",
    "website": "https://pos.toasttab.com/products/capital",
    "employees": 5700,
    "category": "technology"
  },
  {
    "id": 166,
    "name": "DoorDash Capital",
    "leaders": [
      {
        "n": "Tony Xu",
        "t": "CEO & Co-Founder, DoorDash",
        "bg": "Born in Nanjing, China, immigrated to the US as a young child. Holds an MBA from Stanford and a degree in Industrial Engineering from UC Berkeley. Previously worked at McKinsey & Company, eBay, PayPal, and Square. Co-founded DoorDash in 2013 with Stanford classmates Andy Fang, Evan Moore, and Stanley Tang. Led DoorDash's 2020 IPO that made him a billionaire. Serves on the board of Meta Platforms since January 2022.",
        "hooks": [
          "DoorDash Capital offers merchant cash advances powered by Parafin to restaurant partners",
          "Led $1.2 billion acquisition of SevenRooms restaurant tech platform in May 2025",
          "Credits his experience as a dishwasher — his mother's restaurant job after immigrating — for inspiring DoorDash",
          "Sits on the Meta board of directors alongside running DoorDash"
        ],
        "li": "https://linkedin.com/in/xutony/"
      },
      {
        "n": "Prabir Adarkar",
        "t": "President & COO",
        "bg": "Serves as President and COO since March 2023, previously CFO from 2018-2023. Prior to DoorDash, was head of strategic finance at Uber (2015-2018) and held executive positions at Goldman Sachs advising tech companies on M&A. Also worked at McKinsey & Company. Holds degrees from NYU Stern, Columbia Engineering, and University of Mumbai. Helped DoorDash grow sales over 7x while improving unit economics.",
        "hooks": [
          "Joined DoorDash from Uber in 2018 and helped grow the company from pre-IPO to market dominance",
          "Rare CFO-to-COO transition at a major public tech company",
          "DoorDash reached record profitability in 2025 under his operational leadership"
        ],
        "li": "https://linkedin.com/in/prabir-adarkar-8b7b16/"
      }
    ],
    "desc": "DoorDash Capital is the merchant financing product offered by DoorDash (NYSE: DASH), the leading food delivery and local commerce platform. Launched in partnership with Parafin, an embedded fintech company, DoorDash Capital provides revenue-based financing to eligible restaurant merchants, typically $5,000 to $15,000+. Repayment is automated as a percentage of DoorDash sales with a one-time flat fee. In 2024, the program expanded internationally to Canada and introduced term loans. DoorDash itself reached record profitability in 2025, acquired SevenRooms for $1.2B, and reported hitting 10 billion lifetime orders globally. DoorDash has 23,700 employees.",
    "news": [
      {
        "h": "DoorDash Acquires SevenRooms for $1.2 Billion",
        "s": "DoorDash IR, May 2025",
        "d": "DoorDash acquired SevenRooms, a hospitality technology company, for $1.2B to expand its Commerce Platform capabilities for merchants."
      },
      {
        "h": "DoorDash Capital Expands to Canada via Parafin",
        "s": "Parafin Blog, 2024",
        "d": "Parafin expanded DoorDash Capital internationally by introducing capital programs in Canada, providing Canadian merchants with financial flexibility."
      },
      {
        "h": "DoorDash Reaches Record Profitability in 2025",
        "s": "Motley Fool, February 2026",
        "d": "DoorDash reported record profitability in 2025 while investing in expanding its local commerce operating system and merchant platform."
      },
      {
        "h": "Parafin Closes $93M Debt Facility for Merchant Lending",
        "s": "Parafin, August 2024",
        "d": "Parafin, DoorDash's financing partner, closed a $93M debt facility with Jefferies and Trinity Capital and ranked 15th on the 2025 Inc. 5000 list."
      }
    ],
    "location": "San Francisco, CA",
    "full_address": "303 2nd St, South Tower, 8th Floor, San Francisco, CA 94107",
    "website": "https://merchants.doordash.com/en-us/products/capital",
    "employees": 23700,
    "category": "technology"
  },
  {
    "id": 167,
    "name": "iwoca",
    "leaders": [
      {
        "n": "Christoph Rieche",
        "t": "CEO & Co-Founder",
        "bg": "Co-founded iwoca in 2011 after working in finance at Goldman Sachs as a VP. Holds a degree in Management from HEC Lausanne and the London School of Economics. Noticed how small businesses were being left behind by big banks, which inspired the founding of iwoca. Joined the Prime Minister's trade mission to India as part of the largest UK delegation ever assembled.",
        "hooks": [
          "iwoca achieved £234M revenue and £59M profit, making it one of the UK's most profitable fintechs",
          "Distributed £730M across 35,000 loans in 2024, representing 76% growth in loan value YoY",
          "Goldman Sachs VP who left banking to build what traditional banks wouldn't — fast, flexible SMB lending",
          "Joined the UK Prime Minister's trade mission to India with the largest UK delegation ever"
        ],
        "li": "https://linkedin.com/in/christophrieche/"
      },
      {
        "n": "James Dear",
        "t": "CTO & Co-Founder",
        "bg": "Co-founded iwoca in 2011 after working as VP at Deutsche Bank in structured credit trading. Holds a PhD in Theoretical Physics from King's College London and a BSc from Imperial College in Theoretical Physics. Built iwoca's technology platform from the ground up, enabling automated underwriting and rapid lending decisions for small businesses.",
        "hooks": [
          "PhD in Theoretical Physics who applied quantitative skills from Deutsche Bank trading to build automated lending technology",
          "iwoca's tech platform processes 35,000+ loans per year with automated decisioning"
        ],
        "li": "https://linkedin.com/company/iwoca"
      },
      {
        "n": "Seema Desai",
        "t": "Chief Operations Officer",
        "bg": "Cambridge Natural Sciences graduate who started her career at Accenture's strategy division. Previously served as Head of Retail Savings Products at Halifax/HBOS and Head of Product at Zopa where she led the Innovative Finance ISA development. Worked at GSMA driving financial inclusion in emerging markets and served as Board Member at Digital Impact Alliance (DIAL) at the United Nations Foundation. Joined iwoca in 2017 as Head of People before being promoted to COO.",
        "hooks": [
          "Diverse career spanning Accenture, HBOS, Zopa, GSMA, and the UN Foundation before leading iwoca operations",
          "iwoca opened a Leeds office to better serve its UK-wide customer base, 79% of which is outside London"
        ],
        "li": "https://linkedin.com/in/desaiseema"
      }
    ],
    "desc": "iwoca is a UK-based fintech lender founded in 2011 that provides flexible business loans from £1,000 to £1,000,000 to small and medium-sized businesses. The company achieved £234M in revenue and £59M in profit, making it one of the most profitable UK fintechs. In 2024, iwoca distributed £730M across 35,000 loans (76% growth in loan value, 82% growth in loan count YoY) and secured £200M in new debt funding from Citi and Waterfall Asset Management. Total capital raised exceeds £1.5 billion since launch, with £750M raised in debt funding over the last two years alone. iwoca has approximately 500 employees across offices in London, Leeds, Berlin, and Frankfurt. Named Best Small Business Lender at Moneynet Awards 2024 and Best Small Business Provider in 2025.",
    "news": [
      {
        "h": "iwoca Secures £200M Funding from Citi and Waterfall Asset Management",
        "s": "Fintech Global, November 2024",
        "d": "iwoca landed a £200M debt funding package from Citi and Waterfall, bringing total raised to £1.5 billion since launch."
      },
      {
        "h": "iwoca Reaches £251M ARR with 62% Year-on-Year Growth",
        "s": "Bright Reach, Q3 2024",
        "d": "iwoca achieved a projected annualised revenue rate of £251 million by Q3 2024, representing 62% year-on-year increase."
      },
      {
        "h": "iwoca Opens Leeds Office to Serve Regional Customers",
        "s": "iwoca News, 2024",
        "d": "iwoca opened a regional office in Leeds after receiving a £10M grant from the Capability and Innovation Fund, serving its 79% non-London customer base."
      },
      {
        "h": "iwoca Named Best Small Business Provider at Moneynet Awards 2025",
        "s": "Moneynet, 2025",
        "d": "iwoca won Best Small Business Provider at the 2025 Moneynet Awards, following its Best Small Business Lender win in 2024."
      }
    ],
    "location": "London, UK",
    "full_address": "10 Queen Street Place, London, EC4R 1AG, United Kingdom",
    "website": "https://www.iwoca.co.uk",
    "employees": 500,
    "category": "funder"
  }
]
