[
  {
    "id": 1199,
    "name": "Diverse Capital",
    "leaders": [
      {
        "n": "Ariel Peretz",
        "t": "Principal & Funding Director",
        "bg": "Ariel Peretz is the Principal and Funding Director of Diverse Capital LLC. He leads funding operations and capital allocation for the direct lending firm, overseeing merchant cash advances, equipment financing, and hard money loan programs for small and moderate-sized businesses. Under his direction, the firm provides cash advances ranging from $10,000 to over $2,000,000.",
        "hooks": [
          "Leads a direct lending firm offering same-day funding up to $1M",
          "Oversees MCA, equipment financing, and hard money loan programs",
          "Manages capital deployment ranging from $10K to $2M+ per deal"
        ],
        "li": "https://www.linkedin.com/company/diverse-capital-llc"
      }
    ],
    "desc": "Diverse Capital LLC is a New York-based direct lending firm that assists small and moderate-sized businesses in quickly obtaining working capital. The company offers merchant cash advances, equipment financing, and hard money loans, with funding ranging from $10,000 to over $2,000,000. They emphasize same-day funding capability with approvals in as little as 2 hours. They also serve real estate investors with hard money loans for fix-and-flip, new construction, and cash-out refinance projects for non-owner occupied properties.",
    "news": [
      {
        "h": "Diverse Capital Expands Real Estate Bridge Lending Programs",
        "s": "diversecapitalllc.com",
        "d": "The company expanded its hard money loan programs to serve real estate investors including fix-and-flip, new construction, and cash-out refinance projects."
      },
      {
        "h": "Same-Day Funding Program for Equipment Purchases",
        "s": "diversecapitalllc.com",
        "d": "Diverse Capital launched an immediate working cash advance program allowing businesses to qualify for up to $1,000,000 in equipment financing in as little as 2 hours."
      }
    ],
    "location": "New York, NY",
    "full_address": "New York, NY (exact street address not publicly listed)",
    "website": "https://diversecapitalllc.com/",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1200,
    "name": "Diversified Financial Network",
    "leaders": [
      {
        "n": "Khalil Abdul-Hakim",
        "t": "Principal",
        "bg": "Khalil Abdul-Hakim is associated with Diversified Financial Network as a key leader. Since 2002, the company has focused on providing working capital solutions for small and medium-sized businesses across all 50 states, offering business loans, church loans, fix-and-flip loans, land loans, bridge loans, and more.",
        "hooks": [
          "Leads a Dallas-based lending firm operating since 2002",
          "Offers lending across all 50 states including niche church and land loans",
          "Provides alternative financing without requiring perfect credit or collateral"
        ],
        "li": "https://www.linkedin.com/company/diversified-financial-network"
      }
    ],
    "desc": "Diversified Financial Network is a Dallas, Texas-based lending and financial consulting firm operating since 2002. The company provides alternative financing solutions including business loans, church loans, fix-and-flip loans, land loans, bridge loans, lines of credit, equipment financing, consumer financing, medical lending, and construction financing. They offer fixed payments and terms with competitive rates, and borrowers do not need perfect credit or collateral to qualify. The firm serves small and medium-sized businesses across all 50 states.",
    "news": [
      {
        "h": "Diversified Financial Network Maintains Active Lending Across 50 States",
        "s": "Various directories, 2025",
        "d": "The company continues operating as an alternative business lender from its Dallas headquarters, serving businesses nationwide with various loan products."
      }
    ],
    "location": "Dallas, TX",
    "full_address": "3102 Maple Ave., Dallas, TX 75201",
    "website": "https://www.crunchbase.com/organization/diversified-financial-network",
    "employees": 4,
    "category": "funder"
  },
  {
    "id": 1201,
    "name": "DrawBridge Capital",
    "leaders": [
      {
        "n": "Ben Salzberg",
        "t": "Owner/Partner",
        "bg": "Ben Salzberg is the Owner and Partner of DrawBridge Capital, a Chicago-based commercial lending firm he founded in July 2020. The company specializes in securing financing for real estate investors and established business owners, offering a comprehensive portfolio of commercial real estate and business loans including franchise financing and SBA loans.",
        "hooks": [
          "Founded DrawBridge Capital in 2020 to serve real estate investors and business owners",
          "Offers commercial real estate, franchise, and SBA loan programs",
          "Based in Chicago's O'Hare corridor at 8750 W Bryn Mawr Ave"
        ],
        "li": "https://www.linkedin.com/company/drawbridge-capital"
      }
    ],
    "desc": "DrawBridge Capital is a Chicago-based financial services company founded in July 2020 that specializes in securing financing for real estate investors and established business owners. The company offers a comprehensive portfolio including commercial real estate loans, small business loans, SBA loans, franchise financing, and equipment financing. DrawBridge Capital provides capital for property purchases, business expansion, and growth projects, serving the Chicago area and beyond with 2-10 employees.",
    "news": [
      {
        "h": "DrawBridge Capital Maintains BBB Business Profile",
        "s": "BBB, 2025",
        "d": "The company maintains an active Better Business Bureau profile for its commercial lending operations in Chicago."
      }
    ],
    "location": "Chicago, IL",
    "full_address": "8750 W Bryn Mawr Ave, Suite 300, Chicago, IL 60631",
    "website": "https://drawbridgecap.com/",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1204,
    "name": "Dynamic Fundings",
    "leaders": [
      {
        "n": "Chris Egbert",
        "t": "Senior Managing Director",
        "bg": "Chris Egbert serves as Senior Managing Director at Dynamic Fundings, a Ronkonkoma, NY-based business funding company incorporated in May 2024. He oversees operations for the company that provides merchant cash advances, small business loans, equipment financing, invoice factoring, and commercial real estate loans with same-day funding capability.",
        "hooks": [
          "Senior Managing Director at a fast-growing NY-based funding company",
          "Company incorporated in May 2024, rapidly scaling MCA and business loan operations",
          "Offers same-day funding decisions with rates starting as low as 3%"
        ],
        "li": "https://www.linkedin.com/in/chris-egbert-79230a316/"
      },
      {
        "n": "Matthew Cook",
        "t": "Funding Specialist",
        "bg": "Matthew Cook works at Dynamic Fundings in business funding services. He has been recognized in customer reviews for his work helping business owners secure financing through the company's various loan and MCA products.",
        "hooks": [
          "Praised in customer reviews for business funding assistance",
          "Works with merchants on MCA and business loan products"
        ],
        "li": ""
      }
    ],
    "desc": "Dynamic Fundings LLC is a Ronkonkoma, New York-based business funding company incorporated in May 2024. The company offers small business loans, merchant cash advances, term loans, commercial real estate loans, equipment financing, invoice factoring, and purchase order financing. They emphasize fast approvals with same-day funding capability, competitive rates starting as low as 3%, and work with businesses established for as little as 3 months. Repayment terms range from 6 months to 10 years. The company's DOS process contact is John Americo.",
    "news": [
      {
        "h": "Dynamic Fundings LLC Incorporates in New York",
        "s": "NY Dept of State, May 2024",
        "d": "Dynamic Fundings LLC was incorporated on May 20, 2024, in Ronkonkoma, NY, entering the business funding market with MCA and loan products."
      },
      {
        "h": "Dynamic Fundings Publishes MCA Industry Guidance",
        "s": "dynamicfundings.com, 2025",
        "d": "The company published educational content on merchant cash advances and how businesses can use MCAs to navigate economic challenges including tariffs."
      }
    ],
    "location": "Ronkonkoma, NY",
    "full_address": "2805 Veterans Memorial Hwy, Ronkonkoma, NY 11779",
    "website": "https://www.dynamicfundings.com/",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1206,
    "name": "Efficient Finance",
    "leaders": [
      {
        "n": "Shay Zafrir",
        "t": "CEO",
        "bg": "Shay Zafrir is the CEO of Efficient Finance. Prior to joining Efficient Finance, he led the innovation of Bank Hapoalim's commercial and retail divisions under the bank's co-GM and CEO. He brings deep expertise in banking technology and supply chain finance to the company's patent-protected platform.",
        "hooks": [
          "CEO of a global multi-bank supply chain finance fintech",
          "Previously led innovation at Bank Hapoalim, Israel's largest bank",
          "Oversees a patent-protected platform connecting financial institutions and businesses"
        ],
        "li": ""
      },
      {
        "n": "Moshe Hadar",
        "t": "Co-Founder & President",
        "bg": "Moshe Hadar is Co-Founder and President of Efficient Finance with over 20 years of experience in business management and finance. He previously held executive management positions as EVP & CFO of Flextronics Israel (a NASDAQ-listed EMS leader) and as EVP & CFO of USR Group, a holding company of various high-tech subsidiaries.",
        "hooks": [
          "Co-founded a patent-protected supply chain finance platform",
          "Former EVP & CFO of Flextronics Israel (NASDAQ-listed)",
          "Over 20 years of executive finance experience in tech and manufacturing"
        ],
        "li": ""
      },
      {
        "n": "Yossi Dauber",
        "t": "Co-Founder & Former Chairman",
        "bg": "Yossi Dauber is Co-Founder and the first CEO and Chairman of Efficient Finance. He served as Co-General Manager of Bank Hapoalim (Israel's largest bank with $100 billion in assets), heading both commercial and corporate divisions, and was chairman of Isracard, Israel's biggest credit card company.",
        "hooks": [
          "Former Co-General Manager of Bank Hapoalim ($100B in assets)",
          "Former Chairman of Isracard, Israel's largest credit card company",
          "Co-founded Efficient Finance to innovate supply chain finance"
        ],
        "li": ""
      }
    ],
    "desc": "Efficient Finance (EF) is a leading global multi-bank Supply Chain Finance fintech provider based in Israel. The company has developed a patent-protected platform connecting financial institutions and businesses to optimize working capital and enhance buyer-supplier trade relationships. EF serves a diversified client base including corporations, financial institutions, and SMEs with real-time financing solutions. Note: This is NOT an MCA/business funding company - it is an Israeli fintech specializing in supply chain finance technology. Its categorization as a 'funder' in the alternative lending sense may be incorrect.",
    "news": [
      {
        "h": "Efficient Finance Continues Global Supply Chain Finance Expansion",
        "s": "efficient.finance, 2025",
        "d": "The company continues to expand its patent-protected supply chain finance platform serving corporations, financial institutions, and SMEs globally."
      }
    ],
    "location": "Tel Aviv, Israel",
    "full_address": "Tel Aviv, Israel (exact address not publicly listed; phone: +972 3 566 5633)",
    "website": "https://efficient.finance/",
    "employees": 20,
    "category": "fintech_supply_chain_finance"
  },
  {
    "id": 1207,
    "name": "Element SaaS Finance",
    "leaders": [
      {
        "n": "John Gallagher",
        "t": "CEO & Partner",
        "bg": "John Gallagher is the CEO and Partner of Element SaaS Finance, having taken over from Karl Pichler. He was named among the Top 25 FinTech CEOs of 2022. He co-founded Element SaaS Finance alongside Ed Byrne and leads the company's lending operations to SaaS and recurring revenue companies, with loans ranging from $200K to $10M.",
        "hooks": [
          "Named among Top 25 FinTech CEOs of 2022",
          "Leads a boutique SaaS lending firm spun out of Scaleworks",
          "Oversees lending of $200K-$10M to recurring revenue companies"
        ],
        "li": "https://www.linkedin.com/company/elementsaasfinance"
      },
      {
        "n": "Ed Byrne",
        "t": "Co-Founder & General Partner",
        "bg": "Ed Byrne is Co-Founder and General Partner of Element SaaS Finance. He is also a co-founder of Scaleworks, the SaaS operator group that originally created Element to address the challenge of accessing growth capital for their family of SaaS companies. He brings deep SaaS operating experience to the firm's lending decisions.",
        "hooks": [
          "Co-founded both Scaleworks and Element SaaS Finance",
          "Experienced SaaS operator turned growth finance provider",
          "Helped raise $40M second fund for SaaS lending in 2021"
        ],
        "li": ""
      },
      {
        "n": "Lew Moorman",
        "t": "General Partner",
        "bg": "Lew Moorman is a General Partner at Element SaaS Finance and former President of Rackspace, one of the world's leading cloud computing companies. He brings extensive experience in scaling SaaS and cloud businesses to Element's lending operations and investment decisions.",
        "hooks": [
          "Former President of Rackspace, a leading cloud computing company",
          "General Partner providing SaaS industry expertise to lending decisions",
          "Part of the seasoned SaaS operator team behind Element"
        ],
        "li": ""
      }
    ],
    "desc": "Element SaaS Finance is a boutique growth finance company based in San Antonio, Texas, that lends to SaaS and recurring revenue companies. Founded in 2019 as a spinout from Scaleworks, the firm provides fixed-rate term loans and revenue-based financing from $200K to $10M. Element focuses on non-dilutive capital for bolt-on acquisitions, bridge loans, refinancing, and market expansion. The company has raised $18.5M across two funds and helped customers increase ARR by an average of 38% annually. Element differentiates by offering no warrants, no board seats, and no equity requirements. This is a tech/SaaS lender, not a traditional MCA funder.",
    "news": [
      {
        "h": "Element SaaS Finance Raises Second Fund to Lend $40M to Growing SaaS Companies",
        "s": "GlobeNewsWire, October 2021",
        "d": "Element Finance closed its second fund to provide up to $40M in growth capital to SaaS companies, expanding its lending capacity significantly."
      },
      {
        "h": "CEO John Gallagher Named Among Top 25 FinTech CEOs of 2022",
        "s": "elementsaasfinance.com, 2022",
        "d": "Element SaaS Finance CEO John Gallagher was recognized as one of the Top 25 FinTech CEOs, highlighting the company's growing prominence in SaaS lending."
      },
      {
        "h": "Scaleworks Spins Out Element SaaS Finance as Independent Debt Fund",
        "s": "Startups San Antonio",
        "d": "Element SaaS Finance was spun out of Scaleworks as an independent boutique growth finance company focused on SaaS and recurring revenue businesses."
      }
    ],
    "location": "San Antonio, TX",
    "full_address": "122 E Houston St, Ste 105, San Antonio, TX 78205",
    "website": "https://www.elementsaasfinance.com/",
    "employees": 15,
    "category": "saas_lender"
  },
  {
    "id": 1208,
    "name": "Elite by Channel",
    "leaders": [
      {
        "n": "Adam Peterson",
        "t": "CEO, Channel Partners Capital",
        "bg": "Adam Peterson was appointed Chief Executive Officer of Channel Partners Capital (the parent company of the Elite program) in October 2025. He leads the overall organization that provides equipment finance and working capital solutions to small businesses through partner networks. Channel has funded over $3 billion to more than 30,000 businesses.",
        "hooks": [
          "Appointed CEO of Channel Partners Capital in October 2025",
          "Leads an organization that has funded over $3B to 30,000+ businesses",
          "Oversaw Channel's acquisition by Onset Financial in April 2025"
        ],
        "li": "https://www.linkedin.com/company/channelpartnerscapital"
      },
      {
        "n": "Kristi Schon",
        "t": "Chief Marketing Officer",
        "bg": "Kristi Schon joined Channel Partners Capital in 2021 and currently serves as Chief Marketing Officer. She oversees marketing strategy for both the Channel and Elite brands, supporting the company's partner-based equipment finance and working capital distribution model.",
        "hooks": [
          "CMO leading marketing for both Channel and Elite brands",
          "Joined Channel in 2021 during a period of significant growth"
        ],
        "li": ""
      }
    ],
    "desc": "Elite by Channel (ELITE powered by Channel) is a division of Channel Partners Capital, a Minnetonka, Minnesota-based nationwide provider of small business equipment finance and working capital solutions. Founded in 2009, Channel has funded over $3 billion to more than 30,000 businesses. The Elite Partnership Program targets higher-quality credits with lower rates and monthly payments. In April 2025, Onset Financial acquired Channel, forming one of the largest independent equipment finance lenders. Channel completed an $85M ABS securitization and was named to the Inc. 5000 list in 2025. In February 2026, Sethre was appointed President of Elite.",
    "news": [
      {
        "h": "Onset Financial Acquires Channel Partners Capital",
        "s": "deBanked / Channel Partners Capital, April 2025",
        "d": "Onset Financial acquired Channel and its subsidiaries, forming one of the largest independent equipment finance lenders in the nation with combined $3B+ in originations."
      },
      {
        "h": "Channel Completes $85M ABS Securitization With Strong Investor Demand",
        "s": "Channel Partners Capital, 2025",
        "d": "Channel completed an $85 million asset-backed securitization, demonstrating strong capital markets access and investor confidence."
      },
      {
        "h": "Channel Named to Inc. 5000 Fastest-Growing Companies",
        "s": "Inc. Magazine, August 2025",
        "d": "Channel Partners Capital was named to the Inc. 5000 list of the fastest-growing private companies in America."
      },
      {
        "h": "Sethre Appointed President of Elite Division",
        "s": "Channel Partners Capital, February 2026",
        "d": "Channel appointed Sethre as President of the Elite division, signaling continued investment in the higher-quality credit working capital program."
      }
    ],
    "location": "Minnetonka, MN",
    "full_address": "11100 Wayzata Blvd, Minnetonka, MN",
    "website": "https://www.channelpartnerscapital.com/",
    "employees": 150,
    "category": "equipment_finance_lender"
  },
  {
    "id": 1209,
    "name": "Eminent Funding",
    "leaders": [
      {
        "n": "Elliot Kress",
        "t": "ISO Relations Manager",
        "bg": "Elliot Kress serves as ISO Relations Manager at Eminent Funding, a direct MCA funder based in New York City. He is responsible for onboarding new ISOs (Independent Sales Organizations) and managing broker relationships. He is recognized in the industry for transparent deal handling and consistent communication with brokers. He is based in the Toms River, NJ area.",
        "hooks": [
          "Manages ISO broker relationships for a direct MCA funder",
          "Known for transparent deal handling in the high-risk MCA space",
          "Oversees onboarding of new ISOs for C/D paper and 2nd-5th position deals"
        ],
        "li": "https://www.linkedin.com/in/elliotkress/"
      }
    ],
    "desc": "Eminent Funding LLC is a New York City-based direct MCA funder specializing in high-risk lending including C and D paper and 2nd to 5th position funding. The company has a minimum monthly revenue requirement of $25K (or $50K for construction) and serves all industries except financial services. Funding timelines range from 40-140 days. Eminent Funding pays 12 points to brokers and completes all underwriting upfront. They are actively onboarding new ISOs. As direct funders, they provide competitive programs designed specifically for merchants.",
    "news": [
      {
        "h": "Eminent Funding Actively Onboarding New ISOs",
        "s": "Funder Intel, 2024",
        "d": "Eminent Funding expanded its ISO network, actively recruiting new broker partners for its direct MCA lending programs including high-risk C/D paper."
      },
      {
        "h": "Eminent Funding Listed Among Direct MCA Funders",
        "s": "Funder Intel / deBanked directories",
        "d": "The company is recognized in industry directories as a direct MCA funder serving merchants across the United States with high-risk lending products."
      }
    ],
    "location": "New York, NY",
    "full_address": "New York, NY (exact street address not publicly listed; phone: (332) 900-1101)",
    "website": "https://www.eminentfunding.com/",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1210,
    "name": "Equipment Funding Solutions",
    "leaders": [
      {
        "n": "David Strand",
        "t": "President",
        "bg": "David W. Strand serves as President of Equipment Funding Solutions, bringing expertise in financial leadership and technology integration. He previously served as President at Mountaineer Leasing, Senior Vice President at Ryan Halldorson, and Vice President of Investments at Comerica. He has deep experience in equipment leasing, commercial finance, and business development.",
        "hooks": [
          "President of a fintech company revolutionizing equipment dealer financing",
          "Previously held executive roles at Mountaineer Leasing and Comerica",
          "Leads a platform that reduces equipment purchase transactions from days to hours"
        ],
        "li": "https://www.linkedin.com/in/david-strand-84123318/"
      }
    ],
    "desc": "Equipment Funding Solutions is a privately held finance technology company based in Oxford, Michigan, and part of the Accrete Enterprises family of companies. The company developed a revolutionary software platform that works with all equipment dealers -- including medium and heavy truck, trailers, construction equipment, and agriculture -- to streamline the sales and finance process, reducing equipment purchase transactions from several days to hours. They fund financing requests between $10,000 and $1,000,000 for businesses throughout the United States.",
    "news": [
      {
        "h": "Equipment Funding Solutions Continues Platform Expansion for Dealers",
        "s": "equipmentfundingsolutions.com / efundsolutions.com",
        "d": "The company continues developing its software platform to streamline equipment financing for dealers across medium/heavy truck, trailer, construction, and agriculture sectors."
      }
    ],
    "location": "Oxford, MI",
    "full_address": "1582 Eagle Trl, Oxford, MI 48371",
    "website": "https://www.equipmentfundingsolutions.com/",
    "employees": 15,
    "category": "equipment_finance_fintech"
  },
  {
    "id": 1211,
    "name": "ER Capital Ventures",
    "leaders": [],
    "desc": "ER Capital Ventures is a New York-based business funding company that provides tailored business loans and merchant cash advances designed for entrepreneurs. The company emphasizes fast funding with flexible terms and customized business loan options that adapt to each business's unique cash flow needs. They require businesses to have a minimum of 6 months in operation. Their services are governed by New York law. Very limited public information is available about the company's leadership team or specific operational details.",
    "news": [
      {
        "h": "ER Capital Ventures Active in MCA Lending Market",
        "s": "ercapitalventures.com",
        "d": "The company maintains an active presence in the merchant cash advance market, offering tailored business loans with flexible repayment terms to small businesses."
      }
    ],
    "location": "New York, NY",
    "full_address": "New York, NY (exact street address not publicly listed)",
    "website": "https://ercapitalventures.com/",
    "employees": 5,
    "category": "funder"
  }
]
