[
  {
    "id": 1534,
    "name": "LAF California LLC",
    "desc": "LAF California LLC is a merchant cash advance funder operating out of California. The company filed for a trademark on 'LAF CALIFORNIA' in December 2022 (Serial Number 97700291), covering merchant cash advance services for businesses under International Class 036. The trademark correspondent is James A. Stepan. Limited public information is available about the company's operations, funding volume, or employee count, though the trademark registration confirms their focus on MCA services for businesses in California and beyond.",
    "category": "funder",
    "employees": 10,
    "website": "https://lafcalifornia.com",
    "location": "California",
    "full_address": "California (exact address not publicly available)",
    "leaders": [
      {
        "n": "James A. Stepan",
        "t": "Principal / Correspondent",
        "bg": "Listed as the trademark correspondent for LAF California LLC on the USPTO filing from December 2022. Appears to be a key figure in the company's establishment and legal filings for MCA services.",
        "hooks": [
          "Your LAF California trademark filing shows a clear commitment to building a brand in MCA — how has the California market evolved since you filed in 2022?",
          "As a California-based funder, how are you navigating the state's disclosure requirements for commercial financing?",
          "What inspired the LAF California brand and your focus on the California MCA market?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "LAF California LLC Files Trademark for MCA Services",
        "s": "USPTO / Justia Trademarks, December 2022",
        "d": "LAF California LLC filed trademark serial number 97700291 for merchant cash advance services for businesses, indicating formal brand establishment in the MCA industry."
      },
      {
        "h": "California Strengthens Commercial Financing Disclosure Requirements",
        "s": "DFPI, 2024",
        "d": "California's Department of Financial Protection and Innovation continues to enforce disclosure requirements for commercial financing providers including MCA companies operating in the state."
      }
    ],
    "ice": "Your trademark filing for LAF California shows real commitment to building a recognized brand in the MCA space — would love to discuss how AI-powered underwriting could help scale your operations.",
    "icebreakers": [
      "Your LAF California trademark filing demonstrates brand-building ambition in MCA — how is that going?",
      "California's MCA market has unique regulatory requirements — how are you staying ahead of compliance?",
      "Building a funder brand from the ground up takes vision — what's driving LAF California's growth strategy?",
      "As a California-based MCA provider, you're in one of the largest small business markets in the country — how do you differentiate?"
    ],
    "tp": [
      "HyperVerge's AI underwriting could help LAF California scale deal volume while maintaining risk standards in a competitive California market.",
      "Our platform serves 450+ MCA companies — we can share best practices from similar California-based funders on optimizing approval rates.",
      "Automated identity verification and bank statement analysis could streamline LAF California's funding process from application to approval."
    ],
    "ask": "James, would you be open to a 15-minute call to explore how HyperVerge's AI underwriting platform could help LAF California scale its MCA operations more efficiently?",
    "notes": "Very limited public information available. Company confirmed as MCA funder through USPTO trademark filing. California market has strong disclosure requirements under SB 1235. May be early-stage or deliberately low-profile. The trademark filing suggests brand-building intent. Approach with awareness that they may be a smaller operation seeking growth tools.",
    "contacts": [
      {"n": "James A. Stepan", "t": "Principal / Correspondent"}
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1541,
    "name": "Midland American Capital",
    "desc": "Midland American Capital is a factoring and purchase order financing company founded in January 2009, headquartered in Irving, Texas with roots in East Meadow, New York. The company employs approximately 8 people and is a member of the International Factoring Association, Better Business Bureau, Kentucky Business Network, and NYC Business Network. As a direct lender, Midland American Capital eliminates middlemen to provide quick funding decisions with flexible terms and no hidden fees. The company supports industries including manufacturing, wholesale distribution, transportation, and retail with financing solutions such as accounts receivable financing and purchase order financing. The company also operates under the alternate name Recovco Mortgage Management, LLC.",
    "category": "funder",
    "employees": 8,
    "website": "https://www.linkedin.com/company/midland-american-capital",
    "location": "Irving, Texas",
    "full_address": "4600 Fuller Dr, Irving, TX 75038",
    "leaders": [
      {
        "n": "Michael J. Strauss",
        "t": "President",
        "bg": "President of Midland American Capital, leading the company's factoring and purchase order financing operations since the company's founding in 2009. Oversees strategic direction and client relationships across multiple industries.",
        "hooks": [
          "With 16 years in the factoring space since founding in 2009, how has Midland American's approach to underwriting evolved?",
          "Your membership in the International Factoring Association shows industry commitment — what trends are you seeing in the factoring market?",
          "As a direct lender eliminating the middleman, how do you balance speed with risk management?"
        ],
        "li": ""
      },
      {
        "n": "Richard Loeffler",
        "t": "COO",
        "bg": "Chief Operating Officer at Midland American Capital, responsible for day-to-day operations of the factoring and purchase order financing business. Manages operational efficiency across the company's lending portfolio.",
        "hooks": [
          "As COO of a factoring company, how are you leveraging technology to streamline the underwriting process?",
          "With operations spanning manufacturing, distribution, and transportation clients, what's your biggest operational challenge?",
          "How has the move from East Meadow to Irving impacted Midland American's growth trajectory?"
        ],
        "li": "https://www.linkedin.com/in/richard-loeffler-3393378b/"
      }
    ],
    "news": [
      {
        "h": "Midland American Capital Maintains Active BBB Profile in Irving, TX",
        "s": "Better Business Bureau, 2025",
        "d": "Midland American Capital continues to operate as a financial services company from its Irving, Texas headquarters, maintaining its BBB business profile and industry memberships."
      },
      {
        "h": "Factoring Industry Continues Growth as Alternative Lending Expands",
        "s": "International Factoring Association, 2024",
        "d": "The factoring and purchase order financing sector continues to grow as more businesses seek alternatives to traditional bank lending, benefiting companies like Midland American Capital."
      }
    ],
    "ice": "With 16 years in the factoring industry and memberships in the IFA and BBB, Midland American Capital has built real staying power — I'd love to discuss how AI could enhance your direct lending approach.",
    "icebreakers": [
      "Your 16-year track record in factoring since 2009 is impressive — how has the landscape changed?",
      "As a direct lender in factoring and PO financing, eliminating the middleman is a strong value prop — how do you maintain speed at scale?",
      "Your IFA membership signals deep commitment to the industry — what's next for Midland American's growth?",
      "Supporting industries from manufacturing to retail with factoring shows versatility — where do you see the most opportunity?"
    ],
    "tp": [
      "HyperVerge's AI-powered document verification could accelerate Midland American's invoice and purchase order verification process, reducing turnaround times.",
      "Our platform serves 450+ alternative lending companies — we can share insights on how factoring companies are using AI to improve risk assessment.",
      "Automated bank statement analysis could help Midland American make faster funding decisions while maintaining the direct lender advantage you've built."
    ],
    "ask": "Michael, with 16 years of experience in factoring, would you be open to exploring how AI-powered underwriting could help Midland American Capital process deals even faster while reducing risk?",
    "notes": "Small but established factoring company (8 employees, <$5M revenue). Founded 2009. Also operates as Recovco Mortgage Management LLC. Direct lender model is a differentiator. Strong industry affiliations (IFA, BBB). Focus on manufacturing, wholesale, transportation, retail. Texas-based but NYC roots. Opportunity to pitch AI-powered invoice/PO verification and risk assessment.",
    "contacts": [
      {"n": "Michael J. Strauss", "t": "President"},
      {"n": "Richard Loeffler", "t": "COO"}
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1542,
    "name": "Owl Funding",
    "desc": "Owl Funding is a merchant cash advance funder operating in the small business lending space. Limited public information is available about the company — it does not appear prominently in major MCA funder directories such as deBanked or Funder Intel, and no dedicated company website was found through public searches. The company may operate under a different legal entity name or may be a newer or smaller player in the MCA industry. There are several 'Owl'-branded financial services companies (Owl Advance, Owl Lending, Owl Financial Group), but none appear to be the same entity as 'Owl Funding' specifically.",
    "category": "funder",
    "employees": 10,
    "website": "",
    "location": "United States",
    "full_address": "Address not publicly available",
    "leaders": [],
    "news": [
      {
        "h": "Limited Public Information Available for Owl Funding",
        "s": "Research, 2025",
        "d": "Owl Funding does not appear in major MCA industry directories or public business databases, suggesting it may be a smaller or newer entrant in the merchant cash advance space."
      }
    ],
    "ice": "I noticed Owl Funding is building in the MCA space — would love to learn more about your approach and discuss how AI underwriting tools could support your growth.",
    "icebreakers": [
      "Building an MCA funding operation takes real expertise — what's Owl Funding's approach to the market?",
      "As a funder in the competitive MCA landscape, what differentiates Owl Funding from the pack?",
      "The MCA industry is rapidly adopting technology — how is Owl Funding leveraging tech in its operations?",
      "Growing a funding business requires strong risk management — what's your underwriting philosophy?"
    ],
    "tp": [
      "HyperVerge's AI underwriting platform could help Owl Funding scale deal volume while maintaining portfolio quality from day one.",
      "Our platform serves 450+ MCA companies — we can share best practices to help newer funders avoid common pitfalls.",
      "Automated bank statement analysis and identity verification could give Owl Funding an operational edge in a competitive market."
    ],
    "ask": "Would the Owl Funding team be open to a brief conversation about how HyperVerge's AI platform helps MCA funders scale efficiently?",
    "notes": "Very limited public information available. Could not find a dedicated website, leadership team, or industry directory listing. May operate under a different legal entity. Approach with discovery mindset — this could be a newer operation that needs technology infrastructure from the start, which is a strong selling angle for HyperVerge. Consider that this may also be a DBA or subsidiary of another company.",
    "contacts": [],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1546,
    "name": "Starcade Capital",
    "desc": "Starcade Capital is a national business finance solutions provider founded in January 2019 by Joe Nicolosi, headquartered in Scottsdale, Arizona. The company specializes in working capital, equipment financing, SBA loans, and vendor programs for small business owners across the United States. Starcade Capital operates as a business funding brokerage with over 100 strategic investment partners and lenders. The company hit $200K in revenue in 2023 and has handled deals as large as a $400 million hotel development project on the east coast. Starcade particularly focuses on industries like trucking, construction, and auto repair, and is known for funding 'hard to fund' files.",
    "category": "funder",
    "employees": 5,
    "website": "https://starcadecapital.com/",
    "location": "Scottsdale, Arizona",
    "full_address": "7791 E Osborn Rd, Scottsdale, AZ 85251",
    "leaders": [
      {
        "n": "Joe Nicolosi",
        "t": "President & Founder",
        "bg": "Founded Starcade Capital in January 2019 and built it from scratch into a thriving business funding brokerage. Hit $200K revenue in 2023 as a solo broker. Teaches business funding on Udemy. Known for hands-on approach and solving hard-to-fund deals. Has been featured on the Business Funding Podcast and Voyage Phoenix.",
        "hooks": [
          "Your journey building Starcade from scratch to $200K revenue in 2023 is impressive — what's been the biggest growth lever?",
          "Funding that $400M hotel development deal shows real capability — how do you source those larger opportunities?",
          "Your Udemy course on business funding shows thought leadership — how has teaching impacted your own business?",
          "Being known for funding 'hard to fund' files is a great niche — what makes those deals possible?"
        ],
        "li": "https://www.linkedin.com/in/joe-nicolosi-aa1b3162/"
      }
    ],
    "news": [
      {
        "h": "Solo Broker Turned $200K Revenue in 2023 — Case Study",
        "s": "Medium / Case Study Hub, 2024",
        "d": "Joe Nicolosi of Starcade Capital featured as a case study in how a solo business funding broker built a thriving brokerage from scratch, achieving $200K revenue in 2023."
      },
      {
        "h": "Starcade Capital Founder Featured on Voyage Phoenix",
        "s": "Voyage Phoenix, 2024",
        "d": "Joe Nicolosi profiled in Voyage Phoenix magazine about his journey founding Starcade Capital in Scottsdale and building a national business finance solutions company."
      },
      {
        "h": "Starcade Capital Offers Business Funding Courses on Udemy",
        "s": "Udemy, 2024",
        "d": "Starcade Capital founder Joe Nicolosi launched educational courses on business funding on the Udemy platform, sharing industry knowledge with aspiring brokers."
      }
    ],
    "ice": "Your case study about building Starcade to $200K revenue as a solo broker caught my eye — scaling from there often requires tech tools that can handle increasing deal flow.",
    "icebreakers": [
      "Building Starcade from scratch to a nationally serving brokerage is a great founder story — what's your vision for the next phase?",
      "Your $400M hotel development deal shows you can punch above your weight class — how do you underwrite those larger opportunities?",
      "Teaching business funding on Udemy while running Starcade shows real entrepreneurial energy — how do the two feed each other?",
      "Specializing in 'hard to fund' files is a smart niche — how does technology play into solving those complex deals?"
    ],
    "tp": [
      "HyperVerge's AI underwriting could help Starcade Capital process 'hard to fund' files faster by automating bank statement analysis and risk scoring.",
      "With 100+ lending partners, AI-powered deal matching could help Starcade route each application to the best-fit funder automatically.",
      "As you scale beyond solo brokerage, our platform can provide the infrastructure to handle higher deal volume without proportionally increasing staff."
    ],
    "ask": "Joe, as you scale Starcade Capital beyond the solo broker model, would you be open to exploring how AI-powered underwriting tools could help you process more deals efficiently?",
    "notes": "Business funding broker (not direct funder). Solo operation that hit $200K in 2023. 100+ lending partners. Scottsdale, AZ based. Focus on trucking, construction, auto repair. Handles deals from small working capital to $400M hotel development. Has educational content on Udemy. Entrepreneurial founder with growth ambitions. May benefit from technology to scale beyond one-person operation. Voyage Phoenix and Medium features give credibility.",
    "contacts": [
      {"n": "Joe Nicolosi", "t": "President & Founder"}
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1591,
    "name": "American Funding Services",
    "desc": "American Funding Services is a business lending company offering fast, deposit-based business loans. Founded on the principle that all businesses, regardless of size, should have fast access to working capital, the company provides unsecured working capital loans, short-term business loans, SBA loans, and term loans. Their deposit-based lending model evaluates businesses primarily on monthly bank deposits rather than credit scores. The company offers a streamlined digital application process with decisions typically in minutes and funding as fast as 24 hours. American Funding Services is registered as a Florida corporation (P190000428000) and appears to serve businesses nationwide from its Florida base.",
    "category": "funder",
    "employees": 15,
    "website": "https://americanfundingservices.com/",
    "location": "Miami, Florida",
    "full_address": "Miami, Florida (exact street address not publicly listed)",
    "leaders": [],
    "news": [
      {
        "h": "American Funding Services Offers Deposit-Based Business Loans",
        "s": "americanfundingservices.com, 2025",
        "d": "American Funding Services positions itself as a fast deposit-based business lender with decisions in minutes and funding in as fast as 24 hours for qualifying businesses."
      },
      {
        "h": "Florida Registers American Funding Services Inc.",
        "s": "Florida Division of Corporations / Sunbiz, 2019",
        "d": "American Funding Services registered as a Florida corporation, establishing its formal business entity in the state."
      }
    ],
    "ice": "Your deposit-based lending model is a smart approach to serving businesses that may not qualify through traditional credit scoring — AI could take that model even further.",
    "icebreakers": [
      "Your deposit-based lending approach is innovative — how has it differentiated American Funding Services in the market?",
      "Offering decisions in minutes and same-day funding is a strong value prop — what technology powers that speed?",
      "Founded on the principle of fast access to capital for all businesses — how has that mission evolved?",
      "Serving businesses from small working capital to SBA loans shows range — where do you see the most demand?"
    ],
    "tp": [
      "HyperVerge's AI-powered bank statement analysis could enhance American Funding Services' deposit-based underwriting model with even faster, more accurate assessments.",
      "Our platform serves 450+ MCA and business lending companies — we can share insights on optimizing deposit-based lending workflows.",
      "Automated identity verification could help American Funding Services maintain fast approval times while reducing fraud risk as you scale."
    ],
    "ask": "Would the American Funding Services team be open to a 15-minute call about how AI-powered bank statement analysis could enhance your deposit-based lending model?",
    "notes": "Deposit-based lending model is their key differentiator — evaluates businesses on bank deposits rather than credit scores. Florida registered corporation since 2019. Phone: (786) 475-1393. Products include unsecured working capital, short-term loans, SBA loans, term loans. Digital-first application process. Natural fit for HyperVerge's bank statement analysis and automated underwriting capabilities. Leadership team not publicly listed — may need direct outreach to identify decision-makers.",
    "contacts": [],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1600,
    "name": "Barnard & Fifth Capital Group",
    "desc": "Barnard & Fifth Capital Group is a merchant cash advance and business funding company headquartered at 201 Irving Pl, Woodmere, New York 11598. The company specializes in providing fast funding solutions including merchant cash advances, lines of credit, and invoice factoring tailored to client needs. With fewer than 25 employees and revenue under $5 million, Barnard & Fifth operates as a private company led by CEO Harvey Colt. The company offers a streamlined application process with approvals often within 24 hours, positioning itself as a quick-access capital provider for small and medium businesses nationwide.",
    "category": "funder",
    "employees": 20,
    "website": "https://barnardandfifth.com/",
    "location": "Woodmere, New York",
    "full_address": "201 Irving Pl, Woodmere, NY 11598",
    "leaders": [
      {
        "n": "Harvey Colt",
        "t": "CEO",
        "bg": "Chief Executive Officer at Barnard & Fifth Capital Group, leading the company's merchant cash advance and business funding operations from its Woodmere, New York headquarters. Oversees the company's product offerings including MCA, lines of credit, and invoice factoring.",
        "hooks": [
          "Leading Barnard & Fifth's diverse product suite from MCA to invoice factoring — how do you decide which product fits each client best?",
          "Your Woodmere, NY location puts you in the heart of the MCA industry on Long Island — how does that cluster benefit you?",
          "Offering approvals within 24 hours requires strong underwriting processes — how has your approach evolved?"
        ],
        "li": "https://www.linkedin.com/in/harvey-colt-34a825132"
      }
    ],
    "news": [
      {
        "h": "Barnard & Fifth Capital Group Maintains Active Operations in Woodmere, NY",
        "s": "ZoomInfo / Manta, 2025",
        "d": "Barnard & Fifth Capital Group continues to operate from its Woodmere, New York headquarters, offering merchant cash advances, lines of credit, and invoice factoring to businesses."
      },
      {
        "h": "Barnard & Fifth Capital Group Listed in Business Funding Directories",
        "s": "WeLoans / Business Directories, 2024",
        "d": "Barnard & Fifth Capital Group appears in multiple business funding directories as a provider of fast funding solutions for small and medium businesses."
      }
    ],
    "ice": "Barnard & Fifth's multi-product approach covering MCA, lines of credit, and invoice factoring shows real versatility — I'd love to discuss how AI underwriting could help across all three product lines.",
    "icebreakers": [
      "Your multi-product approach with MCA, credit lines, and factoring gives clients options — how do you match businesses to the right product?",
      "Being based in Woodmere puts you in a strong MCA ecosystem on Long Island — how does that community benefit your business?",
      "24-hour approvals require efficient processes — what's your biggest bottleneck in the underwriting workflow?",
      "As a private company in the MCA space, what's your growth strategy for the next few years?"
    ],
    "tp": [
      "HyperVerge's AI platform could help Barnard & Fifth streamline underwriting across all product lines — MCA, credit lines, and factoring — from a single dashboard.",
      "Our bank statement analysis technology could help maintain your 24-hour approval speed while improving risk assessment accuracy.",
      "With 450+ MCA companies on our platform, we can share benchmarking insights on approval rates, default rates, and portfolio performance."
    ],
    "ask": "Harvey, would you be open to a brief call to explore how HyperVerge's AI underwriting could help Barnard & Fifth maintain fast approvals while scaling across your MCA, credit line, and factoring products?",
    "notes": "Multi-product funder: MCA, lines of credit, invoice factoring. Small operation (<25 employees, <$5M revenue). Woodmere, NY — Long Island MCA corridor. CEO Harvey Colt on LinkedIn. Phone: (516) 274-0333. Legal actions visible in court records (Barnard & Fifth v. various merchants) — suggests active collections, which is normal for MCA. Good fit for AI underwriting to help manage risk across product lines.",
    "contacts": [
      {"n": "Harvey Colt", "t": "CEO"}
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1606,
    "name": "CapCall LLC",
    "desc": "CapCall LLC is an alternative financing and merchant cash advance company based in New York City, specifically in the Murray Hill area of Manhattan. The company positions itself as a leader in alternative financing with a management team boasting over 25 years of experience in the finance arena. CapCall provides same-day business financing with minimal document requirements and collateral-free funding applications, serving as a C lender that funds various position types if they believe the merchant can handle it. The company reported annual revenue of approximately $2 million in 2024. Key personnel include Mark Correa as Director of Operations and Konstantin Chak as Vice President of Strategic Partnerships. CapCall is listed on the BBB as a factoring service provider.",
    "category": "funder",
    "employees": 15,
    "website": "https://capcallllc.com/",
    "location": "New York, New York",
    "full_address": "New York, NY (Murray Hill, Manhattan)",
    "leaders": [
      {
        "n": "Mark Correa",
        "t": "Director of Operations",
        "bg": "Director of Operations at CapCall LLC with a Bachelor of Arts from Stony Brook University. Has a strong foundation in business administration and project management. Manages day-to-day operations of the alternative financing company and has noted that CapCall is a C lender willing to fund various positions when the merchant can afford it.",
        "hooks": [
          "Your willingness to fund various positions as a C lender shows confidence in your underwriting — how do you assess merchant affordability?",
          "With 25+ years of management experience at CapCall, how has the alternative financing landscape evolved?",
          "Same-day financing with minimal docs is a strong value prop — what's the secret to maintaining that speed?"
        ],
        "li": "https://www.linkedin.com/in/mark-correa-09835014a"
      },
      {
        "n": "Konstantin Chak",
        "t": "VP, Strategic Partnerships",
        "bg": "Vice President of Strategic Partnerships at CapCall LLC, responsible for building and managing relationships with ISO partners, brokers, and other funders in the alternative financing ecosystem. Based in New York City.",
        "hooks": [
          "As VP of Strategic Partnerships, how are you growing CapCall's ISO and broker network?",
          "Building strategic partnerships in the MCA space requires trust — what do ISOs value most in a funder partner?",
          "How does CapCall's partnership approach differentiate you from other funders competing for ISO deal flow?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "CapCall LLC Maintains BBB Profile as Factoring Service in New York",
        "s": "Better Business Bureau, 2025",
        "d": "CapCall LLC continues to operate as a registered factoring service provider with the Better Business Bureau in New York, NY."
      },
      {
        "h": "CapCall Positions as Leading Alternative Financing Provider",
        "s": "capcallllc.com, 2024",
        "d": "CapCall LLC markets itself as a new leader in alternative financing, emphasizing same-day funding, minimal documentation, and collateral-free applications for small businesses."
      }
    ],
    "ice": "CapCall's approach as a C lender willing to fund various positions shows strong risk appetite — AI underwriting could help you scale that approach while maintaining portfolio health.",
    "icebreakers": [
      "Your team's 25+ years of finance experience combined with a willingness to fund various positions makes CapCall unique — how do you manage the risk?",
      "Same-day financing with minimal documentation requirements is compelling — how are you balancing speed with due diligence?",
      "As VP of Strategic Partnerships, Konstantin is building your ISO network — how does technology factor into partner management?",
      "Being a C lender is a bold positioning — where do you see the biggest opportunity in that segment of the market?"
    ],
    "tp": [
      "HyperVerge's AI underwriting could help CapCall maintain its same-day funding speed while adding deeper risk analysis, especially important for C-position deals.",
      "Our automated bank statement analysis could reduce the already minimal documentation burden while extracting more insights for better funding decisions.",
      "With 450+ MCA companies on our platform, we can provide benchmarking data to help CapCall optimize its C-lender strategy."
    ],
    "ask": "Mark, would you and Konstantin be open to a 15-minute call about how AI-powered underwriting could help CapCall scale its C-position lending while managing risk?",
    "notes": "C lender willing to fund various positions — higher risk appetite. ~$2M annual revenue. NYC-based (Murray Hill). BBB registered as factoring service. Management team with 25+ years experience. Key contacts: Mark Correa (Operations), Konstantin Chak (Partnerships). Same-day funding, minimal docs, no collateral. Good fit for AI risk assessment tools given their willingness to take on complex deals. Strategic partnerships focus suggests ISO/broker channel is key.",
    "contacts": [
      {"n": "Mark Correa", "t": "Director of Operations"},
      {"n": "Konstantin Chak", "t": "VP, Strategic Partnerships"}
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1608,
    "name": "Carpe Capital",
    "desc": "Carpe Capital is a business lending company operating under the website carpecap.com, positioning itself as a 'one stop shop' for business loan needs. The company serves America's small businesses with a network of in-house funding sources and offers custom finance solutions with competitive rates. Carpe Capital emphasizes a personalized approach, assigning each applicant an experienced designated representative throughout the process. The company provides financial solutions for active businesses of all sizes, with a culture built around supporting entrepreneurialism. Limited public information is available about the company's founding, leadership team, or specific operational metrics.",
    "category": "funder",
    "employees": 15,
    "website": "https://carpecap.com/",
    "location": "United States",
    "full_address": "Address not publicly available",
    "leaders": [],
    "news": [
      {
        "h": "Carpe Capital Operates as One Stop Shop for Business Loans",
        "s": "carpecap.com, 2025",
        "d": "Carpe Capital positions itself as a comprehensive business lending solution with in-house funding sources and competitive rates for small businesses."
      }
    ],
    "ice": "Your 'one stop shop' approach to business lending with in-house funding sources shows ambition — I'd love to discuss how AI underwriting could strengthen that offering.",
    "icebreakers": [
      "Having a network of in-house funding sources is a strong competitive advantage — how have you built that capability?",
      "Assigning dedicated representatives to each client shows commitment to service — how does that scale?",
      "Your focus on competitive rates in a crowded market is bold — what enables you to price competitively?",
      "As a one-stop shop for business loans, how do you handle the different risk profiles across product types?"
    ],
    "tp": [
      "HyperVerge's AI underwriting platform could help Carpe Capital process applications faster across its diverse funding products while maintaining competitive rates.",
      "Our automated bank statement analysis and identity verification could free up your dedicated representatives to focus on relationship-building rather than document review.",
      "With 450+ business lending companies on our platform, we can share insights on optimizing multi-product lending operations."
    ],
    "ask": "Would the Carpe Capital team be open to a brief conversation about how AI-powered underwriting could help scale your one-stop-shop lending approach?",
    "notes": "Limited public information on leadership and company details. Website is carpecap.com. Multi-product lender with in-house funding sources. Emphasizes competitive rates and dedicated service reps. Not to be confused with Carpe (the antiperspirant brand by David Spratte). May need direct outreach to identify decision-makers. Good positioning as comprehensive lender, which could benefit from unified AI underwriting across products.",
    "contacts": [],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1653,
    "name": "Fortun Advance",
    "desc": "Fortun Advance is a fintech company specializing in merchant cash advances and working capital solutions for small businesses, with a particular focus on serving Latino and minority-owned enterprises. The company operates as a subsidiary of Luminar Media Group, Inc. (OTCMARKETS: LRGR), which acquired FortunCo and Fortun Advance in May 2024. Headquartered in Miami, Florida, Fortun celebrated its first anniversary in May 2025 with $6.4 million funded and 1,000 small businesses supported. The company reported a 245% surge in business advances since June 2024, with Q4 2024 funding up 109% year-over-year. As of September 2024, total assets had grown to $1.93 million including $498K in cash and $1.43M in receivables. Led by Chairman Yoel Damas and VP of Operations Giannina Nicoletti, Fortun recently appointed banking veteran Juan M. Sese as CFO and engaged ThinkEquity as financial advisor in December 2024.",
    "category": "funder",
    "employees": 20,
    "website": "https://fortunadvance.com/",
    "location": "Miami, Florida",
    "full_address": "Miami, Florida (corporate HQ)",
    "leaders": [
      {
        "n": "Yoel Damas",
        "t": "Interim President & Chairman of the Board",
        "bg": "Seasoned entrepreneur and attorney serving as interim president and Chairman of the Board of Fortun/Luminar Media Group. Pioneer in developing financial solutions for Latino and minority-owned small businesses. Led Fortun through its first year achieving $6.4 million in funding and supporting 1,000 businesses. Oversaw the company's 245% surge in business advances.",
        "hooks": [
          "Fortun's 245% surge in business advances since June 2024 is remarkable growth — what's driving that acceleration?",
          "Your focus on Latino and minority-owned businesses fills a real market gap — how has that niche shaped Fortun's approach?",
          "Engaging ThinkEquity as financial advisor signals big plans — can you share what's ahead for Fortun?",
          "Celebrating $6.4M funded and 1,000 businesses in your first year is impressive — what does year two look like?"
        ],
        "li": ""
      },
      {
        "n": "Giannina Nicoletti",
        "t": "VP of Operations",
        "bg": "MBA holder appointed VP of Operations at Fortun Advance in July 2024. Brings over nine years of experience in leadership roles for a major nationwide alternative funder. Also serves as CEO of Primo Funding and VP of Corporate Relations for PROSPANICA (National Society of Hispanic MBAs). Expert in alternative financing, revenue-based portfolio management, and financial data analysis.",
        "hooks": [
          "Your experience at a major nationwide alternative funder before Fortun gives you unique perspective — what operational improvements have you brought?",
          "Balancing VP of Operations at Fortun with PROSPANICA leadership shows deep commitment to the Hispanic business community — how do they intersect?",
          "Nine years in alternative funding operations means you've seen the industry evolve — where do you see the biggest technology gaps?"
        ],
        "li": "https://www.linkedin.com/in/giannina-nicoletti-mba-70528439/"
      },
      {
        "n": "Juan M. Sese",
        "t": "CFO",
        "bg": "Appointed CFO of Luminar Media Group/Fortun in February 2026 after serving as VP of Finance at Fortun Advance. Brings over 25 years of experience in finance, strategy, and corporate development. Banking industry veteran who has overseen Fortun's financial growth and operations expansion.",
        "hooks": [
          "With 25+ years in banking and finance, what attracted you to the fintech and MCA space at Fortun?",
          "As CFO overseeing rapid growth, how are you balancing aggressive expansion with financial discipline?",
          "Your promotion from VP of Finance to CFO reflects Fortun's confidence in your vision — what financial milestones are you targeting?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Fortun Marks First Anniversary With $6.4 Million Funded, 1,000 Small Businesses Supported",
        "s": "Yahoo Finance, May 2025",
        "d": "Fortun celebrated its first anniversary marking rapid growth with $6.4 million funded, 1,000 small businesses supported, and a national footprint established in just one year."
      },
      {
        "h": "Fortun Reports 245% Surge in Business Advances Since June 2024",
        "s": "Stock Titan / LRGR, 2024",
        "d": "Fortun reported a dramatic 245% surge in business advances since June 2024, with Q4 2024 funding up 109% year-over-year, signaling strong demand for its MCA products."
      },
      {
        "h": "Fortun Engages ThinkEquity as Financial Advisor",
        "s": "Yahoo Finance / GlobeNewsWire, December 2024",
        "d": "Fortun engaged investment bank ThinkEquity as its financial advisor, signaling potential capital raises or strategic initiatives to fuel continued growth."
      }
    ],
    "ice": "Fortun's 245% surge in business advances and $6.4M funded in just one year is exceptional growth — scaling that fast typically requires robust AI-powered underwriting to maintain quality.",
    "icebreakers": [
      "245% growth in advances since June 2024 is outstanding — how is your underwriting process keeping pace with that volume?",
      "Celebrating $6.4M funded and 1,000 businesses in year one sets a strong foundation — what's the target for year two?",
      "Your focus on Latino and minority-owned businesses is both mission-driven and commercially smart — how does that niche advantage show up in your deal flow?",
      "Engaging ThinkEquity as financial advisor signals ambitious plans — is a larger capital raise on the horizon?"
    ],
    "tp": [
      "HyperVerge's AI underwriting platform could help Fortun Advance maintain portfolio quality during its rapid 245% growth phase, ensuring scalable risk management.",
      "Our automated bank statement analysis is particularly valuable for underserved communities where traditional credit data may be limited — aligning with Fortun's mission.",
      "With 450+ MCA companies on our platform, we can provide benchmarking insights to help Fortun optimize its underwriting as it scales nationally."
    ],
    "ask": "Yoel, with Fortun's exceptional 245% growth, would you be open to discussing how HyperVerge's AI underwriting could help maintain portfolio quality as you scale toward your next milestone?",
    "notes": "Publicly traded via Luminar Media Group (OTCMARKETS: LRGR). Rapid growth story: 245% surge, $6.4M funded in year one, 1,000 businesses. Focus on Latino and minority-owned businesses. Miami HQ. ThinkEquity engaged as financial advisor. Key leadership: Yoel Damas (Chairman), Giannina Nicoletti (VP Ops), Juan Sese (CFO). Strong mission-driven narrative. Growth pace suggests urgent need for scalable underwriting technology. PROSPANICA connection through Nicoletti opens community-based selling angles.",
    "contacts": [
      {"n": "Yoel Damas", "t": "Interim President & Chairman"},
      {"n": "Giannina Nicoletti", "t": "VP of Operations"},
      {"n": "Juan M. Sese", "t": "CFO"}
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1655,
    "name": "Fundonatic",
    "desc": "Fundonatic operates under the legal entity Funders App, LLC (d/b/a Fundonatic), a fintech company founded by serial entrepreneur Mark Allayev. Headquartered in North Miami Beach, Florida, the company has achieved a remarkable $500 million in originations as of May 2023. Fundonatic focuses on serving Independent Sales Organizations (ISOs) and brokers in the merchant cash advance space. Funders App provides comprehensive back-end solutions for MCA funders including underwriting, white labeling, accounting, collection services, distribution of funds, and contracts. The platform essentially enables smaller funders to operate with institutional-grade infrastructure. Funders App is BBB-accredited in Aventura, FL. Previously, the business was known as 24 Capital, which evolved into the Symplifi Capital brand, while the internal infrastructure platform became the publicly licenseable Funders App service.",
    "category": "funder",
    "employees": 30,
    "website": "https://www.fundonatic.com/",
    "location": "North Miami Beach, Florida",
    "full_address": "3323 NE 163rd Street, Ste 401, North Miami Beach, FL 33160",
    "leaders": [
      {
        "n": "Mark Allayev",
        "t": "CEO",
        "bg": "Serial entrepreneur and CEO of Funders App / Fundonatic. Holds an MBA from Moscow State Institute of International Relations. Previously served as CEO of 24 Capital. Built Funders App into a platform achieving $500 million in originations by May 2023. Known for creating institutional-grade back-end infrastructure for MCA funders, transforming an internal tool into a publicly licenseable platform.",
        "hooks": [
          "Hitting $500 million in originations is a major milestone — what was the inflection point that accelerated Funders App's growth?",
          "Evolving from 24 Capital to Funders App and Symplifi Capital shows real strategic vision — what drove those transformations?",
          "Your platform essentially democratizes institutional-grade MCA infrastructure — how has that changed the funder landscape?",
          "With an MBA from MGIMO and a serial entrepreneurship background, what drew you to the MCA infrastructure space?"
        ],
        "li": "https://www.linkedin.com/in/mark-allayev-921b2010b/"
      }
    ],
    "news": [
      {
        "h": "Mark Allayev and Funders App Achieve $500 Million in Originations",
        "s": "PR Newswire, May 2023",
        "d": "Funders App, led by CEO Mark Allayev, announced achieving $500 million in total originations, marking a major milestone for the MCA back-end services platform."
      },
      {
        "h": "Funders App Featured in deBanked on Weathering Crisis and Flourishing",
        "s": "deBanked, June 2024",
        "d": "deBanked profiled how Funders App weathered a shocking crisis and continued to flourish, highlighting the company's resilience and Mark Allayev's leadership."
      },
      {
        "h": "Fundonatic Active in MCA Legal Proceedings Across Multiple States",
        "s": "Trellis Law / Court Records, 2024",
        "d": "Funders App LLC d/b/a Fundonatic appears in multiple court proceedings related to merchant cash advance agreements, indicating an active and sizeable portfolio."
      }
    ],
    "ice": "Reaching $500 million in originations and then getting profiled by deBanked for weathering a crisis and flourishing shows real resilience — AI underwriting could help scale the next $500M even faster.",
    "icebreakers": [
      "$500 million in originations is a milestone that puts Fundonatic in the top tier — what's the target for the next milestone?",
      "Being profiled by deBanked for weathering a crisis and flourishing shows leadership — what did you learn from that experience?",
      "Your evolution from 24 Capital to Funders App to Fundonatic shows constant innovation — what's the next evolution?",
      "Providing institutional-grade MCA infrastructure to smaller funders is a powerful business model — how many funders are on the platform now?"
    ],
    "tp": [
      "HyperVerge's AI underwriting could integrate with Fundonatic's platform to provide automated risk scoring for the funders using your back-end services — adding value to your white-label offering.",
      "With $500M in originations, AI-powered portfolio analytics could help Fundonatic and its funder clients optimize performance and reduce defaults.",
      "Our technology serves 450+ MCA companies — a strategic integration with Funders App could benefit your entire ecosystem of funder clients."
    ],
    "ask": "Mark, with $500M in originations and a growing ecosystem of funder clients, would you be open to exploring how HyperVerge's AI underwriting could be integrated into the Funders App platform as a value-add for your clients?",
    "notes": "Major opportunity: Fundonatic/Funders App is both a funder AND an infrastructure provider to other funders. $500M in originations. Platform provides underwriting, white labeling, accounting, collections, etc. Previously 24 Capital, now also Symplifi Capital brand. CEO Mark Allayev is a serial entrepreneur with MGIMO MBA. BBB accredited in Aventura. Featured in deBanked for resilience through crisis. Active in court proceedings (normal for large MCA operations). Integration opportunity: if HyperVerge integrates with Funders App platform, it could reach multiple funders through one partnership.",
    "contacts": [
      {"n": "Mark Allayev", "t": "CEO"}
    ],
    "source": ["p4-wave9-researched"]
  }
]
