[
  {
    "id": 1422,
    "name": "TradeRiver USA",
    "leaders": [
      {
        "n": "Sam Simon",
        "t": "CEO & Founder",
        "bg": "Founded TradeRiver USA to bring supply chain finance to the US market. Also Founder and Chairman of Simon Group Holdings, a highly diversified conglomerate spanning oil, energy, real estate, aerospace, defense, insurance, wine, and sports entertainment. Launched Atlas Oil Company in 1985 with a single delivery truck, growing it into a wholesaler with 500+ employees delivering over 2 billion gallons of fuel annually. Arrived in Detroit at age 9 after his family fled persecution in Iraq. Based in Detroit, MI.",
        "hooks": [
          "*Built Atlas Oil from 1 truck to 2B gallons/year",
          "Family fled Iraq — arrived Detroit at age 9",
          "Chairman of Simon Group Holdings conglomerate",
          "Spans oil, aerospace, defense, wine, sports"
        ],
        "li": "https://www.linkedin.com/in/samsimonceo"
      },
      {
        "n": "Layla Hollender",
        "t": "President",
        "bg": "Serves as President (also referenced as CEO) of TradeRiver USA, leading the company's US supply chain finance operations. Oversees the Baltimore-based team and the digital trade finance platform serving small to midsize companies engaged in cross-border and domestic trade.",
        "hooks": [
          "Leads US supply chain finance platform",
          "Baltimore-based trade finance executive"
        ],
        "li": "https://www.linkedin.com/in/layla-hollender/"
      },
      {
        "n": "John Hollender",
        "t": "Director, Marketing & Business Development",
        "bg": "Holds an MBA and serves as Director of Marketing and Business Development at TradeRiver USA. Responsible for growing the platform's client base among small to midsize businesses engaged in domestic and international trade. Based in Baltimore, MD.",
        "hooks": [
          "MBA with trade finance marketing focus",
          "Drives SMB growth for supply chain platform"
        ],
        "li": "https://www.linkedin.com/in/john-hollender-mba/"
      }
    ],
    "desc": "TradeRiver USA (Supply Chain Funding Finance Solutions Inc) is a non-bank online supply chain finance platform financing trade both cross-border and within the US. Founded in 2010 and headquartered in Baltimore, MD, the company provides small to midsize businesses with a one-stop, paperless purchasing system that removes complexity from the supply chain and provides working capital. The platform offers pre-approved revolving facilities that buyers at any point in the supply chain can use to finance trade with multiple suppliers, combining invoice factoring, purchase order financing, reverse factoring, and supplier finance into a single digital process. TradeRiver USA is part of the broader TradeRiver group (UK-based parent). Approximately 3-10 employees. Phone: (443) 759-7119.",
    "news": [
      {
        "h": "TradeRiver USA publishes guide on supply chain challenges for US small businesses and innovative trade finance solutions",
        "s": "TradeRiver USA Blog",
        "d": "2024-01-24"
      },
      {
        "h": "TradeRiver USA presents at AACFB Meet the Funder event showcasing supply chain finance solutions",
        "s": "AACFB",
        "d": "2021-06-16"
      }
    ],
    "location": "Baltimore, MD",
    "full_address": "401 E Pratt St, Suite 2245, Baltimore, MD 21202",
    "website": "https://www.traderiverusa.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1423,
    "name": "Tribolt Advance LLC",
    "leaders": [
      {
        "n": "Adam Morgan",
        "t": "Funding Manager",
        "bg": "Serves as Funding Manager at Tribolt Capital, the related entity to Tribolt Advance LLC. Manages funding operations and merchant cash advance deal flow for the Brooklyn-based MCA funder. Works across the Tribolt family of entities including Tribolt Advance and Tribolt Capital.",
        "hooks": [
          "Brooklyn-based MCA funding manager",
          "Manages deal flow for Tribolt entities"
        ],
        "li": "https://www.linkedin.com/in/adam-morgan-48ab301b4"
      }
    ],
    "desc": "Tribolt Advance LLC is a direct merchant cash advance funder based in Brooklyn, New York, operating alongside the related entity Tribolt Capital LLC (incorporated May 2019). The company provides working capital funding to small businesses across various industries including retail and service-based businesses, with a focus on fast funding (within 2 days) and a simplified application process. Offers working capital loans, small business loans, bad credit business loans, and merchant cash advances. Registered at 482 East 9th Street, Brooklyn, NY. Small team estimated at 5-10 employees.",
    "news": [],
    "location": "Brooklyn, NY",
    "full_address": "482 East 9th Street, Apt #3D, Brooklyn, NY",
    "website": "https://triboltadvance.com",
    "employees": 8,
    "category": "funder"
  },
  {
    "id": 1424,
    "name": "Trinity CP LLC",
    "leaders": [
      {
        "n": "Brian Dineen",
        "t": "Owner & Managing Partner",
        "bg": "Founded Trinity Capital Partners LLC in 2019 after 15+ years in the alternative financing industry. Started his career in 2007 as an originator for a commercial mortgage brokerage, completing financing on hotel/motel construction, office refinance, multifamily refinance, and mixed-use property construction across the US. Over 40 years of combined industry experience on the Trinity team. Based in Milwaukee, WI. Specializes in business finance, equipment lending, and alternative financing for clients who cannot secure conventional financing.",
        "hooks": [
          "Founded Trinity CP after 15+ years in alt finance",
          "Started as commercial mortgage originator in 2007",
          "Milwaukee-based equipment lending specialist",
          "Serves businesses turned away by conventional lenders"
        ],
        "li": "https://www.linkedin.com/in/alternativefinancing/"
      }
    ],
    "desc": "Trinity CP LLC (Trinity Capital Partners) is an alternative financing company based in Milwaukee, Wisconsin, owned and managed by Brian Dineen. Founded in 2019, the firm specializes in providing business finance and equipment lending solutions for clients who cannot secure conventional financing. Services include equipment leases and loans, commercial real estate funding, invoice factoring, asset-based lines of credit, working capital loans, and debt refinancing. The company focuses on helping businesses stabilize cash flow, achieve growth, and capitalize on opportunities. BBB accredited. Small firm with 1-10 employees.",
    "news": [],
    "location": "Milwaukee, WI",
    "full_address": "790 N Milwaukee St, Suite 318, Milwaukee, WI 53202",
    "website": "https://trinitycpllc.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1425,
    "name": "True Path Funding",
    "leaders": [],
    "desc": "True Path Funding is a direct business funder with over a decade of experience in commercial financing. The company provides accessible, transparent, and flexible funding solutions without middlemen, having partnered with thousands of clients across diverse industries. Product offerings include equipment financing, business term loans, merchant cash advances, lines of credit, debt consolidation, refinancing, and SBA 7(a) loans backed by SBA and trusted lending partners. Funding amounts range from $10,000 to $3 million with approvals and funding possible within 24 hours. Businesses can qualify for up to four positions. Minimum requirements include a 550+ FICO score, recent bank statements, and minimum monthly revenue threshold. The company emphasizes a client-first, personalized approach to empowering businesses of all sizes.",
    "news": [],
    "location": "United States",
    "full_address": "",
    "website": "https://truepathfunding.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1426,
    "name": "Tuo",
    "leaders": [
      {
        "n": "Adam Finke",
        "t": "CEO",
        "bg": "Serves as CEO of Tuo, a lending infrastructure fintech founded in 2020. Expert in lending, fintech, and bank partnerships. Leads Tuo's mission to transform credit access for consumers with thin or no credit histories by providing turnkey infrastructure for launching and scaling lending solutions. Based in Luverne, MN.",
        "hooks": [
          "Lending and bank partnership expert",
          "Built credit-access platform for thin-file consumers",
          "Fintech infrastructure CEO since 2020"
        ],
        "li": "https://www.linkedin.com/company/jointuo"
      },
      {
        "n": "George Ulmer",
        "t": "CTO",
        "bg": "Chief Technology Officer at Tuo. Highly experienced full-stack engineer who was part of Will.I.Am's AI startup team. Specializes in building scalable fintech solutions and leads the technical architecture of Tuo's lending infrastructure platform.",
        "hooks": [
          "*Was part of Will.I.Am's AI startup team",
          "Full-stack engineer building fintech infrastructure"
        ],
        "li": ""
      },
      {
        "n": "Steven Ma",
        "t": "Chief Lending Officer",
        "bg": "Chief Lending Officer at Tuo with extensive experience in launching and managing consumer lending programs and credit risk controls. Consumer lending expert focused on Tuo's underwriting and lending program design.",
        "hooks": [
          "Consumer lending program launch expert",
          "Credit risk controls specialist"
        ],
        "li": ""
      }
    ],
    "desc": "Tuo (tuo.io) is a fintech infrastructure company founded in 2020, providing a full suite of lending infrastructure solutions for fintechs, banks, and financial innovators. Originally built to transform credit access for consumers with thin or no credit histories through alternative data-driven credit models and a Credit Builder solution, Tuo has evolved into a trusted lending-as-a-service platform. The platform covers identity verification, compliance management, underwriting, AI-driven collections, and loan management, enabling partners to launch lending products in weeks instead of months via seamless integration. Advisory board includes Kathryn Petralia (Founder of Kabbage, acquired by American Express) and Trent Sorbe (Founder of Central Payments, Chief Payments Officer of KotaPay). Headquartered in Luverne, MN.",
    "news": [],
    "location": "Luverne, MN",
    "full_address": "538 90th Avenue, Luverne, MN 56156",
    "website": "https://tuo.io",
    "employees": 15,
    "category": "technology"
  },
  {
    "id": 1427,
    "name": "Union Funding Source",
    "leaders": [
      {
        "n": "Saul Dahan",
        "t": "President & CEO",
        "bg": "Chief Executive Officer and President of Union Funding Source, which he helped establish in 2018. Has funded over $50 million in merchant cash advances. Based in Hallandale Beach, FL. Previously held roles at Proactive Sourcing/Proactive Imports and New Era Lending before launching Union Funding Source. Leads ISO partnerships and direct funding operations.",
        "hooks": [
          "Funded $50M+ in merchant cash advances",
          "Built MCA funder from startup to industry player",
          "Based in Hallandale Beach, FL",
          "Previously at New Era Lending"
        ],
        "li": "https://www.linkedin.com/in/saul-dahan-60838423/"
      },
      {
        "n": "Avi Arnold",
        "t": "Director of Business Development & Head Underwriter",
        "bg": "Serves dual roles as Director of Business Development and Head Underwriter at Union Funding Source. Based in Brooklyn, New York. Also handles ISO development and underwriting decisions. Works in the Financial Services industry with focus on merchant cash advance risk assessment and partner growth.",
        "hooks": [
          "Dual BD and underwriting role in MCA",
          "Brooklyn-based ISO development lead"
        ],
        "li": "https://www.linkedin.com/in/aviarnold"
      },
      {
        "n": "Andy Stone",
        "t": "Director, Business Development",
        "bg": "Serves as Director of Business Development at Union Funding Source. Responsible for expanding the company's ISO partner network and driving deal flow. Works to grow the company's merchant cash advance funding volume.",
        "hooks": [
          "Grows ISO partner network for MCA funder",
          "Business development lead at Union Funding"
        ],
        "li": ""
      }
    ],
    "desc": "Union Funding Source is a direct merchant cash advance funder incorporated in May 2018, headquartered in Long Beach, New York. The company has funded over $50 million in merchant cash advances and positions itself as a gold standard in the MCA industry. As a direct funder, Union Funding Source eliminates broker fees and guarantees competitive rates, with funding programs for business owners with bad credit history, newer businesses, and businesses whose financials understate performance. The company approves a large percentage of applications and can provide significantly more capital than most in the industry. Offers a fast application process with less than 24-hour approval. Actively recruits experienced ISOs with one of the highest commission structures in the industry. Approximately 11 employees.",
    "news": [],
    "location": "Long Beach, NY",
    "full_address": "80 Long Beach Boulevard, Long Beach, NY",
    "website": "https://unionfundingsource.com",
    "employees": 11,
    "category": "funder"
  },
  {
    "id": 1430,
    "name": "Universal Lending Corporation",
    "leaders": [
      {
        "n": "Pete Lansing",
        "t": "Founder & President",
        "bg": "Founded Universal Lending Corporation nearly 40 years ago (established 1981) in Denver, Colorado, growing it from a staff of three to over 200 mortgage professionals across the United States. Serves as President. Colorado's oldest mortgage lender. Active leader in the Colorado Mortgage Lenders Association and member of the national Mortgage Bankers Association. In 2023, the Universal Lending Home Loans division was acquired by Lower LLC.",
        "hooks": [
          "*Built CO's oldest mortgage lender from 3 to 200+ staff",
          "Nearly 40 years leading Universal Lending",
          "Active in Colorado Mortgage Lenders Association",
          "Home Loans division acquired by Lower LLC in 2023"
        ],
        "li": "https://www.linkedin.com/in/petelansing"
      },
      {
        "n": "Brad Groves",
        "t": "Chief Financial Officer",
        "bg": "Has served as Universal Lending's CFO for nearly 20 years, joining the company in 1997. Leads accounting, IT, secondary marketing, post-closing teams, underwriting, compliance, and quality assurance. Instrumental in the company's growth and financial operations over two decades.",
        "hooks": [
          "20+ year CFO tenure at Universal Lending",
          "Joined in 1997 — oversees finance, IT, compliance"
        ],
        "li": ""
      },
      {
        "n": "Carol Peterson",
        "t": "Vice President of Regional Production",
        "bg": "Joined Universal Lending in 2002 as Vice President of Regional Production. Has more than 30 years in the mortgage industry. Contributes to Universal Lending's position as a leader in the residential mortgage lending industry.",
        "hooks": [
          "30+ years in mortgage industry",
          "VP Regional Production since 2002"
        ],
        "li": ""
      }
    ],
    "desc": "Universal Lending Corporation is one of Colorado's oldest mortgage lenders, founded by Pete Lansing in 1981 and headquartered in Denver. The company has grown from three staff members to over 268 mortgage professionals across the United States. Specializes in home loans, wholesale lending, reverse mortgages, FHA, VA, conventional loans, wholesale broker fulfillment, renovation loans, and mortgage banking. Now 100% owned by Risewell Homes (New Home Co.). In fall 2023, Lower LLC acquired the Universal Lending Home Loans division, with the team seeing increased loan volume and retaining top-producing Loan Officers post-acquisition. The leadership team is active in the Colorado Mortgage Lenders Association and the national Mortgage Bankers Association. Serves borrowers across Oregon, Washington, California, Arizona, Texas, Florida, and Colorado. BBB accredited.",
    "news": [
      {
        "h": "Lower LLC acquires Universal Lending Home Loans, one of Colorado's longest-standing independent mortgage companies",
        "s": "Lower LLC",
        "d": "2023-10-01"
      }
    ],
    "location": "Denver, CO",
    "full_address": "6775 E Evans Ave, Denver, CO 80224",
    "website": "https://www.ulc.com",
    "employees": 268,
    "category": "funder"
  },
  {
    "id": 1431,
    "name": "Upsize Capital",
    "leaders": [
      {
        "n": "Bee Hansford",
        "t": "Managing Partner",
        "bg": "Managing Partner at Upsize Capital, a direct lender specializing in small business funding based in Melville, New York. Leads the company's lending operations across multiple industries including construction, restaurants, transportation, retail, and medical offices. Focuses on providing quick approvals and accessible financing for businesses with lower credit scores.",
        "hooks": [
          "Direct lender serving multiple SMB verticals",
          "Melville, NY-based managing partner"
        ],
        "li": ""
      }
    ],
    "desc": "Upsize Capital is a direct lender based in Melville, New York, specializing in small business funding solutions. The company provides financing to businesses that do not qualify for traditional bank loans or require faster funding. Product offerings include SBA loans, traditional and short-term loans, business lines of credit, merchant cash advances, working capital funding, unsecured business funding, and equipment loans. Serves businesses across construction, restaurants, transportation, retail, and medical offices, with a particular focus on assisting those with lower credit scores. Features a quick and easy application process with approvals in minutes and no collateral required. Minimum requirements include 3 months in business and $5,000 monthly revenue. Very small operation with approximately 2 employees. Phone: (888) 899-9588.",
    "news": [],
    "location": "Melville, NY",
    "full_address": "68 South Service Road, Melville, NY 11747",
    "website": "https://www.upsizecapital.com",
    "employees": 2,
    "category": "funder"
  },
  {
    "id": 1432,
    "name": "Uptown Fund",
    "leaders": [
      {
        "n": "Scott O.",
        "t": "Founder",
        "bg": "Founder of Uptown Fund, a merchant cash advance lender based in Lakewood, NJ. Established the company in 2022 drawing on years of industry experience in the MCA space. Built the company to provide fast, reliable funding to small businesses with a focus on operational strengths rather than credit scores.",
        "hooks": [
          "Founded MCA lender from years of industry experience",
          "Lakewood, NJ-based MCA founder"
        ],
        "li": "https://www.linkedin.com/in/scott-o-18413b182/"
      },
      {
        "n": "Avrohom Eisenbach",
        "t": "Principal",
        "bg": "Principal of Uptown Fund LLC. Involved in the company's operations and strategic direction since its incorporation in May 2022. Based in Lakewood, New Jersey.",
        "hooks": [
          "Principal at Lakewood NJ MCA funder",
          "Operational leader at Uptown Fund"
        ],
        "li": ""
      }
    ],
    "desc": "Uptown Fund LLC is a merchant cash advance lender based in Lakewood, New Jersey, incorporated in May 2022 (started operations June 2022). Founded by industry veterans, the company provides small businesses with upfront capital in exchange for a portion of future receivables sales or revenue. Offers funding from $10,000 to $2 million with terms from 1 to 6 months, with funding available in as little as 2 hours. Unlike traditional lenders, Uptown Fund does not run credit checks, instead evaluating businesses based on payment history, revenue streams, industry performance, and daily ending balances. Serves multiple sectors including restaurants, construction, medical industry, retail, and Shopify-based businesses. Also provides debt repayment services. BBB listed. Estimated 11-50 employees.",
    "news": [],
    "location": "Lakewood, NJ",
    "full_address": "1515 Pine Street, Lakewood, NJ 08701",
    "website": "https://uptownfund.com",
    "employees": 20,
    "category": "funder"
  },
  {
    "id": 1434,
    "name": "Velocity Equipment Finance",
    "leaders": [
      {
        "n": "Cory Damm",
        "t": "Managing Director",
        "bg": "Managing Director of Velocity Equipment Finance, an operating division of TransPecos Banks. Has been at the forefront of marketplace automation in commercial equipment finance for over a decade. Co-founded, scaled, and led exits at both LenderCloud (online reverse auction for commercial debt) and LeaseQ. Started career at Direct Capital Corporation and as a capital consultant in middle-market lending. Holds a finance degree from Harvard Extension School and Marketing and Finance degrees from University of New Hampshire Whittemore School of Business. Based in Portsmouth, NH.",
        "hooks": [
          "*Co-founded and exited LenderCloud and LeaseQ",
          "*Harvard Extension School finance degree",
          "Decade in equipment finance marketplace automation",
          "UNH Whittemore dual degree Marketing and Finance"
        ],
        "li": "https://www.linkedin.com/in/cory-damm-b92baa4"
      },
      {
        "n": "Mike Kozub",
        "t": "CEO, TransPecos Banks",
        "bg": "CEO of TransPecos Banks, SSB, the parent bank of Velocity Equipment Finance. Leads the Texas-based banking organization with locations throughout the TransPecos region of west Texas and San Antonio. Oversaw the launch of Velocity Equipment Finance as a digital-first equipment finance division.",
        "hooks": [
          "CEO of TransPecos Banks — parent of Velocity EF",
          "Texas-based banking leader in west Texas and San Antonio"
        ],
        "li": ""
      }
    ],
    "desc": "Velocity Equipment Finance is a digital-first equipment finance platform operating as a division of TransPecos Banks, SSB, a Texas-based banking organization. Based in San Antonio, TX, the company provides fast and flexible financing for small businesses purchasing equipment ranging from $1,000 laptops to $150,000 commercial kitchens. The platform leverages cutting-edge technology to deliver the simplicity of consumer lending for commercial equipment and technology financing, serving a wide range of businesses, collateral types, and credit needs. Specialty sectors include food and beverage, landscaping, light construction, auto repair, salon and beauty, medical and veterinary, fitness, and HVAC. In September 2023, entered a strategic funding agreement with Targeted Lending Co., LLC, providing additional liquidity and competitive funding infrastructure. Velocity also serves third-party originators and vendors. Led by Managing Director Cory Damm, a serial fintech entrepreneur who previously co-founded LenderCloud and LeaseQ.",
    "news": [
      {
        "h": "Velocity Equipment Finance enters strategic funding agreement with Targeted Lending for additional liquidity and funding infrastructure",
        "s": "Equipment Finance Advisor",
        "d": "2023-09-01"
      },
      {
        "h": "TransPecos Banks launches Velocity Equipment Finance division with Cory Damm as Managing Director",
        "s": "MonitorDaily",
        "d": "2023-03-01"
      }
    ],
    "location": "San Antonio, TX",
    "full_address": "112 E Pecan Street, Suite 800, San Antonio, TX 78205",
    "website": "https://velocityef.com",
    "employees": 15,
    "category": "funder"
  }
]
