[
  {
    "id": 1259,
    "name": "Honour Capital",
    "leaders": [
      {
        "n": "Brian Slipka",
        "t": "Co-Founder & Chairman",
        "bg": "Former SVP and Head of TCF Technology Finance at TCF Capital Solutions/Winthrop Resources. Earlier held sales and leadership roles at PeopleSoft and Oracle covering major financial institution accounts. Started career at Ernst & Young. University of Minnesota Carlson School of Management graduate. Also founded True North Equity Partners portfolio of companies with combined revenues exceeding $250M.",
        "hooks": [
          "Built TCF Technology Finance division during nearly 14-year tenure at TCF/Winthrop Resources",
          "True North Equity Partners portfolio generates over a quarter billion in combined revenues",
          "Founded True North Family Foundation focused on education and community involvement"
        ],
        "li": "https://www.linkedin.com/in/brian-slipka-5443892/"
      },
      {
        "n": "Shea Huston",
        "t": "Co-Founder & CEO",
        "bg": "Worked in finance and technology industries since 1996. Spent 16 years as VP Sales at Winthrop Resources Corporation, a division of TCF Bank. Holds accounting degree from University of Wisconsin-Madison where he was a member of the 1995 NCAA Division I Men's Soccer National Championship team. Active community leader and youth soccer coach in the Twin Cities.",
        "hooks": [
          "16-year veteran of Winthrop Resources Corporation as VP Sales",
          "Member of 1995 NCAA Division I Men's Soccer National Championship team at UW-Madison",
          "Led Honour Capital through acquisition by Dext Capital in January 2025"
        ],
        "li": "https://www.linkedin.com/in/shea-huston-5a52b23/"
      }
    ],
    "desc": "Honour Capital is a purpose-driven capital finance company founded in 2020 in Minneapolis, providing strategic equipment financing and capital solutions to growth-oriented businesses. The firm combines the advantages of bank-level capital access with the flexibility of independent financing. In January 2025, Dext Capital acquired Honour Capital's equipment finance team. Founders also launched Honour Ag in April 2024, a separate agriculture finance venture. Revenue estimated in the mid-market range with approximately 20 employees at peak.",
    "news": [
      {
        "h": "Dext Capital acquires Honour Capital equipment finance team",
        "s": "ELFA Online / MonitorDaily",
        "d": "2025-01-06"
      },
      {
        "h": "Honour Capital founders launch new agriculture finance company Honour Ag",
        "s": "PR Newswire / AgriTechTomorrow",
        "d": "2024-04-29"
      },
      {
        "h": "Craig Ault joins Honour Capital as Chief Revenue Officer and EVP",
        "s": "PR Newswire",
        "d": "2023-07-25"
      },
      {
        "h": "Honour Capital expands team with eight new hires",
        "s": "MonitorDaily",
        "d": "2023-01-01"
      }
    ],
    "location": "Minneapolis, MN",
    "full_address": "515 N Washington Ave, Suite #410, Minneapolis, MN 55401",
    "website": "https://www.honour-capital.com",
    "employees": 20,
    "category": "funder"
  },
  {
    "id": 1260,
    "name": "Hunter Caroline",
    "leaders": [
      {
        "n": "Cody Roth",
        "t": "Managing Partner & CEO",
        "bg": "Experienced financial services professional educated at Florida State University College of Business with a BS in Management (2010-2012). Previously served as Executive Sales Manager at Fora Financial and Senior Funding Executive at Paramount Merchant Funding. Skilled in sales, finance, management, and business development.",
        "hooks": [
          "Founded Hunter Caroline Holdings in 2014 at age 24 after experience at Fora Financial and Paramount Merchant Funding",
          "Grew Hunter Caroline to offer funding amounts up to $4 million for both cash advances and business loans",
          "Operates as direct funder, syndicator, and white labeler across multiple platforms"
        ],
        "li": "https://www.linkedin.com/in/cody-roth-25136849/"
      },
      {
        "n": "Allison Czap",
        "t": "Managing Partner & Co-Founder",
        "bg": "Co-founded Hunter Caroline Holdings in 2014 alongside Cody Roth. Serves as Managing Partner overseeing business operations and strategic partnerships for the merchant cash advance and small business lending firm based in New York.",
        "hooks": [
          "Co-founded Hunter Caroline Holdings in 2014 as a multi-product alternative lending firm",
          "Manages portfolio spanning merchant cash advances, business loans, and asset-based lines of credit"
        ],
        "li": "https://www.linkedin.com/in/allison-czap-76b27127"
      }
    ],
    "desc": "Hunter Caroline Holdings, LLC is an alternative finance company founded in 2014 providing merchant cash advances, small business loans, and asset-based lines of credit with funding up to $4 million. The firm operates as a direct funder, syndicator, and white labeler, able to crowd fund and syndicate across multiple platforms. MCAs are wired next-day and business loans can fund in as little as 24 hours. Small team of approximately 3 employees with dual offices in New York and Florida.",
    "news": [
      {
        "h": "Hunter Caroline Holdings listed among MCA funders on deBanked directory",
        "s": "deBanked",
        "d": "2024-01-01"
      },
      {
        "h": "Hunter Caroline Holdings faces merchant cash advance default lawsuits from borrowers",
        "s": "Dramer Law / Legal Reports",
        "d": "2023-01-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "115 Broadway, Suite 302, New York, NY 10006",
    "website": "https://huntercaroline.com",
    "employees": 3,
    "category": "funder"
  },
  {
    "id": 1261,
    "name": "IBEX Funding",
    "leaders": [
      {
        "n": "Israel Niasoff",
        "t": "Founder & CEO",
        "bg": "Founded IBEX Funding Group LLC in 2018 as a boutique merchant cash advance funder headquartered in Brooklyn, New York. Built the company to serve small businesses with working capital through MCA products, reverse consolidations, and the proprietary Flex product. Leads a team of approximately 10-50 employees.",
        "hooks": [
          "Built IBEX Funding from startup to a recognized boutique MCA funder since 2018",
          "Developed proprietary Flex product guaranteeing merchants maximum future funding based on relationship history",
          "Pioneered reverse consolidation product offering merchants 35-60% daily MCA payment savings"
        ],
        "li": "https://www.linkedin.com/in/israel-niasoff-06aa37223"
      }
    ],
    "desc": "IBEX Funding Group LLC is a boutique merchant cash advance funder founded in 2018 in Brooklyn, NY. The company advances cash to merchants based on revenue, card sales, and accounts receivables in exchange for a portion of future earnings. Key differentiators include Reverse Consolidations providing weekly disbursements to satisfy existing MCA payments with 35-60% savings, and Flex, a unique product guaranteeing merchants maximum future funding. The firm employs approximately 10-50 people and focuses on building long-term merchant relationships.",
    "news": [
      {
        "h": "IBEX Funding Group mentioned in NY Attorney General MCA industry court filing",
        "s": "NY AG / Court Filing",
        "d": "2024-03-01"
      },
      {
        "h": "IBEX Funding Group expands product lineup with Flex merchant cash advance offering",
        "s": "IBEX Funding Group",
        "d": "2023-01-01"
      }
    ],
    "location": "Brooklyn, NY",
    "full_address": "323 Kingston Avenue, Brooklyn, NY 11201",
    "website": "https://ibexfundinggroup.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1262,
    "name": "InAdvance",
    "leaders": [
      {
        "n": "Christopher Gravagna",
        "t": "CEO & Managing Partner",
        "bg": "New York-based executive serving as CEO and Managing Partner of In Advance Capital. Also Chairman of the Board at Gravagna Group since 2020, focused on working capital for small businesses. Previously held roles at GoAccredited as CMO, Paige Concepts LLC, and Wines by Wives. Also serves on the Board of Directors at PVBLIC Foundation.",
        "hooks": [
          "Leads In Advance Capital which secured a $50 million credit facility in 2017",
          "Serves as Chairman of Gravagna Group and Board member of PVBLIC Foundation nonprofit",
          "Co-founded Payva, a fintech company, in addition to running In Advance Capital"
        ],
        "li": "https://www.linkedin.com/in/christophergravagna/"
      },
      {
        "n": "Tom Corliss",
        "t": "Co-Founder & Head of Sales",
        "bg": "Co-founded In Advance Capital in 2015 and has served as Head of Sales. Helped grow the company from a startup fintech lender to a direct funder providing up to $500K in working capital to small and medium businesses. Part of the original founding team alongside Shalom Auerbach.",
        "hooks": [
          "Co-founded In Advance Capital in 2015, scaling it into a multi-million dollar direct lending operation",
          "Part of the leadership team that secured $50 million in additional credit line financing in 2017"
        ],
        "li": ""
      }
    ],
    "desc": "In Advance Capital is a fintech direct lender founded in 2015 providing working capital up to $500,000 to US-based small and medium businesses in as little as 24 hours. The company offers merchant cash advances and a Bank Only ACH Funding program for businesses without merchant accounts. In 2017, InAdvance secured a $50 million credit facility. The company has undergone leadership transitions including Keith Nason stepping in as CEO in 2018 before Christopher Gravagna took over as CEO and Managing Partner. Approximately 16-87 employees across 3 locations.",
    "news": [
      {
        "h": "In Advance Capital secures $50 million in additional financing",
        "s": "PR Newswire / deBanked",
        "d": "2017-03-28"
      },
      {
        "h": "Keith Nason steps in as new CEO of In Advance Capital",
        "s": "deBanked",
        "d": "2018-02-01"
      },
      {
        "h": "Crestview SPV LLC files lawsuit against In Advance Capital leadership",
        "s": "NY Supreme Court / Trellis Law",
        "d": "2020-01-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "1430 Broadway, Rm 402, New York, NY 10018",
    "website": "https://inadvancecap.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 1265,
    "name": "InstaFund Advance",
    "leaders": [
      {
        "n": "David Norman",
        "t": "Chief Executive Officer",
        "bg": "Serves as CEO of InstaFund Advance LLC, a merchant cash advance company based in Fresh Meadows, New York. Leads operations focused on fast MCA funding for US-based small business owners with capital available within 24 hours. Manages a growing team including underwriters, ISO relations managers, and fund specialists.",
        "hooks": [
          "Leads InstaFund Advance providing same-day MCA funding to small business owners nationwide",
          "Built ISO partner network emphasizing transparent and mutually beneficial broker relationships",
          "Grew InstaFund Advance since its 2022 incorporation in New York"
        ],
        "li": "https://www.linkedin.com/in/david-norman-6828b5160/"
      }
    ],
    "desc": "InstaFund Advance LLC is a merchant cash advance company incorporated in New York in 2022, specializing in fast MCA funding programs for US-based small business owners. The company provides capital within 24 hours of request, requiring only 4 months of bank statements and a completed application. InstaFund Advance works closely with ISOs (Independent Sales Organizations) and brokers, emphasizing honest and mutually beneficial relationships. The company is based in Fresh Meadows, Queens, New York.",
    "news": [
      {
        "h": "InstaFund Advance promotes ISO partnership program on DailyFunder",
        "s": "DailyFunder",
        "d": "2024-01-01"
      },
      {
        "h": "InstaFund Advance LLC incorporated in New York state",
        "s": "NY Secretary of State",
        "d": "2022-04-01"
      }
    ],
    "location": "Fresh Meadows, NY",
    "full_address": "159-16 Union Tpke, Fresh Meadows, NY 11366",
    "website": "https://instafundadvance.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1266,
    "name": "InstaFunders",
    "leaders": [
      {
        "n": "Mark Jaffe",
        "t": "Funding Coordinator",
        "bg": "Serves as Funding Coordinator at InstaFunders LLC, managing merchant cash advance transactions and partner relationships. Part of the small team at the Florida-based MCA funding company that provides business capital ranging from $10,000 to $500,000.",
        "hooks": [
          "Coordinates merchant cash advance funding operations for businesses across the US",
          "Manages ISO and partner relationships for InstaFunders' MCA programs"
        ],
        "li": "https://www.linkedin.com/in/mark-jaffe-504605245/"
      }
    ],
    "desc": "InstaFunders LLC is a merchant cash advance funding company founded in 2021 and headquartered in Bay Harbor Islands, Florida, with an additional office in Miami. The company provides business capital ranging from $10,000 to $500,000 through merchant cash advance programs, working with businesses regardless of credit history. InstaFunders partners with ISOs and brokers to deliver fast funding solutions. The company operates with a small team of 2-10 employees and generates estimated revenue of $1-5 million.",
    "news": [
      {
        "h": "InstaFunders LLC launches merchant cash advance partnership program",
        "s": "InstaFunders",
        "d": "2022-01-01"
      }
    ],
    "location": "Bay Harbor Islands, FL",
    "full_address": "1019 Kane Concourse, Ste 202A, Bay Harbor Islands, FL 33154",
    "website": "https://www.instafunders.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1267,
    "name": "Instone Capital",
    "leaders": [],
    "desc": "Instone Capital is a premier lending partner providing businesses with fast, flexible, and reliable financing solutions. The company offers lines of credit, term loans, SBA loans, equipment financing, and working capital advances. Their cash advance product delivers funding to cover operational expenses, manage cash flow, and seize growth opportunities without long-term debt commitments. They also offer collateralized capital providing higher loan amounts, better rates, and flexible terms through asset-backed funding. Note: Instone Capital (instonecapital.com) is distinct from Instone Capital Partners, a family-owned investment company focused on sustainability.",
    "news": [],
    "location": "United States",
    "full_address": "",
    "website": "https://www.instonecapital.com",
    "employees": null,
    "category": "funder"
  },
  {
    "id": 1268,
    "name": "Integra Funding Solutions",
    "leaders": [
      {
        "n": "Randy Woods",
        "t": "Co-Founder & President",
        "bg": "Over 27 years in financial services starting in corporate and commercial banking with loan originations, portfolio management, and debt/equity financing at LGM Finance Companies, Bank of Texas, and Nations Bank/Bank of America. Launched Integra in 2011, growing it into a leading factoring company. Now serves as CEO of the Integra division within T Bank. BBA in Finance from University of North Texas.",
        "hooks": [
          "Founded Integra Funding Solutions in 2011 and led it through acquisition by Tectonic Financial in 2021",
          "27+ years in financial services spanning corporate banking, commercial lending, and factoring",
          "Became significant shareholder of Tectonic Financial upon Integra acquisition"
        ],
        "li": "https://www.linkedin.com/in/randy-woods-04ba5925/"
      },
      {
        "n": "Tracy Bolt",
        "t": "Co-Founder & Manager",
        "bg": "Co-founded Integra Funding Solutions in 2011 alongside Randy Woods. Served as Manager overseeing operations and growth of the factoring company. Became a significant shareholder of Tectonic Financial following the 2021 acquisition. Currently operates as Advisor at Bolt Advisory. University of North Texas graduate.",
        "hooks": [
          "Co-founded Integra Funding Solutions in 2011, building it into a national factoring leader",
          "Became significant shareholder of publicly traded Tectonic Financial upon 2021 acquisition",
          "Helped grow Integra while maintaining credit losses below industry norms"
        ],
        "li": "https://www.linkedin.com/in/tracy-a-bolt-3bb7b9175/"
      }
    ],
    "desc": "Integra Funding Solutions is a factoring company founded in 2011 in Fort Worth, Texas, providing invoice factoring and working capital to transportation, staffing, oil & gas, and manufacturing companies across the United States. The company offers same-day advances on unpaid invoices, converting them into immediate cash flow. Integra was acquired by Tectonic Financial Inc. in July 2021 and now operates as a division of T Bank, N.A. The company grew rapidly while maintaining credit losses below industry norms. Approximately 30 employees.",
    "news": [
      {
        "h": "Tectonic Financial acquires Integra Funding Solutions in cash-and-stock transaction",
        "s": "PR Newswire / Nasdaq / Seeking Alpha",
        "d": "2021-07-01"
      },
      {
        "h": "Integra Funding Solutions expands freight factoring services nationwide",
        "s": "Integra Funding",
        "d": "2020-01-01"
      }
    ],
    "location": "Fort Worth, TX",
    "full_address": "6300 Ridglea Pl, Ste 316, Fort Worth, TX 76116",
    "website": "https://integrafunding.com",
    "employees": 30,
    "category": "funder"
  },
  {
    "id": 1269,
    "name": "Ironwood Finance",
    "leaders": [
      {
        "n": "Kevin Donahue",
        "t": "Founder, Principal & CEO",
        "bg": "Founded Ironwood Finance in 2014 in Corpus Christi, Texas. Holds a degree in International Business from California Polytechnic State University-San Luis Obispo (2002-2006). Built Ironwood from a small business lender into a multi-entity financial services group encompassing Copperwood Capital (factoring) and Aquarius Fund (real estate financing). Based in Corpus Christi, TX with 500+ professional connections.",
        "hooks": [
          "Built Ironwood Finance from a single-product lender in 2014 into a three-company financial services group",
          "Launched Copperwood Capital for creative factoring and Aquarius Fund for real estate financing",
          "Cal Poly San Luis Obispo International Business graduate who built a Texas-based lending empire"
        ],
        "li": "https://www.linkedin.com/in/kevin-donahue-04338624/"
      }
    ],
    "desc": "Ironwood Finance is a Corpus Christi, Texas-based alternative lender founded in 2014, offering merchant cash advances, equipment leasing, collateral lending, invoice factoring, and real estate financing. The company is privately funded and operates through specialty programs including Copperwood Capital LLC for creative factoring solutions and Aquarius Fund LLC for real estate financing targeting business owners and self-employed borrowers. Ironwood serves small and medium businesses across the US that are overlooked by traditional banks. Estimated 11-50 employees with revenue of $5-20 million.",
    "news": [
      {
        "h": "Ironwood Finance launches Copperwood Capital factoring division and factors first million",
        "s": "Ironwood Finance",
        "d": "2023-01-01"
      },
      {
        "h": "Ironwood Finance expands with Aquarius Fund LLC for real estate financing",
        "s": "Ironwood Finance",
        "d": "2022-01-01"
      }
    ],
    "location": "Corpus Christi, TX",
    "full_address": "800 N Shoreline Blvd, Ste 1500S, Corpus Christi, TX 78401",
    "website": "https://ironwoodfinance.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 1270,
    "name": "iTrova",
    "leaders": [],
    "desc": "iTrova Finance is a fintech platform that democratizes access to capital by helping small businesses discover, apply for, and win grants, awards, and alternative loans. The platform connects to over 150,000 funding sources representing more than $200 billion in available capital for small businesses. iTrova is building the world's largest non-traditional financial network where funding is equitable, transparent, and impactful, with a mission to fund 5 million businesses in 5 years. The company addresses the 80% rejection rate small businesses face from traditional banks by connecting them with over $500 billion in annual alternative capital. Based in New York's Financial District.",
    "news": [
      {
        "h": "iTrova Finance launches platform connecting small businesses to 150,000+ alternative funding sources",
        "s": "iTrova",
        "d": "2023-01-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "",
    "website": "https://itrova.com",
    "employees": null,
    "category": "funder"
  }
]
