[
  {
    "id": 220,
    "name": "Liberty Advances",
    "desc": "Liberty Advances is a merchant cash advance provider offering same-day funding to small businesses across all 50 states. The company specializes in quick and reliable MCA financing, helping businesses access working capital when traditional lending options are unavailable. Liberty Advances operates through its website at libertyadvances.com, focusing on speed of funding and simplified application processes for merchants needing immediate capital.\n\nThe company appears to be a smaller MCA funder with limited public information about its leadership team, funding volumes, or organizational size. It operates in the competitive same-day MCA funding space alongside numerous other providers, differentiating through its nationwide coverage and streamlined funding process.",
    "category": "funder",
    "employees": 10,
    "website": "https://www.libertyadvances.com",
    "location": "New York, NY",
    "full_address": "",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "Leadership information not publicly available. Liberty Advances operates as a small MCA funder providing same-day merchant cash advances across all 50 states.",
        "hooks": [
          "Your same-day funding model requires fast underwriting decisions — how are you managing risk assessment speed?",
          "With nationwide MCA operations, how are you handling varying state regulatory requirements?",
          "What does your current deal flow look like and how are you sourcing merchant applications?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Liberty Advances Continues Same-Day MCA Funding Operations Nationwide",
        "s": "Company Website, 2025",
        "d": "Liberty Advances maintains its merchant cash advance operations providing same-day funding to small businesses across all 50 states."
      },
      {
        "h": "MCA Industry Faces Increased Regulatory Scrutiny",
        "s": "NPR, February 2026",
        "d": "The merchant cash advance industry faces growing attention as small businesses increasingly turn to alternative funding sources to manage cash flow challenges."
      }
    ],
    "ice": "I noticed Liberty Advances provides same-day MCA funding across all 50 states — that's an impressive operational footprint for a focused funder. Curious how you're managing underwriting speed at that scale.",
    "icebreakers": [
      "Your same-day funding model across all 50 states caught my attention — that requires robust underwriting infrastructure.",
      "I've been following how MCA funders are adapting to increased regulatory scrutiny, and Liberty Advances' nationwide approach is interesting.",
      "The speed-to-funding in the MCA space is increasingly competitive — would love to hear how Liberty Advances stays ahead.",
      "With the growing demand for alternative small business funding, Liberty Advances seems well-positioned for growth."
    ],
    "tp": [
      "HyperVerge's AI-powered identity verification can accelerate Liberty Advances' same-day funding process by automating KYC/KYB checks in seconds rather than manual review.",
      "Our AI underwriting platform, trusted by 450+ MCA companies, can help Liberty Advances scale nationwide operations while maintaining underwriting quality and speed.",
      "With same-day funding commitments, reducing fraud and verifying merchant identity quickly is critical — HyperVerge can process verifications instantly to protect your portfolio."
    ],
    "ask": "I'd love to connect with the leadership team at Liberty Advances to discuss how AI-powered verification can enhance your same-day funding operations — could we schedule a 15-minute call?",
    "notes": "Very limited public information available. Small MCA funder focused on same-day funding nationwide. No publicly identified leadership team. Website is minimal. May be a newer or boutique operation. Approach with discovery-first strategy to understand their scale and needs.",
    "contacts": [
      {
        "n": "Admin/Management",
        "t": "Contact via admin@libertyadvances.com"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1322,
    "name": "Montecito Boca INC",
    "desc": "Montecito Boca Inc is a business funding solutions provider based in Boca Raton, Florida, offering a comprehensive range of financing products including business term loans, property refinance loans, same-day working capital, SBA loans, equipment loans, retail and restaurant loans, factoring, merchant cash advances, short-term loans, and asset-based lending. The company funds businesses in both the U.S. and Canada, positioning itself as a diversified lending operation.\n\nBeyond direct funding, Montecito Boca also provides PR, marketing, and corporate communication services to businesses nationwide, including marketing packages to enhance business health, website presence, and overall marketing strategy. This dual offering of financial products and marketing services makes them a somewhat unique player in the small business funding landscape.",
    "category": "funder",
    "employees": 15,
    "website": "https://www.montecitoboca.com",
    "location": "Boca Raton, FL",
    "full_address": "",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "Leadership information not publicly available. Montecito Boca Inc operates as a business funding solutions and marketing services provider based in Boca Raton, Florida, serving businesses across the U.S. and Canada.",
        "hooks": [
          "Your dual model of business funding and marketing services is unique — how do those two sides complement each other?",
          "Funding businesses in both the U.S. and Canada requires navigating different regulatory environments — how has that experience been?",
          "With such a diverse product lineup from SBA loans to MCAs, what's your highest-volume product line?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Montecito Boca Offers Diverse Business Funding and Marketing Solutions",
        "s": "Company Website, 2025",
        "d": "Montecito Boca Inc continues to provide a wide range of business funding products including MCAs, SBA loans, equipment financing, and factoring alongside marketing services."
      },
      {
        "h": "MCA Industry Growth Drives Alternative Lender Expansion in South Florida",
        "s": "Industry Reports, 2025",
        "d": "South Florida continues to be a hub for alternative business lending companies, with funders like Montecito Boca expanding their product offerings."
      }
    ],
    "ice": "Montecito Boca's combination of business funding and marketing services is a unique model I don't see often in the MCA space — it seems like a smart way to build deeper client relationships.",
    "icebreakers": [
      "Your integrated approach of funding plus marketing services for businesses is an interesting differentiator in the MCA space.",
      "I noticed Montecito Boca funds businesses in both the U.S. and Canada — that cross-border capability adds operational complexity but also opportunity.",
      "The breadth of your product lineup from MCAs to SBA loans to factoring suggests sophisticated underwriting capabilities.",
      "South Florida has become a major hub for alternative business lending — Montecito Boca's diversified approach stands out."
    ],
    "tp": [
      "With such a diverse product lineup spanning MCAs to SBA loans, HyperVerge's AI verification can provide a unified KYC/KYB solution across all your funding verticals.",
      "Our AI underwriting tools, used by 450+ MCA companies, can help Montecito Boca automate risk assessment across your multiple product lines while maintaining quality.",
      "Cross-border funding to U.S. and Canadian businesses requires robust identity verification — HyperVerge handles multi-jurisdiction document verification seamlessly."
    ],
    "ask": "I'd love to connect with the team at Montecito Boca to explore how AI-powered verification could streamline operations across your diverse funding products — can we set up a brief call?",
    "notes": "Unique dual model: business funding + marketing/PR services. Broad product range from MCAs to SBA loans. Funds U.S. and Canada. Based in Boca Raton, FL. Leadership not publicly identified. Marketing services offering could be an upsell angle or distraction from core funding. Approach with curiosity about their primary revenue driver.",
    "contacts": [
      {
        "n": "Contact",
        "t": "Via montecitoboca.com"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1358,
    "name": "Pioneer Legal Funding",
    "desc": "Pioneer Legal Funding is a pre-settlement legal funding company that provides cash advances to plaintiffs with pending litigation claims. The company's mission is to increase access to justice by providing capital solutions for consumer and commercial plaintiffs awaiting settlement. They fund individual plaintiffs ($500 to $100,000+), attorneys and law firms ($500 to $1M+), and corporate plaintiffs ($10,000 to $1M+), with approvals typically within 24 hours.\n\nThe company operates with a team of underwriters, paralegals, and attorneys, and has built a reputation working with hundreds of law firms and thousands of plaintiffs across various injury claim types including medical malpractice, wrongful death, and negligence cases. All cash advances are non-recourse, meaning plaintiffs have no obligation to repay if their case is lost or dismissed. The company has not raised external funding and appears to be self-funded.",
    "category": "funder",
    "employees": 20,
    "website": "https://www.pioneerlegalfunding.com",
    "location": "New York, NY",
    "full_address": "",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "Pioneer Legal Funding leadership has built the company into a recognized litigation funding provider working with hundreds of law firms and thousands of plaintiffs. The company provides non-recourse pre-settlement funding from $500 to over $1 million.",
        "hooks": [
          "Your non-recourse model means risk assessment of case outcomes is critical — how are you evaluating litigation probability?",
          "Funding from $500 individual cases to $1M+ corporate litigation shows impressive range — what's your sweet spot?",
          "Working with hundreds of law firms suggests strong referral networks — how do you manage those relationships at scale?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Litigation Funding Industry Continues Growth as Court Backlogs Persist",
        "s": "Industry Reports, 2025",
        "d": "The pre-settlement funding market continues to expand as court delays drive demand for litigation financing from companies like Pioneer Legal Funding."
      },
      {
        "h": "Pioneer Legal Funding Expands Corporate Plaintiff Financing",
        "s": "Company Website, 2025",
        "d": "Pioneer Legal Funding offers non-recourse capital from $10,000 to $1M+ for corporate plaintiffs, funding costs of pending commercial claims."
      }
    ],
    "ice": "Pioneer Legal Funding's non-recourse model across consumer and commercial litigation is fascinating — essentially you're underwriting legal case outcomes rather than traditional business metrics.",
    "icebreakers": [
      "Your non-recourse litigation funding model requires a unique kind of underwriting expertise — evaluating case merit rather than traditional credit metrics.",
      "Working with hundreds of law firms and thousands of plaintiffs demonstrates real scale in a specialized funding niche.",
      "The range from $500 consumer cases to $1M+ corporate litigation shows impressive flexibility in your underwriting approach.",
      "Court backlogs and rising litigation costs should be driving strong demand for Pioneer Legal Funding's services."
    ],
    "tp": [
      "HyperVerge's AI identity verification can accelerate Pioneer Legal Funding's plaintiff onboarding by instantly verifying identity documents and reducing application processing time.",
      "With funding decisions needed within 24 hours, AI-powered document verification can streamline the intake process for the hundreds of applications Pioneer processes.",
      "Our fraud detection capabilities, trusted by 450+ funding companies, can help Pioneer Legal Funding identify fraudulent applications quickly and protect portfolio quality."
    ],
    "ask": "I'd love to discuss how AI-powered verification can help Pioneer Legal Funding process plaintiff applications faster while reducing fraud risk — could we schedule a 15-minute introduction?",
    "notes": "Pre-settlement legal funding, not traditional MCA. Non-recourse model. Underwriting is case-outcome based rather than revenue-based. Self-funded, no external investors. Different risk model than typical MCA — may need different pitch angle focused on applicant verification rather than business underwriting. Contact at (877) 610-0950.",
    "contacts": [
      {
        "n": "Contact",
        "t": "Via pioneerlegalfunding.com or (877) 610-0950"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1389,
    "name": "SBL Funding",
    "desc": "SBL Funding is a merchant cash advance provider that serves business owners across the country who need capital for expansion, growth, or cash flow management during slow periods. The company operates through sblfunding.biz and claims to provide capital quickly to qualified businesses. Within a 90-day period, one broker reportedly funded approximately $2.5 million in MCAs through SBL Funding, suggesting meaningful deal flow.\n\nHowever, the company has faced scrutiny on industry forums, with reports of payment and commission processing issues raised on DailyFunder. The underlying deals involved third-party funders like Splash Advance, suggesting SBL Funding may operate as a syndication partner or intermediary in some transactions. The company may be related to SBL Ventures, an investment firm focused on semi-passive businesses including laundromats and commercial real estate.",
    "category": "funder",
    "employees": 10,
    "website": "https://sblfunding.biz",
    "location": "Unknown",
    "full_address": "",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "SBL Funding leadership is not publicly identified. The company has facilitated approximately $2.5M in MCA deals within 90-day periods through broker partnerships and syndication arrangements with other funders.",
        "hooks": [
          "Your syndication model with other funders is interesting — how do you decide which deals to fund directly vs. syndicate?",
          "The $2.5M in 90-day deal flow shows solid broker relationships — how are you scaling that channel?",
          "How are you addressing the commission timing concerns that have come up in industry forums?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "SBL Funding Payment Issues Reported on DailyFunder Forum",
        "s": "DailyFunder, 2024",
        "d": "Industry forum posts reported commission payment processing delays with SBL Funding, involving syndicated deals with funders like Splash Advance."
      },
      {
        "h": "MCA Industry Faces Growing Pains as Smaller Funders Scale Operations",
        "s": "Industry Reports, 2025",
        "d": "Smaller MCA funders face operational challenges as they scale, including commission processing and syndication coordination."
      }
    ],
    "ice": "I've been following the MCA syndication space and noticed SBL Funding's deal volume — $2.5M in 90 days shows real momentum despite some operational growing pains.",
    "icebreakers": [
      "SBL Funding's deal volume suggests strong broker relationships and good deal origination capabilities.",
      "The syndication model you use with other funders is an interesting approach to managing portfolio risk.",
      "Scaling MCA operations quickly often outpaces back-office infrastructure — something many funders face as they grow.",
      "Your ability to deploy capital quickly across multiple deals shows sophisticated operational capabilities."
    ],
    "tp": [
      "HyperVerge's AI verification can help SBL Funding accelerate merchant onboarding and reduce manual review time, supporting faster deal closings.",
      "With syndication across multiple funders, having standardized AI-powered KYC/KYB verification can streamline partner coordination and reduce compliance friction.",
      "Our platform, trusted by 450+ MCA companies, can help SBL Funding scale operations while maintaining underwriting quality as deal volume grows."
    ],
    "ask": "I'd like to connect with SBL Funding's leadership to discuss how AI-powered verification can support your scaling operations — could we set up a brief introductory call?",
    "notes": "Limited public information. Has faced commission payment issues per DailyFunder forums. May syndicate deals with other funders like Splash Advance. Possible connection to SBL Ventures (laundromats/real estate). Approach carefully given reported payment issues. Focus on operational efficiency and scaling challenges.",
    "contacts": [
      {
        "n": "Contact",
        "t": "Via sblfunding.biz"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1390,
    "name": "Scale Capital",
    "desc": "Scale Capital appears in MCA industry databases as a merchant cash advance funder, though publicly available information about the company is extremely limited. The company is listed in priority-4 funder databases, suggesting it operates as a small to mid-size player in the merchant cash advance or revenue-based financing space. No public website, leadership information, or company details could be confirmed through standard research channels.\n\nNote: There is a Scale Capital based in Denmark that is a venture capital firm investing in B2B technology companies (scalecapital.com), and a Scale Funding that is an invoice factoring company (getscalefunding.com), but neither appears to be the MCA funder referenced. The company may operate under a different name or as a white-label funder through ISO partnerships.",
    "category": "funder",
    "employees": 10,
    "website": "",
    "location": "Unknown",
    "full_address": "",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "Limited public information available. Scale Capital is listed in MCA industry databases as a funder but maintains minimal public presence.",
        "hooks": [
          "I noticed Scale Capital operates in the MCA space but maintains a low public profile — is that a deliberate strategy?",
          "How does Scale Capital source its deal flow — primarily through ISO partnerships or direct applications?",
          "What types of merchants and industries does Scale Capital focus on funding?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Limited Public Information Available for Scale Capital",
        "s": "Research, 2026",
        "d": "Scale Capital maintains minimal public presence despite being listed in MCA industry databases as a merchant cash advance funder."
      }
    ],
    "ice": "Scale Capital's low-profile approach in the MCA space is interesting — many successful funders prefer to operate behind the scenes through ISO partnerships.",
    "icebreakers": [
      "Some of the most successful MCA funders maintain a quiet public presence while building strong ISO networks — Scale Capital seems to follow that model.",
      "I'm curious about Scale Capital's approach to the MCA market and what differentiates your funding products.",
      "The MCA industry is evolving rapidly with AI and automation — interested in how Scale Capital is adapting.",
      "With so many funders competing for deal flow, Scale Capital's approach to market positioning is worth exploring."
    ],
    "tp": [
      "HyperVerge's AI-powered verification platform can help Scale Capital automate merchant verification and reduce manual underwriting time.",
      "Our technology, trusted by 450+ MCA companies, can help Scale Capital scale operations while maintaining portfolio quality.",
      "AI-driven fraud detection can protect Scale Capital's portfolio from synthetic identity fraud and application manipulation."
    ],
    "ask": "I'd love to learn more about Scale Capital's operations and discuss how AI verification technology could support your funding process — can we connect?",
    "notes": "Very limited public information. Not to be confused with Scale Capital (Danish VC firm) or Scale Funding (invoice factoring). May operate as a white-label or behind-the-scenes funder. Difficult to research without more identifying details. May need to reach through industry contacts or events to make connection.",
    "contacts": [
      {
        "n": "Unknown",
        "t": "Unknown"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1412,
    "name": "Superior Capital",
    "desc": "Superior Capital (operating as Superior Capital Fund LLC) is a direct funder of working capital advances specializing in high-risk merchant cash advances for America's main street merchants when traditional banks and lenders are unable to help. The company partners with ISOs (Independent Sales Organizations) and other financial professionals to provide high-risk MCA direct funding through ACH/bank-only deals with flexible, non-SIC code dependent underwriting.\n\nBased in Atlanta, Georgia, Superior Capital differentiates itself by accepting credit scores below 500, offering same-day commission to ISO partners, and providing competitive rates. Every merchant application receives underwriter review within 24 hours of submission, with funding promised within 24 hours of a completed contract. The company is listed on multiple MCA industry directories including FunderIntel and Synergy Direct Solution as a recognized direct funder.",
    "category": "funder",
    "employees": 15,
    "website": "https://superiorcapitalfund.com",
    "location": "Atlanta, GA",
    "full_address": "",
    "leaders": [
      {
        "n": "Robert W. Gaskin",
        "t": "Partner / VP Strategic Partnerships",
        "bg": "Robert W. Gaskin is a partner at Superior Capital Fund and VP of Strategic Partnerships, described as a veteran in the MCA space and a military veteran. He also serves as President of National Business Loans and Business Funding Group. Based in Marietta, Georgia with extensive experience in alternative business funding.",
        "hooks": [
          "Your military background and MCA industry experience is a unique combination — how has that shaped Superior Capital's approach to risk?",
          "Superior Capital's focus on high-risk deals that other funders won't touch is a bold niche — what's your default rate looking like?",
          "Same-day commissions for ISOs is a strong value proposition — how has that impacted your deal flow?",
          "The non-SIC code dependent underwriting approach gives you more flexibility — how do you manage risk without industry restrictions?"
        ],
        "li": "https://www.linkedin.com/in/robert-w-gaskin-cabm-54b1746/"
      }
    ],
    "news": [
      {
        "h": "Superior Capital Fund Continues High-Risk MCA Direct Funding Operations",
        "s": "FunderIntel, 2025",
        "d": "Superior Capital Fund LLC remains listed as a recognized direct funder on major MCA industry directories, specializing in high-risk merchant cash advances."
      },
      {
        "h": "High-Risk MCA Funders See Growing Demand as Traditional Lenders Tighten",
        "s": "Industry Reports, 2025",
        "d": "Direct funders like Superior Capital that accept sub-500 credit scores see increased demand as banks and traditional lenders tighten lending standards."
      }
    ],
    "ice": "Robert, Superior Capital's focus on high-risk MCA deals with sub-500 credit scores is a bold niche — I'm impressed by the same-day commission model for ISOs that drives deal flow.",
    "icebreakers": [
      "Your military background and deep MCA experience make for a unique perspective in the high-risk funding space.",
      "Superior Capital's non-SIC code dependent underwriting gives you flexibility most funders don't have — that's a real competitive advantage.",
      "Same-day commissions for ISO partners is a strong differentiator that should drive deal volume your way.",
      "The high-risk MCA niche is challenging but rewarding for funders who can underwrite it well — Superior Capital seems to have found the sweet spot."
    ],
    "tp": [
      "HyperVerge's AI-powered identity verification can help Superior Capital process high-risk applications faster while detecting synthetic identity fraud that's common in the sub-500 credit score segment.",
      "Our AI underwriting tools, trusted by 450+ MCA companies, can help Superior Capital maintain its 24-hour underwriting promise while scaling deal volume with ISO partners.",
      "With ACH/bank-only deals, bank statement verification and fraud detection are critical — HyperVerge automates these checks to protect Superior Capital's portfolio."
    ],
    "ask": "Robert, I'd love to discuss how AI-powered verification can help Superior Capital scale your high-risk MCA operations while keeping defaults in check — could we grab 15 minutes this week?",
    "notes": "High-risk MCA specialist. ACH/bank-only deals. Sub-500 credit scores accepted. Non-SIC code dependent underwriting. Same-day ISO commissions. Robert Gaskin is the key contact — military veteran, industry veteran. Rated C-D paper type. Contact: info@superiorcapitalfund.com, 866-606-4545. Strong fit for fraud detection and AI underwriting given high-risk focus.",
    "contacts": [
      {
        "n": "Robert W. Gaskin",
        "t": "Partner / VP Strategic Partnerships"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1439,
    "name": "Volt Money",
    "desc": "Volt Money (operating as VoltMoney USA via LinkedIn at linkedin.com/company/voltmoneyusa) appears to be a U.S.-based commercial finance company specializing in small business loans, payments, and expense management for SMBs. The company operates in the business lending space, though detailed information about its specific MCA operations, funding volumes, and organizational structure is limited.\n\nNote: There is a separate India-based Volt Money (voltmoney.in) founded in 2022 by Bharat Lamba, Lalit Bihani, and Ankit Agarwal that provides loans against mutual funds and stocks — this is a different entity. The U.S.-based Volt Money appears to operate through voltmoney.com as a business lending platform offering cash advances and financing solutions, though it may also be related to Volt Merchant Solutions (voltms.com) or Volt Payments (voltpayments.com), which offer merchant cash advances from $5,000 to $150,000.",
    "category": "funder",
    "employees": 10,
    "website": "https://voltmoney.com",
    "location": "Unknown",
    "full_address": "",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "Leadership of Volt Money USA is not publicly identified. The company operates as a commercial finance platform specializing in small business loans and expense management for SMBs.",
        "hooks": [
          "Volt Money's approach to SMB lending and expense management is an interesting combination — how do those products work together?",
          "How does Volt Money differentiate from the many other business lending platforms in the market?",
          "What's your primary channel for originating deals — direct applications or ISO partnerships?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Volt Money Operates in Growing SMB Lending Market",
        "s": "Company Profile, 2025",
        "d": "Volt Money USA provides commercial finance solutions including small business loans and cash advances to SMBs."
      },
      {
        "h": "SMB Lending Platforms See Increased Demand Amid Economic Uncertainty",
        "s": "Industry Reports, 2025",
        "d": "Business lending platforms serving small and medium businesses continue to see growing demand as businesses seek alternative financing options."
      }
    ],
    "ice": "Volt Money's combination of business lending and expense management for SMBs is an interesting positioning in the commercial finance space.",
    "icebreakers": [
      "The integration of lending with expense management is a smart approach to building deeper SMB relationships.",
      "Volt Money's platform approach to commercial finance suggests a technology-first mindset that could drive efficiency.",
      "The SMB lending market is getting more competitive — curious how Volt Money carves out its niche.",
      "With multiple Volt-branded companies in the lending space, brand recognition must be both a challenge and opportunity."
    ],
    "tp": [
      "HyperVerge's AI-powered verification can help Volt Money automate merchant onboarding and KYC/KYB checks for faster funding decisions.",
      "Our technology, trusted by 450+ MCA companies, can integrate into Volt Money's platform to provide seamless identity verification at scale.",
      "AI-driven fraud detection can protect Volt Money's portfolio and help maintain healthy default rates as you scale lending operations."
    ],
    "ask": "I'd love to learn more about Volt Money's lending operations and discuss how AI verification technology could accelerate your funding process — can we connect for a brief call?",
    "notes": "Limited public information for U.S. operations. Multiple Volt-branded companies exist in lending space (Volt Merchant Solutions, Volt Payments, Volt Money India). LinkedIn presence at linkedin.com/company/voltmoneyusa. May be a newer or smaller operation. Research complicated by multiple similarly-named entities.",
    "contacts": [
      {
        "n": "Contact",
        "t": "Via voltmoney.com or LinkedIn"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1440,
    "name": "Waterview Capital",
    "desc": "Waterview Capital LLC is a merchant cash advance funder headquartered in Brooklyn, New York, that was created to fill a void in the MCA marketplace by offering professional, honest, and transparent funding with fast approvals and same-day funding. The company was incorporated in New York on May 18, 2022, and operates from 3101 Emmons Avenue, Brooklyn, NY 11235. Waterview Capital focuses on merchants that other funders often decline due to being considered 'high risk.'\n\nThe company employs 11-50 professionals with years of experience in the commercial finance industry and works primarily through ISO partnerships, providing same-day funding to help ISOs serve their merchant clients. Waterview Capital emphasizes a streamlined application process with most approvals in 30 minutes and same-day fund deposits.",
    "category": "funder",
    "employees": 25,
    "website": "https://waterviewcap.com",
    "location": "Brooklyn, NY",
    "full_address": "3101 Emmons Avenue, Brooklyn, NY 11235",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "Waterview Capital was founded in 2022 by professionals with extensive commercial finance experience. The company fills a niche in the MCA marketplace by funding merchants that other funders consider too high-risk, with same-day funding and 30-minute approvals.",
        "hooks": [
          "Waterview Capital's focus on merchants that other funders decline is a bold niche — how are you managing risk in that segment?",
          "Your 30-minute approval and same-day funding commitment requires robust underwriting infrastructure — how automated is your process?",
          "Since incorporating in 2022, how has Waterview Capital's deal volume grown?",
          "The ISO partnership model is core to your business — what do ISOs value most about working with Waterview Capital?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "Waterview Capital Expands High-Risk MCA Funding from Brooklyn Headquarters",
        "s": "Company Website, 2025",
        "d": "Waterview Capital continues to grow its merchant cash advance operations, specializing in funding merchants that other funders decline."
      },
      {
        "h": "Brooklyn-Based MCA Funders Fill Gap in Small Business Lending",
        "s": "Industry Reports, 2025",
        "d": "Companies like Waterview Capital are filling a void by providing same-day funding to businesses that don't qualify with traditional lenders or mainstream MCA providers."
      }
    ],
    "ice": "Waterview Capital's positioning of funding the merchants that other funders won't touch is a bold strategy — and growing from incorporation in 2022 to a meaningful MCA operation in just a few years shows real execution.",
    "icebreakers": [
      "Your focus on high-risk merchants that other funders decline creates a unique niche with less competition but more risk — that's a brave play.",
      "Going from incorporation in 2022 to an established MCA operation with same-day funding is impressive growth speed.",
      "The 30-minute approval process must require efficient underwriting systems — that's a strong value prop for ISOs.",
      "Brooklyn has become a hub for MCA funders — Waterview Capital's approach to the high-risk segment stands out."
    ],
    "tp": [
      "HyperVerge's AI-powered verification can help Waterview Capital maintain its 30-minute approval promise by automating identity and document verification instantly.",
      "With high-risk merchants, fraud detection is critical — our AI platform, trusted by 450+ MCA companies, can flag suspicious applications before funding.",
      "As Waterview Capital scales its ISO partnerships, AI-driven underwriting automation can help maintain quality while increasing throughput."
    ],
    "ask": "I'd love to connect with Waterview Capital's leadership to discuss how AI verification can support your high-risk MCA operations while maintaining the 30-minute approval speed — could we schedule a quick call?",
    "notes": "Founded 2022. Brooklyn, NY headquarters at 3101 Emmons Avenue. 11-50 employees. High-risk MCA specialist. Same-day funding, 30-minute approvals. ISO-focused model. Strong fit for AI fraud detection given high-risk focus. Relatively new company but growing. Contact via waterviewcap.com.",
    "contacts": [
      {
        "n": "Contact",
        "t": "Via waterviewcap.com"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1441,
    "name": "WeFund",
    "desc": "WeFund LLC is a BBB-accredited merchant cash advance and business lending company headquartered in Fort Lauderdale, Florida, led by President Claude Darmony. The company offers merchant cash advances, business lines of credit, and term loans with funding amounts ranging from $5,000 to $2 million. WeFund operates as both a direct lender and through ISO/broker partnerships, with 95% of clients reportedly receiving funding within 24 hours.\n\nThe company requires businesses to have at least 6 months of operating history and a minimum monthly cash flow of $25,000. WeFund evaluates applications based on cash flow and business performance rather than strict credit score requirements, offering unsecured loans with no personal credit check. The company has been BBB accredited since December 29, 2020, and maintains its presence through the wefundeasy.com website.",
    "category": "funder",
    "employees": 15,
    "website": "https://www.wefundeasy.com",
    "location": "Fort Lauderdale, FL",
    "full_address": "Fort Lauderdale, FL",
    "leaders": [
      {
        "n": "Claude Darmony",
        "t": "President",
        "bg": "Claude Darmony is President of WeFund LLC, bringing extensive real estate industry experience to drive innovative financing solutions for small businesses. He holds a BBA in Real Estate Development from Broward Community College and is actively involved in implementing SBA programs that provide critical funding opportunities for small businesses.",
        "hooks": [
          "Claude, your real estate background combined with MCA lending creates an interesting perspective — how has that experience shaped WeFund's underwriting approach?",
          "WeFund's involvement in SBA programs alongside MCAs shows a commitment to broader small business access — how do those programs complement each other?",
          "The $5,000 to $2M funding range is impressively broad — what's your sweet spot in terms of deal size?",
          "95% of clients funded within 24 hours is a strong claim — what infrastructure makes that possible?"
        ],
        "li": "https://www.linkedin.com/in/claude-darmony-60645814"
      }
    ],
    "news": [
      {
        "h": "WeFund LLC Maintains BBB Accreditation for Business Lending",
        "s": "BBB, 2025",
        "d": "WeFund LLC continues its BBB accreditation since 2020, offering merchant cash advances, business lines of credit, and term loans from Fort Lauderdale."
      },
      {
        "h": "Alternative Business Lenders See Strong Demand in Florida Market",
        "s": "Industry Reports, 2025",
        "d": "Florida-based business lenders like WeFund experience growing demand as small businesses seek fast funding alternatives to traditional banking."
      }
    ],
    "ice": "Claude, WeFund's BBB accreditation since 2020 and the $5K to $2M funding range show you've built a credible and flexible lending operation — the 95% same-day funding rate is impressive.",
    "icebreakers": [
      "Your transition from real estate to small business lending brought a unique perspective to WeFund's operations.",
      "BBB accreditation since 2020 signals a commitment to transparency that distinguishes WeFund in the MCA space.",
      "The $5,000 to $2 million funding range gives WeFund flexibility to serve businesses at many stages of growth.",
      "WeFund's involvement in SBA programs alongside MCAs shows a broader commitment to small business access to capital."
    ],
    "tp": [
      "HyperVerge's AI-powered verification can help WeFund maintain its 95% same-day funding rate by automating KYC/KYB checks and reducing manual review bottlenecks.",
      "With funding up to $2 million, robust identity verification and fraud detection become even more critical — our AI platform protects against sophisticated application fraud.",
      "Our technology, trusted by 450+ MCA companies, can integrate with WeFund's existing workflow to accelerate underwriting for both direct applications and ISO-sourced deals."
    ],
    "ask": "Claude, I'd love to discuss how AI-powered verification can help WeFund scale your funding operations while maintaining the fast turnaround your clients expect — could we grab 15 minutes this week?",
    "notes": "Led by Claude Darmony, President. BBB accredited since 2020. Fort Lauderdale, FL. $5K-$2M funding range. Real estate background. SBA program involvement. 95% same-day funding. Cash flow based underwriting, no credit check. Operates through wefundeasy.com. ISO and broker partnerships plus direct. Good credentials for a serious conversation.",
    "contacts": [
      {
        "n": "Claude Darmony",
        "t": "President"
      }
    ],
    "source": ["p4-wave9-researched"]
  },
  {
    "id": 1443,
    "name": "West Clara Funding LLC",
    "desc": "West Clara Funding LLC is a New York City-based fintech company headquartered at 25 Broadway, Floor 9, New York, NY 10004, with over a decade of industry expertise and a team of 25 dedicated professionals. The company delivers a comprehensive range of financial solutions including advanced financial analytics, Strategic Credit Lines (SCL), SBA loans, Life Collateral, Business Lines of Credit, Private/Hard Money Lending, Equipment Financing, Invoice Factoring, inventory loans, and short-term loans.\n\nWest Clara Funding was incorporated in New York (OpenCorporates entity #5500165) and positions itself as a fintech company rather than a traditional lender, emphasizing cutting-edge financial solutions and helping business owners build business credit. The company requires no personal credit check or personal guarantee, offering competitive rates and flexible terms across its extensive product lineup.",
    "category": "funder",
    "employees": 25,
    "website": "https://www.westclarafunding.com",
    "location": "New York, NY",
    "full_address": "25 Broadway, Floor 9, New York, NY 10004",
    "leaders": [
      {
        "n": "Unknown",
        "t": "CEO/Founder",
        "bg": "West Clara Funding leadership has built a fintech operation with 25 professionals and over a decade of industry expertise, offering diverse financial products from SBA loans to equipment financing from their Manhattan headquarters at 25 Broadway.",
        "hooks": [
          "West Clara's positioning as a fintech rather than a traditional lender is interesting — how does technology differentiate your underwriting?",
          "The breadth of your product lineup from SBA loans to hard money lending to invoice factoring is impressive — what's your primary revenue driver?",
          "A decade of experience and 25 professionals in a prime Manhattan location suggests a serious operation — how has the business evolved?",
          "Helping businesses build credit with no personal guarantee is a strong value proposition — how does that model work?"
        ],
        "li": ""
      }
    ],
    "news": [
      {
        "h": "West Clara Funding Continues Fintech Lending Operations from Manhattan",
        "s": "Company Profile, 2025",
        "d": "West Clara Funding maintains its diversified lending operations from 25 Broadway in New York City, offering SBA loans, equipment financing, factoring, and more."
      },
      {
        "h": "New York Fintech Lenders Expand Small Business Financing Options",
        "s": "Industry Reports, 2025",
        "d": "NYC-based fintech lenders like West Clara Funding continue expanding their product offerings to serve small businesses with diverse financing needs."
      }
    ],
    "ice": "West Clara Funding's positioning as a fintech with over a decade of expertise and 25 professionals on the team — from your prime 25 Broadway office — suggests you're building something substantial in the small business lending space.",
    "icebreakers": [
      "Your diverse product lineup spanning SBA loans to hard money lending to factoring shows impressive breadth from a single platform.",
      "The fintech positioning with no personal credit check or guarantee is a compelling value proposition for small business owners.",
      "A decade of experience in the alternative lending space means you've navigated multiple economic cycles — that's valuable institutional knowledge.",
      "The 25 Broadway headquarters puts you in the heart of New York's financial district — a strong signal of credibility."
    ],
    "tp": [
      "HyperVerge's AI-powered verification can help West Clara Funding automate KYC/KYB across your diverse product lines — from SBA loans to MCAs to equipment financing — with a single integration.",
      "With no personal credit check in your model, robust identity verification and business authentication become even more critical — our AI platform handles both seamlessly.",
      "Our technology, trusted by 450+ MCA companies, can help West Clara Funding maintain fast underwriting across your extensive product lineup while catching fraudulent applications."
    ],
    "ask": "I'd love to connect with West Clara Funding's leadership to explore how AI-powered verification can streamline operations across your diverse lending products — could we schedule a 15-minute introduction?",
    "notes": "25 Broadway, Floor 9, NYC. 25 employees. 10+ years experience. Fintech positioning. Diverse product line: SBA, hard money, factoring, equipment, MCAs. No personal guarantee model. OpenCorporates entity #5500165. Not to be confused with Clara Capital (different company). Leadership not publicly identified. Strong product breadth could mean complex underwriting needs — good fit for unified verification platform.",
    "contacts": [
      {
        "n": "Contact",
        "t": "Via westclarafunding.com"
      }
    ],
    "source": ["p4-wave9-researched"]
  }
]