[
  {
    "id": 1281,
    "name": "Kodiak Funding",
    "leaders": [
      {
        "n": "Lud Papp",
        "t": "Owner & CEO",
        "bg": "Founded Kodiak Funding in 2018 as a merchant cash advance direct lender specializing in micro-advances. Holds a Bachelor of Science in Hospitality Management from Penn State University (2006-2010). Skills include merchant cash advance underwriting, data analysis, risk analysis, data modeling, and credit analysis. Transitioned from hospitality to financial services entrepreneurship, building Kodiak into a focused micro-advance provider serving small-to-medium businesses.",
        "hooks": [
          "Penn State Hospitality Management graduate turned MCA entrepreneur",
          "Built a niche micro-advance model funding $1,500-$10,000 deals",
          "Pays ISOs 12 points commission plus full renewal payouts"
        ],
        "li": "https://www.linkedin.com/in/ludpapp/"
      }
    ],
    "desc": "Kodiak Funding is a privately held merchant cash advance direct lender headquartered in Melville, New York, founded in 2018. The company specializes in micro-advances ranging from $1,500 to $10,000, serving small-to-medium sized business owners who need working capital. Kodiak also offers receivables financing. The company operates an ISO partner program offering 12 points commission on all deals with bonus incentives based on volume and full commission payout on renewals. Kodiak is a small operation with 2-10 employees focused on the micro-advance niche of the MCA market.",
    "news": [
      {
        "h": "Kodiak Funding continues to operate as a micro-advance MCA direct lender in the New York market",
        "s": "Company Website",
        "d": "2025-01-01"
      }
    ],
    "location": "Melville, New York",
    "full_address": "Melville, NY 11747",
    "website": "https://www.kodiakfunding.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1282,
    "name": "Kreative Capital Global",
    "leaders": [],
    "desc": "Kreative Capital Global is a business funding company operating in the merchant cash advance and alternative lending space. The company appears to be a smaller or newer entrant in the MCA market. Very limited public information is available — the company does not appear in major industry directories such as FunderIntel or deBanked, and no LinkedIn company profile or ZoomInfo listing could be found. No leadership team, funding details, or operational metrics are publicly available.",
    "news": [],
    "location": "United States",
    "full_address": "",
    "website": "",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1283,
    "name": "Krown Capital Group Inc.",
    "leaders": [
      {
        "n": "Eric Gokstein",
        "t": "President",
        "bg": "Serves as President of Krown Capital Group Inc., which he helped establish in 2019 in Hauppauge, New York. Previously associated with RBS Funding. Under his leadership, Krown Capital has achieved BBB accreditation and top-rated scores on Trustpilot. Focuses on providing merchant cash advance funding to small businesses with same-day working capital solutions.",
        "hooks": [
          "Previously at RBS Funding before founding Krown Capital",
          "BBB accredited with top Trustpilot ratings",
          "Built same-day funding operation serving SMBs since 2019"
        ],
        "li": "https://www.linkedin.com/in/eric-gokstein-21009459"
      }
    ],
    "desc": "Krown Capital Group Inc. is a BBB-accredited small business funding company headquartered in Hauppauge, New York, incorporated on October 21, 2019. The company operates as both a direct funder and strategic partner, specializing in merchant cash advances that allow clients to secure working capital in 24 hours or less. Krown Capital simplifies the funding process with a one-page application and quick approvals, primarily serving businesses with at least six months of operation. The company maintains top-rated scores on Trustpilot and emphasizes transparent, straightforward lending without hidden terms. Founded in 2018 per some sources, with formal incorporation in 2019.",
    "news": [
      {
        "h": "Krown Capital Group maintains BBB accreditation and top-rated Trustpilot reviews",
        "s": "BBB / Trustpilot",
        "d": "2025-01-01"
      }
    ],
    "location": "Hauppauge, New York",
    "full_address": "527 Townline Rd, Hauppauge, NY 11788",
    "website": "https://krowncapital.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1284,
    "name": "Lanafi",
    "leaders": [
      {
        "n": "Ben Sanders",
        "t": "CEO",
        "bg": "Serves as CEO of App Funding Beta LLC, which operates the Lanafi merchant cash advance platform. Based in New York. Leads a company focused on providing tailored financing solutions including merchant cash advances ranging from $10,000 to $5 million. Oversees both the direct funding operations and the ISO Partner Program.",
        "hooks": [
          "Runs dual-brand operation: App Funding Beta and Lanafi",
          "Offers MCA funding up to $5 million through fintech-style platform",
          "Built ISO Partner Program for collaborative deal flow"
        ],
        "li": "https://www.linkedin.com/company/app-funding-beta-llc"
      },
      {
        "n": "Yosef Zavulunov",
        "t": "Director",
        "bg": "Serves as a director at App Funding Beta LLC, the parent entity behind the Lanafi platform. Based in New York. Involved in the company's merchant cash advance operations and business development.",
        "hooks": [
          "New York-based director at the App Funding Beta / Lanafi operation"
        ],
        "li": "https://www.linkedin.com/in/yosef-zavulunov-8a98305b/"
      },
      {
        "n": "David Levin",
        "t": "ISO Representative",
        "bg": "Seasoned ISO representative working with App Funding Beta LLC. Based in New York. Focuses on business development and partner relationships for the Lanafi MCA platform.",
        "hooks": [
          "Experienced ISO rep building deal flow for the Lanafi/App Funding Beta platform"
        ],
        "li": "https://www.linkedin.com/in/david-levin-b1a0aa28a/"
      }
    ],
    "desc": "Lanafi is a merchant cash advance platform operated by App Funding Beta LLC, headquartered in New York City. The company provides tailored financing solutions for small businesses, offering merchant cash advances ranging from $10,000 to $5 million. Lanafi operates a six-step funding process (Application, Assessment, Approval, Agreement, Funding, Repayment) and maintains an ISO Partner Program to drive deal flow. App Funding Beta LLC is registered with the BBB in New York as a factoring service. The company positions itself as a fintech-forward MCA provider with a streamlined digital application process, differentiating from traditional MCA funders through its technology-enabled approach.",
    "news": [
      {
        "h": "App Funding Beta LLC (Lanafi) operates as MCA funder with ISO partner program in New York",
        "s": "BBB / Company Website",
        "d": "2025-01-01"
      }
    ],
    "location": "New York, New York",
    "full_address": "29 West 36th St, New York, NY 10018",
    "website": "https://lanafi.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1285,
    "name": "Launch Financial Group",
    "leaders": [
      {
        "n": "Christian Dickinson",
        "t": "Mortgage Investment Banker",
        "bg": "Serves as a Mortgage Investment Banker at Launch Financial Group in Ballston Lake, New York. Works with real estate investors and small business owners to secure DSCR loans, bridge loans, hard money loans, and other non-traditional financing products. Part of a team with over 70 years of combined mortgage lending experience.",
        "hooks": [
          "Specializes in DSCR and hard money loans for real estate investors",
          "Part of team with 70+ years of combined mortgage lending experience"
        ],
        "li": "https://www.linkedin.com/company/launch-financial-group"
      }
    ],
    "desc": "Launch Financial Group is a mortgage lending company headquartered in Ballston Lake, New York, specializing in financing for real estate investors and small business owners. The company offers DSCR loans, bridge loans, hard money loans, bank statement mortgages, commercial real estate loans, fix-and-flip loans, renovation loans, mixed-use property loans, and Airbnb financing. With over 70 years of combined experience, the team focuses on serving independent real estate investors, self-employed entrepreneurs, and small business owners who often do not qualify for traditional bank loans. Note: Launch Financial Group is primarily a real estate/mortgage lender rather than a merchant cash advance funder. Its classification as a funder in the MCA space may need verification — it appears to be a real estate financing company.",
    "news": [
      {
        "h": "Launch Financial Group expands access to flexible real estate financing for investors and small business owners",
        "s": "OpenPR",
        "d": "2025-01-01"
      }
    ],
    "location": "Ballston Lake, New York",
    "full_address": "331 Ushers Rd, Suite 106, Ballston Lake, NY 12019",
    "website": "https://www.launchfg.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1287,
    "name": "Lendbug",
    "leaders": [
      {
        "n": "Michael Rafailov",
        "t": "Director, ISO Relations",
        "bg": "Serves as Director of ISO Relations at LendBug, managing partnerships with independent sales organizations. Based in New York. Plays a key role in the company's deal flow by managing ISO partnerships and serving as a primary point of contact for broker relationships. Previously associated with the company's growth from startup in 2021.",
        "hooks": [
          "Manages ISO partner relationships for LendBug's direct lending operation",
          "Key contact for brokers seeking $10K-$500K MCA deals"
        ],
        "li": "https://www.linkedin.com/company/lendbug"
      },
      {
        "n": "Michael Ross",
        "t": "ISO Manager",
        "bg": "Serves as an ISO Manager at LendBug in New York. Manages ISO partner relationships and deal submissions. Contact point for ISOs seeking to partner with LendBug for merchant cash advance funding.",
        "hooks": [
          "ISO contact for LendBug's B/C/D paper acceptance program",
          "Manages deals with 60-minute response time for ISOs"
        ],
        "li": "https://www.linkedin.com/company/lendbug"
      },
      {
        "n": "Kevin Woodley",
        "t": "Senior ISO Manager",
        "bg": "Serves as Senior ISO Manager at LendBug. Focuses on building and managing ISO partnerships for the company's merchant cash advance business. Part of the leadership team driving LendBug's growth in the direct lending space.",
        "hooks": [
          "Senior ISO relationship manager at LendBug direct lending operation"
        ],
        "li": "https://www.linkedin.com/in/kevin-woodley-728049202"
      }
    ],
    "desc": "LendBug is a privately run direct lender based in New York City, founded in February 2021 and incorporated as Lend Bug LLC. The company provides merchant cash advances to small businesses across industries including retail, healthcare, construction, and technology. LendBug accepts B, C, and D paper (not credit-score dependent), with funding amounts from $10,000 to $500,000 and terms up to 140 days. The company positions itself with the tagline 'When Your Bank Says No, LendBug Says Yes!' and differentiates through fast response times (as low as 60 minutes) and its willingness to fund lower-credit borrowers. LendBug has 11-50 employees per LinkedIn and is registered with the BBB as a financial consultants and factoring services firm.",
    "news": [
      {
        "h": "LendBug opens ISO partner program for new independent sales organizations",
        "s": "DailyFunder",
        "d": "2024-01-01"
      },
      {
        "h": "LendBug launches new asset funding program expanding beyond traditional MCA",
        "s": "DailyFunder",
        "d": "2024-06-01"
      }
    ],
    "location": "New York, New York",
    "full_address": "New York, NY 10018",
    "website": "https://lendbug.com",
    "employees": 17,
    "category": "iso"
  },
  {
    "id": 1288,
    "name": "Lendefied",
    "leaders": [
      {
        "n": "Devin Gambino",
        "t": "Founder & CEO",
        "bg": "Founded Lendefied in 2024 as a fee-free business lending marketplace. Pioneered a two-arm business model combining financial technology with fractional executive services — every funded loan includes three months of complimentary executive support (CFO, CEO, CMO). Previously worked in business finance before launching Lendefied. Named to The Top 100 Magazine. Based in the New York City metropolitan area.",
        "hooks": [
          "Named to The Top 100 Magazine as emerging business leader",
          "Invented unique model: MCA loans bundled with 3 months free fractional executive services",
          "Built fee-free lending marketplace with ABA certification"
        ],
        "li": "https://www.linkedin.com/in/devingambino/"
      },
      {
        "n": "Shawn Horning",
        "t": "Co-Founder & President",
        "bg": "Co-founded Lendefied with Devin Gambino. Has six years of experience in the business finance space, having successfully assisted over 600 businesses in growing and thriving by providing access to capital. Previously founded a mobility scooter company serving the elderly and disabled before pivoting to fintech. Attended William Floyd High School. Based in the New York City metropolitan area. Enjoys golf, hiking in the Catskills, and spending time with his dog Marvin.",
        "hooks": [
          "Helped 600+ businesses access capital in six years before co-founding Lendefied",
          "Previously founded a mobility scooter company before pivoting to fintech",
          "Avid golfer and Catskills hiker based in the NYC metro area"
        ],
        "li": "https://www.linkedin.com/in/shawn-horning-50050b1a1/"
      }
    ],
    "desc": "Lendefied Inc. is a fee-free business lending marketplace headquartered in Melville, New York, founded in 2024. The company operates a unique two-arm business model combining financial technology with fractional executive services — every funded loan includes three months of complimentary executive support (CFOs, CEOs, CMOs). Lendefied is certified through the American Bankers Association and offers a range of products including SBA loans, term loans, business lines of credit, equipment financing, business cash advances, accounts receivable financing, and B2B revolving credit facilities. The company differentiates through its no-fee model and post-funding support, working closely with clients throughout the lending process. Lendefied employs approximately 8 people and has been operating since 2024.",
    "news": [
      {
        "h": "Lendefied launches as fee-free business lending marketplace with bundled fractional executive services",
        "s": "Company Website",
        "d": "2024-06-01"
      },
      {
        "h": "Lendefied CEO Devin Gambino featured in The Top 100 Magazine",
        "s": "The Top 100 Magazine",
        "d": "2025-01-01"
      }
    ],
    "location": "Melville, New York",
    "full_address": "200 Broadhollow Rd, Suite 207, Melville, NY 11747",
    "website": "https://www.lendefied.com",
    "employees": 8,
    "category": "funder"
  },
  {
    "id": 1289,
    "name": "Lendora",
    "leaders": [
      {
        "n": "Audrey Koenig",
        "t": "Director of Business Development",
        "bg": "Serves as Director of Business Development at Lendora Capital LLC in Beverly Hills, California. Responsible for ISO partnership development and business growth. Key contact for ISO partners seeking to submit merchant cash advance deals through Lendora's platform.",
        "hooks": [
          "Leads business development from Beverly Hills office for Lendora's MCA operations",
          "Primary contact for ISO partnership inquiries"
        ],
        "li": "https://www.linkedin.com/company/lendora-capital"
      },
      {
        "n": "Benjamin Amar",
        "t": "Director of Business Development",
        "bg": "Serves as Director of Business Development at Lendora Capital LLC. Focuses on building ISO relationships and expanding Lendora's merchant cash advance deal flow. Based in the Los Angeles area and reachable directly at ben@lendora.com.",
        "hooks": [
          "Drives ISO deal flow for Lendora's Beverly Hills-based MCA operation",
          "Directly accessible business development leader for partner outreach"
        ],
        "li": "https://www.linkedin.com/company/lendora-capital"
      }
    ],
    "desc": "Lendora Capital LLC is a merchant cash advance provider headquartered in Beverly Hills, California, founded in 2019. The company offers MCAs ranging from $5,000 to $500,000 with fixed fees (no interest rate or variable APR), repayment terms of 6 to 18 months, and same-day funding for applications completed before 4:15 PM EST. Lendora positions itself as a streamlined alternative to traditional bank loans, with funds direct-deposited as a lump sum into the business bank account. The company maintains an expert team of underwriters and ISO relationship managers focused on fast approvals. Lendora has 1-5 employees per corporate records, though LinkedIn indicates 11-50. The company operates from a Beverly Hills office at 8484 Wilshire Blvd.",
    "news": [
      {
        "h": "Lendora Capital continues MCA operations from Beverly Hills serving small businesses nationwide",
        "s": "Company Website",
        "d": "2025-01-01"
      }
    ],
    "location": "Beverly Hills, California",
    "full_address": "8484 Wilshire Blvd, Beverly Hills, CA 90211",
    "website": "https://lendora.com",
    "employees": 10,
    "category": "iso"
  },
  {
    "id": 1290,
    "name": "LendOut",
    "leaders": [],
    "desc": "LendOut is a business funding company that provides working capital options for small businesses. Operating at lend-out.com, the company offers funding up to $20 million with quick approvals and funds available in as little as 24 hours. LendOut positions itself as a streamlined working capital provider focused on simplifying the funding process with minimal documentation requirements and customized financial support. Very limited public information is available about the company's leadership, founding team, or operational details. No LinkedIn company profile, ZoomInfo listing, or industry directory presence could be identified. The company appears to be a smaller or newer entrant in the merchant cash advance and working capital space.",
    "news": [],
    "location": "United States",
    "full_address": "",
    "website": "https://lend-out.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1291,
    "name": "LendThrive",
    "leaders": [
      {
        "n": "Sundip Patel",
        "t": "CEO & Co-Founder, AVANA Companies",
        "bg": "Co-founded AVANA Companies in 2002 with his brother Sanat Patel. Has grown AVANA into a family of ESG lending and investment platforms including AVANA Capital, LendThrive, AVANA CUSO, and EqualSeat. Recognized as a Most Admired Leader by the Phoenix Business Journal. Oversees LendThrive's fixed-rate small business lending operations alongside AVANA Capital's commercial real estate and SBA lending platforms. Based in Glendale, Arizona.",
        "hooks": [
          "*Recognized as Most Admired Leader by Phoenix Business Journal",
          "Co-founded AVANA Companies with brother Sanat Patel in 2002 — now 20+ years in business",
          "Built ESG-focused lending family spanning real estate, small business, and credit union markets"
        ],
        "li": "https://www.linkedin.com/in/sundippatel/"
      },
      {
        "n": "Sanat Patel",
        "t": "Co-Founder, AVANA Companies",
        "bg": "Co-founded AVANA Companies in 2002 alongside his brother Sundip Patel. Serves in a leadership capacity across AVANA's family of lending and investment platforms. Part of the founding team that has grown AVANA into a diversified ESG lending organization over two decades.",
        "hooks": [
          "Brother-duo co-founder of AVANA Companies alongside Sundip Patel",
          "Part of team that built 20+ year ESG lending and investment platform"
        ],
        "li": "https://www.linkedin.com/company/avana-companies"
      }
    ],
    "desc": "LendThrive is a fintech lending platform founded in 2021 and operated as part of the AVANA Companies family, headquartered in Glendale, Arizona. The company provides fixed-rate small business term loans up to $150,000 designed for short-term working capital and equipment needs. LendThrive offers clear pricing with no prepayment penalties, positioning itself as a transparent alternative to merchant cash advances and variable-rate products. AVANA Companies was founded in 2002 by brothers Sundip and Sanat Patel and has grown into a diversified ESG lending family that includes AVANA Capital (commercial real estate and SBA loans), AVANA CUSO (credit union lending services), LendThrive (small business term loans), and EqualSeat (investment platform). AVANA Companies has been recognized for its cannabis industry lending partnership with Safe Harbor Financial and Partner Colorado Credit Union. Note: LendThrive is a product of AVANA Companies; its connection to Accion Opportunity Fund mentioned in the user brief could not be verified through web research — they appear to be separate organizations operating independently in the small business lending space.",
    "news": [
      {
        "h": "AVANA Companies celebrates 20 years of supporting small business owners across lending platforms",
        "s": "AVANA Capital",
        "d": "2024-06-01"
      },
      {
        "h": "AVANA Companies recognized as finalist for Best FinTech Partnership for Cannabis Lending with Safe Harbor Financial",
        "s": "AVANA Capital",
        "d": "2024-03-01"
      },
      {
        "h": "AVANA Companies CEO Sundip Patel recognized as Most Admired Leader by Phoenix Business Journal",
        "s": "Phoenix Business Journal",
        "d": "2024-01-01"
      }
    ],
    "location": "Glendale, Arizona",
    "full_address": "17235 N 75th Ave, Suite E-145, Glendale, AZ 85308",
    "website": "https://lendthrive.com",
    "employees": 75,
    "category": "funder"
  }
]
