[
  {
    "id": 197,
    "name": "Horizon Business Funding",
    "leaders": [
      {
        "n": "Scott Saxton",
        "t": "President",
        "bg": "Scott Saxton serves as President of Horizon Business Funding, leading the company's operations from Coral Gables, Florida. Before joining Horizon, Scott was a Senior Mortgage Loan Officer at Neighborhood Loans in Lombard. He is a graduate of San Francisco State University and has built a career transitioning from traditional mortgage lending into the alternative business financing space.",
        "hooks": [
          "Transitioned from traditional mortgage lending at Neighborhood Loans to leading an alternative business financing firm",
          "San Francisco State University graduate who relocated to lead operations in Coral Gables, FL",
          "Oversees a company that has provided over $1 billion in total funding across 30,000+ financings"
        ],
        "li": "https://www.linkedin.com/in/scott-saxton-7189b0144/"
      },
      {
        "n": "Nate Leonard",
        "t": "Funding Director",
        "bg": "Nate Leonard serves as Funding Director at Horizon Business Funding, operating from the Coral Gables office. He plays a key role in managing the company's funding operations and client relationships, helping to facilitate the firm's merchant cash advance and alternative lending products for small businesses nationwide.",
        "hooks": [
          "Leads funding operations for a company that helped provide over $4 billion through the PPP program in 2020-2021",
          "Based in Coral Gables, FL overseeing funding for businesses across hundreds of industries"
        ],
        "li": "https://www.linkedin.com/in/nate-leonard-b73b06312/"
      },
      {
        "n": "Mike Masiello",
        "t": "Senior Funding Manager",
        "bg": "Mike Masiello is a Senior Funding Manager at Horizon Business Funding in New York. He brings experience from previous roles at Corporate Turnaround, Business Debt Help LLC, and Taylor Consulting and Contracting. His background in corporate turnaround and business debt advisory gives him a unique perspective on small business financing needs.",
        "hooks": [
          "Background in corporate turnaround and business debt advisory before joining the MCA industry",
          "Based in the New York City office on William Street in the Financial District",
          "Previous experience at Business Debt Help LLC gives insight into borrower challenges"
        ],
        "li": "https://www.linkedin.com/in/mike-masiello-587a5a46/"
      }
    ],
    "desc": "Horizon Business Funding is a merchant cash advance and alternative lending company founded in 2011, headquartered in Coral Gables, Florida with an additional office at 27 William Street in New York City's Financial District. The company was founded by a team of pioneers from the alternative lending industry who recognized that small business owners were underserved by traditional banks. Horizon has provided over $1 billion in total funding across 30,000+ financings in hundreds of industries, and during 2020-2021, helped provide over $4 billion in funding to 110,000+ businesses through the Paycheck Protection Program (PPP). The company requires only 1 year of business history and no personal guarantees or collateral, with factor rates ranging from 1.1 to 1.5. Horizon's relationship-based underwriting approach emphasizes getting to know clients personally. The company has estimated annual revenue of $5.3 million and approximately 23-51 employees.",
    "news": [
      {"h": "Horizon Business Funding Announces Successful Relationship-Based Underwriting", "s": "Yahoo Finance", "d": "Horizon announced its relationship-based underwriting model focusing on building personal connections with clients, leading to strong repeat funding rates."},
      {"h": "Horizon Business Funding Helps Provide Over $4B Through PPP", "s": "Company Website, 2021", "d": "During 2020-2021, Horizon helped facilitate over $4 billion in Paycheck Protection Program funding to more than 110,000 businesses nationwide."},
      {"h": "Horizon Business Funding Expands Alternative Lending Offerings", "s": "Company Announcement", "d": "The company expanded its product suite beyond MCAs to include business term loans, unsecured working capital, and business credit lines with funding in as little as 24 hours."}
    ],
    "location": "Coral Gables, FL",
    "full_address": "55 Almeria Ave, Coral Gables, FL 33134",
    "website": "https://horizonbusinessfunding.com",
    "employees": 35,
    "category": "funder"
  },
  {
    "id": 198,
    "name": "Empire Merchant Funding",
    "leaders": [
      {
        "n": "Esteban Cascante",
        "t": "Business Development Manager & Loan Originator",
        "bg": "Esteban Cascante has been a Business Development Manager and Loan Originator at Empire Merchant Funding since January 2015. He brings experience from previous roles at Amazon Business, Rosenblum Law, and N3. More recently, he co-founded Prospera Real Estate Lending where he serves as Founder and Operations Manager. He has been active in the alternative lending space for nearly a decade.",
        "hooks": [
          "Has been with Empire Merchant Funding since 2015, bringing nearly a decade of experience in alternative lending",
          "Also co-founded Prospera Real Estate Lending, showing entrepreneurial ambitions beyond his EMF role",
          "Prior experience at Amazon Business and legal firm Rosenblum Law"
        ],
        "li": "https://www.linkedin.com/in/esteban-cascante/"
      }
    ],
    "desc": "Empire Merchant Funding is a business funding company based in Coconut Creek, Florida that offers merchant cash advances, lines of credit, equipment financing, and fix-and-flip loans to businesses of all sizes nationwide. The company positions itself as a leading provider of business funding solutions, focusing on the overall health and potential of businesses rather than traditional financial metrics alone. Empire Merchant Funding works with businesses across a wide variety of industries and credit backgrounds, including those with past payment issues. The company operates as a broker/ISO, matching businesses with funding products from its network of lending partners rather than funding from its own balance sheet. Note: Empire Merchant Funding is a separate entity from Empire Funding Group (Scottsdale, AZ) despite the similar names.",
    "news": [
      {"h": "Empire Merchant Funding Expands Services to Include Fix and Flip Loans", "s": "Company Website", "d": "Empire Merchant Funding broadened its product offerings to include fix-and-flip loans alongside its existing MCA, lines of credit, and equipment financing products."},
      {"h": "Empire Merchant Funding Customer Reviews Mixed on Trustpilot", "s": "Trustpilot", "d": "The company maintains a presence on Trustpilot with customer reviews highlighting both positive service experiences and some concerns about communication."}
    ],
    "location": "Coconut Creek, FL",
    "full_address": "5379 Lyons Rd, Coconut Creek, FL 33073",
    "website": "https://www.empiremerchantfunding.com",
    "employees": 10,
    "category": "iso"
  },
  {
    "id": 199,
    "name": "Empire Funding Group",
    "leaders": [],
    "desc": "Empire Funding Group is a business funding company headquartered in Scottsdale, Arizona that has helped over 10,000 businesses secure more than $300 million in funding. The company offers merchant cash advances, equipment financing and leasing (up to $150,000), and other working capital solutions. To qualify, businesses need at least six months of operating history, a FICO score of 500+, a business bank account, and minimum monthly deposits of $8,000. The company touts a simplified one-page application process with funding available in as little as 24 hours. Empire Funding Group operates as an ISO/broker, connecting businesses with funding sources rather than lending from its own balance sheet. Note: This is a separate company from Empire Merchant Funding (Coconut Creek, FL) despite the similar branding in the business funding space.",
    "news": [
      {"h": "Empire Funding Group Surpasses $300 Million in Business Funding", "s": "Company Website", "d": "The company announced it has helped over 10,000 businesses secure more than $300 million in total funding across various industries."},
      {"h": "Empire Funding Group Expands Equipment Financing Program", "s": "Company Website", "d": "The company expanded its equipment financing and leasing program offering up to $150,000 with a lowest payment guarantee and no down payment requirement."}
    ],
    "location": "Scottsdale, AZ",
    "full_address": "6617 N Scottsdale Rd, Scottsdale, AZ 85250",
    "website": "https://empirefundinggroup.us",
    "employees": 10,
    "category": "iso"
  },
  {
    "id": 200,
    "name": "American Capital Advance",
    "leaders": [
      {
        "n": "Sam Zietz",
        "t": "Manager / Co-Founder",
        "bg": "Sam Zietz is a serial entrepreneur and the founder and CEO of TouchSuite, a financial technology company launched in 2003 in Boca Raton. He also serves as CEO of GRUBBRR, a self-ordering technologies company. Before his entrepreneurial career, Zietz was a corporate attorney at Skadden, Arps, Slate, Meagher and Flom specializing in structured finance, and previously worked at PricewaterhouseCoopers in business tax planning. He earned his BS from the University of Michigan, JD from St. Thomas University School of Law (first in class), and LLM in Taxation from NYU School of Law. Named EY Entrepreneur of the Year in Florida in 2015.",
        "hooks": [
          "Former Skadden Arps attorney turned fintech entrepreneur who founded TouchSuite in 2003",
          "Won EY Entrepreneur of the Year award in Florida in 2015",
          "Also serves as CEO of GRUBBRR, a self-ordering technology company",
          "Graduated first in class from St. Thomas University School of Law with a subsequent LLM from NYU"
        ],
        "li": "https://www.linkedin.com/in/samzietz/"
      }
    ],
    "desc": "American Capital Advance is a merchant cash advance company based in Boca Raton, Florida, incorporated in 2005. The company provides factoring services to merchants by advancing funds based on a purchase of future accounts receivable from MC/VISA accounts. American Capital Advance is not a bank and does not loan money; rather, it invests in small and medium-sized enterprises with growth potential and the capacity to ensure a steady revenue stream. To qualify, businesses need at least one year of operating history, active credit card transaction processing, and average monthly credit card sales of $2,500 or higher. The company can advance up to $150,000 or more in working capital. The company is managed by Sam Zietz, who is also known as the founder of fintech company TouchSuite and CEO of GRUBBRR.",
    "news": [
      {"h": "American Capital Advance Continues MCA Operations from Boca Raton", "s": "BBB, Manta", "d": "The company maintains active operations from its Boca Raton headquarters, providing merchant cash advance services to small businesses nationwide since 2005."},
      {"h": "Sam Zietz Named South Florida Ultimate CEO", "s": "South Florida Business Journal", "d": "Sam Zietz, who manages American Capital Advance, was recognized as one of South Florida's Ultimate CEOs by the South Florida Business Journal for his leadership across multiple ventures."}
    ],
    "location": "Boca Raton, FL",
    "full_address": "1081 Holland Dr, Boca Raton, FL 33487",
    "website": "http://americancapitaladvance.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 201,
    "name": "Diamond Business Loans",
    "leaders": [
      {
        "n": "Jonathan Kohanoff",
        "t": "Founder & President",
        "bg": "Jonathan Kohanoff is the Founder and President of Diamond Business Loans, established in 2014. His career began as a Branch Manager at Wells Fargo before transitioning to an AVP role at 1st Century Bank. He also founded Ezbanker and has served on the Board of Directors of the Better Business Bureau (Los Angeles & Silicon Valley chapter). Kohanoff is a graduate of California State University-Northridge and has built extensive experience in financial services and business lending.",
        "hooks": [
          "Started career as a Wells Fargo Branch Manager before founding Diamond Business Loans in 2014",
          "Serves on the Board of Directors of the Better Business Bureau (LA & Silicon Valley)",
          "California State University-Northridge graduate who also founded fintech venture Ezbanker",
          "Pioneer in cannabis industry lending, providing financing to dispensaries and grow operations"
        ],
        "li": "https://www.linkedin.com/in/jonathankohanoff/"
      }
    ],
    "desc": "Diamond Business Loans is a nationally recognized business financing company established in 2014 and headquartered in Beverly Hills, California. Founded by Jonathan Kohanoff, the company operates as a direct lender, syndicate, and brokerage office, lending nationwide across a wide range of industries. Diamond Business Loans offers commercial loan programs ranging from $5,000 to over $5 million, including unsecured business loans, business lines of credit, equipment financing and leasing, SBA loans, merchant cash advances, debt restructuring, business acquisition financing, franchise financing, medical working capital loans, and commercial real estate financing. Notably, the company is one of the few lenders offering cannabis industry financing, funding dispensaries, grow operations, wholesale, retail, and edibles businesses. The company does not charge application or professional service fees and has been BBB accredited since August 2015. Diamond Business Loans has 10-49 employees and is composed of highly experienced financial professionals.",
    "news": [
      {"h": "Diamond Business Loans Expands Cannabis Industry Lending", "s": "Leafly, Ganjapreneur", "d": "Diamond Business Loans has become a recognized lender in the cannabis industry, offering financing programs for dispensaries, grow operations, and related businesses through its Beverly Hills office."},
      {"h": "Diamond Business Loans Maintains Strong BBB Accreditation", "s": "Better Business Bureau, 2015-present", "d": "The company has maintained its BBB accreditation since August 2015, reflecting consistent business practices and customer service standards."},
      {"h": "Diamond Business Loans Featured on Clutch as Top Financial Services Provider", "s": "Clutch", "d": "The company was featured on Clutch.co as a business financing provider, highlighting its range of lending products and nationwide reach from its Beverly Hills headquarters."}
    ],
    "location": "Beverly Hills, CA",
    "full_address": "325 N Maple Dr, Ste 17777, Beverly Hills, CA 90209",
    "website": "https://www.diamondbl.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 202,
    "name": "Pacific Business Capital Corporation",
    "leaders": [
      {
        "n": "Dianna Dodge",
        "t": "Chief Executive Officer",
        "bg": "Dianna Dodge serves as Chief Executive Officer of Pacific Business Capital Corporation in Costa Mesa, California. She leads the company's operations in secured commercial real estate bridge lending, overseeing a portfolio of bridge loans ranging from $500,000 to over $3 million. Dodge holds an Associate of Arts degree from Orange Coast College and has built her career in the commercial real estate lending space.",
        "hooks": [
          "Leads a commercial real estate bridge lender founded in 1989 with over 35 years of operational history",
          "Orange Coast College graduate who rose to CEO of a specialized bridge lending firm",
          "Manages a direct lending operation providing $500K to $3M+ secured bridge loans nationwide"
        ],
        "li": "https://www.linkedin.com/in/dianna-dodge-8b6b092a"
      },
      {
        "n": "Mark Witt",
        "t": "Manager, Marketing",
        "bg": "Mark Witt serves as Manager of Marketing at Pacific Business Capital Corporation in Costa Mesa, California. He handles the company's marketing strategy and client outreach for PBCC's secured commercial real estate bridge loan products, helping to connect commercial and industrial borrowers with the firm's lending solutions across the United States.",
        "hooks": [
          "Manages marketing for a niche bridge lender with over 35 years in the commercial real estate space",
          "Based in Costa Mesa, CA supporting PBCC's nationwide lending operations"
        ],
        "li": "https://www.linkedin.com/in/mark-witt-545bb812/"
      }
    ],
    "desc": "Pacific Business Capital Corporation (PBCC) is a direct commercial real estate bridge lender founded in 1989 and headquartered in Costa Mesa, California. With over 35 years of experience, PBCC specializes in providing one to three year secured bridge loans ranging from $500,000 to over $3 million to commercial and industrial companies and individuals across the United States. All loans are secured by commercial or industrial properties. As a direct lender, PBCC ensures timely evaluations and tailored financing solutions for clients' specific needs, covering use cases including business financing, acquisition financing, recapitalization, rehabilitation, renovation, principal buyout, and refinance. The company operates with 2-10 employees and focuses exclusively on the commercial real estate bridge lending niche rather than the merchant cash advance or small business lending sector.",
    "news": [
      {"h": "Pacific Business Capital Corporation Continues 35+ Year Legacy in Bridge Lending", "s": "Company Website", "d": "PBCC continues to operate as a direct bridge lender providing secured commercial real estate loans, maintaining its position as a niche lender since its founding in 1989."},
      {"h": "PBCC Featured on PitchBook as Active Commercial Real Estate Advisor", "s": "PitchBook", "d": "Pacific Business Capital Corporation is profiled on PitchBook as an active advisor in the commercial real estate financing space, providing bridge loans secured by commercial and industrial properties."}
    ],
    "location": "Costa Mesa, CA",
    "full_address": "245 Fischer Ave, Ste A1, Costa Mesa, CA 92626",
    "website": "https://pbcc.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 203,
    "name": "Champion Business Capital",
    "leaders": [],
    "desc": "Champion Business Capital is a business financing marketplace headquartered in Cranford, New Jersey that connects small businesses with a network of 75+ trusted lenders. The company is not a bank but rather an Alternative Financial Service Provider that operates as a lending marketplace, matching borrowers with the best financing options available from its lender network. Champion offers working capital, lines of credit, equipment financing, and SBA loans with quick approvals, same-day funding potential, no upfront costs, and no credit impact from applying. The company provides dedicated Business Financing Advisors at no cost to work with customers through the financing process. Despite describing itself as a 'marketplace,' Champion Business Capital functions primarily as an ISO/broker, earning commissions by connecting borrowers to funders rather than lending from its own balance sheet. The company uses fintech-driven processes for fast application and matching.",
    "news": [
      {"h": "Champion Business Capital Expands Lender Network to 75+ Partners", "s": "Company Website", "d": "Champion Business Capital grew its marketplace network to over 75 trusted lenders, offering businesses more financing options with competitive terms and same-day funding availability."},
      {"h": "Champion Business Capital Launches No-Impact Credit Application Process", "s": "Company Website", "d": "The company introduced an application process that does not impact the applicant's credit score, with no application fees and no obligations, making it easier for small businesses to explore financing options."}
    ],
    "location": "Cranford, NJ",
    "full_address": "Cranford, NJ 07016",
    "website": "https://www.championbusinesscapital.com",
    "employees": 8,
    "category": "iso"
  },
  {
    "id": 204,
    "name": "Zeus Commercial Capital",
    "leaders": [
      {
        "n": "Thomas Moore",
        "t": "President & CEO",
        "bg": "Thomas Moore serves as President and CEO of Zeus Commercial Capital, a commercial financing brokerage firm. He leads the company's operations in matching businesses with lending solutions from its network of top-tier financial institutions. Moore has built Zeus Commercial Capital into a multi-product commercial financing brokerage offering SBA loans, commercial real estate loans, equipment financing, invoice factoring, and merchant cash advances across all 50 states.",
        "hooks": [
          "Built Zeus Commercial Capital as a multi-product commercial financing brokerage serving all 50 states",
          "Leads a firm that explicitly positions itself as a 'trusted brokerage firm' working with multiple financial institutions",
          "Oversees a product lineup spanning SBA loans, CRE loans, equipment financing, invoice factoring, and MCAs"
        ],
        "li": "https://www.linkedin.com/in/zeuscommercial/"
      }
    ],
    "desc": "Zeus Commercial Capital is a commercial financing brokerage firm led by Thomas Moore that provides access to a wide range of funding options from $10,000 to $5 million. The company explicitly describes itself as a 'trusted brokerage firm' that works with a variety of financial institutions to match borrowers with the best possible lender for their needs. Zeus Commercial Capital offers SBA loans, USDA loans, commercial real estate loans, equipment financing, invoice factoring, lines of credit, merchant cash advances, fix-and-flip loans, DSCR loans, and HELOC products. The company operates multiple web domains (zeuscommercialcapital.com, zeus-commercial.com, zcc.loans, zeusmca.com) and serves businesses across all 50 states. Most clients receive funding within 24-48 hours of approval, with some receiving same-day funding. The company evaluates applications holistically, considering factors beyond credit scores.",
    "news": [
      {"h": "Zeus Commercial Capital Expands Multi-Product Financing Platform", "s": "Company Website", "d": "Zeus Commercial Capital expanded its commercial financing offerings to include Fix & Flip Loans, DSCR Loans, and HELOC products through its Zeus Capital Hub platform."},
      {"h": "Zeus Commercial Capital Launches New Online Presence with Multiple Domains", "s": "Company Website", "d": "The company expanded its digital presence across multiple domains (zeuscommercialcapital.com, zeus-commercial.com, zcc.loans) to serve different market segments in the commercial financing space."}
    ],
    "location": "United States",
    "full_address": "United States (exact address not publicly listed)",
    "website": "https://zeuscommercialcapital.com",
    "employees": 5,
    "category": "iso"
  },
  {
    "id": 205,
    "name": "Apollo Capital Group",
    "leaders": [],
    "desc": "Apollo Capital Group LLC is a business lending platform founded in 2022 and based in Freehold, New Jersey. The company operates as an online marketplace platform offering diversified loans for businesses, including lines of credit, merchant cash advances, term loans, SBA loans, asset-based funding, equipment financing, and credit repair services. Apollo Capital Group's technology platform connects to dozens of data sources, automatically processing hundreds of data points on a business in seconds, reducing the traditional lending process from weeks or months to hours. The company emphasizes same-day funding capabilities and fast, flexible small business loans. While Apollo Capital Group uses marketplace technology to match borrowers with products, as a small, recently founded company it likely operates as an ISO/broker connecting businesses to funders rather than lending from its own balance sheet. Contact: ceo@apollocapitalgroupllc.com, phone (732) 520-2890.",
    "news": [
      {"h": "Apollo Capital Group Launches Online Lending Platform in Freehold, NJ", "s": "Tracxn, 2022", "d": "Apollo Capital Group was founded in 2022 as an online platform offering diversified loans for businesses, leveraging technology to process applications and deliver funding within hours."},
      {"h": "Apollo Capital Group Introduces Automated Data Processing for Small Business Lending", "s": "Company Website", "d": "The company launched a technology platform that connects to dozens of data sources and processes hundreds of data points on a business in seconds, enabling same-day funding decisions."}
    ],
    "location": "Freehold, NJ",
    "full_address": "Freehold, NJ 07728",
    "website": "https://apollocapitalgroupllc.com",
    "employees": 5,
    "category": "iso"
  },
  {
    "id": 206,
    "name": "Mercury Business Funding",
    "leaders": [],
    "desc": "Mercury Business Funding is a European-focused merchant cash advance provider that has been supporting small and medium enterprises (SMEs) across Europe for over a decade. The company offers short to medium-term (up to 1 year) business funding facilities ranging from 1,000 to 1,000,000 euros for businesses that accept card payments through terminals or online for at least 3 months. Mercury Business Funding operates as a direct funder with a revenue-based repayment model where repayments are automatically deducted as a percentage of card sales, aligning payments with business performance. The company serves retail brands with multiple locations across Europe, helping them acquire new locations, upgrade existing stores, and manage inventory. Funds can be received within seven working days of approval. Unlike many similarly-named companies, Mercury Business Funding is specifically focused on the European market and uses euros as its primary currency, distinguishing it from Mercury (the US fintech bank) and Mercury Funding LLC (US-based MCA).",
    "news": [
      {"h": "Mercury Business Funding Celebrates Over a Decade Supporting European SMEs", "s": "Company Website", "d": "Mercury Business Funding marked over 10 years of providing customized funding solutions to small and medium enterprises across Europe, helping businesses achieve their growth goals."},
      {"h": "Mercury Business Funding Expands Retail Brand Partnerships", "s": "Company Website", "d": "The company expanded its focus on serving retail brands with multiple locations across Europe, offering tailored funding solutions for store acquisitions, upgrades, and inventory management."}
    ],
    "location": "Europe",
    "full_address": "Europe (exact address not publicly listed)",
    "website": "https://mercurybusinessfunding.com",
    "employees": 15,
    "category": "funder"
  }
]
