[
  {
    "id": 1349,
    "name": "Palm Beach Capital Funding",
    "leaders": [
      {
        "n": "Dan Lounsbury",
        "t": "CEO & Founder",
        "bg": "Founded Palm Beach Capital Funding in March 2019 through his Family Office. Based in Palm Beach, FL. The Dan Lounsbury Family Office announced the launch of PBCF as a new venture dedicated to originating and sourcing loans for small and medium-sized businesses across the United States. Also launched an Ultra High Net Worth (UHNW) division in the Cayman Islands in October 2024. Listed as Managing Director of Palm Beach Capital Funding at IVYFON December 2024 event. Background spans family office investing and financial services across multiple asset classes.",
        "hooks": [
          "Launched UHNW division in Cayman Islands in late 2024",
          "Spoke at IVYFON December 2024 forum as PBCF Managing Director",
          "Built PBCF from his personal Family Office venture"
        ],
        "li": "https://www.linkedin.com/in/danlounsbury/"
      }
    ],
    "desc": "Palm Beach Capital Funding (PBCF) is a small business lending company founded in March 2019 by the Dan Lounsbury Family Office, headquartered in Lake Worth, FL with an additional office in Boca Raton. The company provides small and medium-sized companies with a variety of debt instruments and financial products including working capital loans, with approval in as little as 2-5 business hours and funding in as little as 1 business day. PBCF has an in-house communication center giving Funding Advisors and underwriters instant access to information needed for quick decisions. The company funds businesses across the United States and is operated by a team of seasoned entrepreneurs focused on helping companies grow and expand. Approximately 11-50 employees.",
    "news": [
      {
        "h": "Dan Lounsbury Family Office launches Ultra High Net Worth division in Cayman Islands",
        "s": "Dan Lounsbury Press",
        "d": "2024-10-01"
      },
      {
        "h": "Dan Lounsbury presents at IVYFON December 2024 Forum as PBCF Managing Director",
        "s": "IVYFON",
        "d": "2024-12-01"
      }
    ],
    "location": "Lake Worth, FL",
    "full_address": "2431 10th Ave N, Lake Worth, FL 33461",
    "website": "https://www.palmbchcap.com",
    "employees": 25,
    "category": "funder"
  },
  {
    "id": 1350,
    "name": "Pathway Catalyst Partners",
    "leaders": [
      {
        "n": "Thomas Chillemi",
        "t": "Founder & CEO",
        "bg": "Founded Pathway Catalyst Partners in New York. Brings over 15 years of experience in small business funding and financial strategy. Prior experience includes roles at Harvest Lending Inc, Harvest Processing Inc, Diamond Capital Funding, and HERMAN & CO REAL ESTATE. Has helped over 1,000 entrepreneurs secure fast, flexible capital to grow, recover, and scale their businesses. Reports $50M+ in funding secured with a 92% client success rate.",
        "hooks": [
          "$50M+ in funding secured for small businesses",
          "Over 1,000 successful business transformations",
          "Background spanning Harvest Lending, Diamond Capital Funding, and real estate"
        ],
        "li": "https://www.linkedin.com/in/thomas-chillemi-5ba2b412b/"
      },
      {
        "n": "Andres Varela",
        "t": "Funding Specialist",
        "bg": "Serves as Funding Specialist at Pathway Catalyst Partners in New York. Works directly with business owners to assess their financial needs and match them with appropriate funding solutions from the company's diverse product portfolio including SBA loans, equipment financing, and revenue-based financing.",
        "hooks": [
          "Hands-on funding specialist working directly with entrepreneurs",
          "Specializes in matching businesses to optimal capital solutions"
        ],
        "li": "https://www.linkedin.com/in/andres-varela-66073a340/"
      }
    ],
    "desc": "Pathway Catalyst Partners is a direct funding company based in New York City at 260 West 35th Street, 14th Floor, offering comprehensive financial solutions for small and large businesses. Founded by Thomas Chillemi, the company's mission is to empower business owners to achieve their unique financial goals through tailored financial solutions. They offer SBA Loans, Equipment Financing, Revenue-Based Financing, Lines of Credit, Term Loans, and Residential/Commercial Mortgage purchase and refinancing. With over 15 years of experience in small business funding, they report 1,000+ successful business transformations, a 92% client success rate, and $50M+ in funding secured. The company matches clients with the right lenders and provides ongoing support for long-term success. Approximately 13 employees.",
    "news": [
      {
        "h": "Pathway Catalyst Partners expands SBA loan offerings for small business growth",
        "s": "LinkedIn / Pathway Catalyst",
        "d": "2024-07-01"
      },
      {
        "h": "Pathway Catalyst reports $50M+ in cumulative funding secured for small businesses",
        "s": "Company Website",
        "d": "2025-01-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "260 West 35th St, 14th Floor, New York, NY 10001",
    "website": "https://pathwaycatalyst.com",
    "employees": 13,
    "category": "funder"
  },
  {
    "id": 1351,
    "name": "Payclass Inc.",
    "leaders": [
      {
        "n": "Henry Sinoimeri",
        "t": "CEO & Co-Founder",
        "bg": "Co-founded Payclass Inc. in 2021. Earned a bachelor's degree in Political Science from Syracuse University before entering the construction industry, where he developed expertise in managing, planning, organizing, and budgeting complex projects. Gained firsthand insight into the challenges workers and companies face when payments are delayed, which inspired the creation of Payclass. Brings deep expertise in business process optimization, financial systems, and technology-driven solutions. Has worked with some of the largest companies in the U.S. and around the world, as well as co-founding and scaling startups in supply chain, logistics, and energy efficiency.",
        "hooks": [
          "Syracuse University Political Science graduate",
          "Construction industry background inspired B2B payment platform",
          "Co-founded startups in supply chain, logistics, and energy efficiency"
        ],
        "li": "https://www.linkedin.com/in/henry-sinoimeri/"
      },
      {
        "n": "Jonathan Cherry-Woode",
        "t": "Co-Founder & President",
        "bg": "Co-founded Payclass Inc. in 2021 with Henry Sinoimeri. Expertise in B2B flow of payment processes and systems, business process management, technology implementation, and in-depth understanding of customer needs. Combines operational expertise, financial acumen, and passion for people-first leadership to drive Payclass's mission of creating a more transparent, efficient, and reliable funding experience for capital providers and businesses.",
        "hooks": [
          "B2B payment process systems expert",
          "People-first leadership approach to fintech"
        ],
        "li": "https://www.linkedin.com/in/jonathan-cherry-woode-441113105/"
      },
      {
        "n": "Jackie Vergne",
        "t": "Chief Growth Officer",
        "bg": "Serves as Chief Growth Officer at Payclass. Visionary founder of Vergne Equity with over two decades of transformative leadership in business growth and equity funding. Brings exceptional expertise in scaling companies and driving revenue growth through strategic partnerships and innovative funding mechanisms.",
        "hooks": [
          "Founded Vergne Equity — two decades in business growth and equity funding",
          "Transformative leadership track record across multiple ventures"
        ],
        "li": null
      }
    ],
    "desc": "Payclass Inc. is a fintech company founded in 2021 and headquartered at 28 Liberty Street in New York, NY. The company accelerates B2B payments by operating a private exchange in collaboration with multiple financial institutions including family offices, wealth funds, hedge funds, and private banks. Payclass was built to reduce the friction of capital flow from banks, hedge funds, and family offices into businesses and projects worldwide. The platform offers business loans (long and short term), real estate financing, letters of credit, equipment leases, asset-based loans, and invoice factoring capabilities. Payclass reports over $15 billion in transaction volume and operates across all continents using middleware technology built on the open-source Apache stack. The company can reduce payment turnaround by 2-3 weeks and sometimes pay within one week. Approximately 5 employees.",
    "news": [
      {
        "h": "Payclass reports $15 billion+ in cumulative B2B transaction volume",
        "s": "Payclass Website",
        "d": "2025-01-01"
      },
      {
        "h": "Payclass expands invoice factoring and business lending offerings globally",
        "s": "Crunchbase",
        "d": "2024-01-01"
      }
    ],
    "location": "New York, NY",
    "full_address": "28 Liberty Street, New York, NY 10005",
    "website": "https://www.payclassinc.com",
    "employees": 5,
    "category": "funder"
  },
  {
    "id": 1352,
    "name": "Payplant LLC",
    "leaders": [
      {
        "n": "Neerav Beery",
        "t": "Co-Founder & CEO",
        "bg": "Co-founded Payplant in 2013 with Dr. Ronjon Nag. Previously co-founded and sold Cellmania, an App Store platform, to BlackBerry. Based in Palo Alto, CA. Serial entrepreneur with a background in mobile technology and financial ecosystems. Built Payplant's Pay Me Now digital invoice-financing service to address the challenge of slow-paying customers for small businesses.",
        "hooks": [
          "*Co-founded Cellmania and sold it to BlackBerry",
          "Serial entrepreneur turned SMB invoice financing innovator",
          "Palo Alto-based fintech founder since 2013"
        ],
        "li": null
      },
      {
        "n": "Ronjon Nag",
        "t": "Co-Founder & Co-CEO",
        "bg": "Co-founded Payplant in 2013 with Neerav Beery. Holds a PhD (Dr. Ronjon Nag). Has co-founded, led, and sold companies to Motorola and BlackBerry. Career includes optimizing financial ecosystems in the mobile space and providing strategic consulting to banks and financial institutions around the world. Extensive background in technology entrepreneurship and financial services.",
        "hooks": [
          "*Sold companies to both Motorola and BlackBerry",
          "PhD holder with deep fintech and mobile technology expertise",
          "Strategic consultant to global banks and financial institutions"
        ],
        "li": null
      }
    ],
    "desc": "Payplant LLC is a financial institution founded in 2013 and headquartered in Palo Alto, California, providing growth financing for entrepreneurs by entrepreneurs. The company's flagship product, Pay Me Now, is an on-demand digital invoice-financing service that provides cash to businesses when their customers pay too slowly. Payplant offers invoice financing, PO financing, asset-based lines of credit, short-term loans, app financing for developers, and customized lending products. The company can fund first invoices in 1-2 business days with no minimums or hidden fees, guaranteeing fast funding within 24 hours at rates starting at 1.2%. Payplant has no long-term lockups or monthly minimums and pays most of the invoice amount upfront. Founded by Neerav Beery and Dr. Ronjon Nag, who previously co-founded and sold Cellmania to BlackBerry. Approximately 4 employees.",
    "news": [
      {
        "h": "Payplant launches Pay Me Now on-demand digital invoice-financing service for SMBs",
        "s": "Payplant Press",
        "d": "2018-01-01"
      },
      {
        "h": "Payplant expands asset-based lending and PO financing products for small businesses",
        "s": "Payplant Blog",
        "d": "2023-01-01"
      }
    ],
    "location": "Palo Alto, CA",
    "full_address": "2625 Middlefield Rd 595, Palo Alto, CA 94306",
    "website": "https://www.payplant.com",
    "employees": 4,
    "category": "funder"
  },
  {
    "id": 1353,
    "name": "Payroll Funding Company",
    "leaders": [
      {
        "n": "Will Robins",
        "t": "Founder & President",
        "bg": "Founded Payroll Funding Company in 2003 in Las Vegas, NV. Has led the company for over two decades, building it into a recognized payroll factoring and staffing agency funding provider. The company recently rebranded to 'Ready to Fund' to reflect its expanded services beyond payroll funding. Under his leadership, the company raised $10 million in new debt financing via an SEC-filed exempt offering.",
        "hooks": [
          "Built payroll factoring company over 20+ years since 2003",
          "Led rebrand from Payroll Funding Company to Ready to Fund",
          "Raised $10M in new debt financing via SEC exempt offering"
        ],
        "li": "https://www.linkedin.com/in/will-robins-73096519/"
      },
      {
        "n": "Susannah Albright",
        "t": "CEO",
        "bg": "Serves as CEO of Payroll Funding Company (now Ready to Fund). Based in Princeton, NJ. Leads the company's operations and strategic direction as it expands beyond payroll funding into broader business financing solutions. Oversees the company's online lending platform and staffing agency funding operations.",
        "hooks": [
          "Princeton, NJ-based CEO leading payroll-to-broader funding transition",
          "Driving Ready to Fund rebrand and expanded product portfolio"
        ],
        "li": null
      }
    ],
    "desc": "Payroll Funding Company, now rebranded as Ready to Fund, is an online lending platform founded in 2003 by Will Robins, headquartered in Las Vegas, NV. The company specializes in payroll factoring and funding for staffing agencies, helping businesses meet payroll obligations by purchasing their accounts receivable at a discount. The company provides immediate cash advances typically between 75-95% of invoice value, often within 24 hours, allowing staffing companies to pay workers weekly while waiting 30-90 days for client payments. The rebrand to Ready to Fund reflects the company's expanded commitment to providing solutions beyond payroll funding, including working capital and short-term business financing. The company filed an SEC exempt offering to raise $10 million in new debt financing in 2024. Approximately 15 employees.",
    "news": [
      {
        "h": "Payroll Funding Company rebrands to Ready to Fund to reflect expanded services",
        "s": "Ready to Fund",
        "d": "2024-01-01"
      },
      {
        "h": "Payroll Funding files SEC exempt offering to raise $10 million in new debt financing",
        "s": "Intelligence360 / SEC Filing",
        "d": "2024-01-24"
      },
      {
        "h": "Payroll Funding Company expands partnership development team with new VP appointments",
        "s": "AccessNewsWire",
        "d": "2024-01-01"
      }
    ],
    "location": "Las Vegas, NV",
    "full_address": "900 Las Vegas Blvd S, Unit 802, Las Vegas, NV 89101",
    "website": "https://payrollfunding.com",
    "employees": 15,
    "category": "funder"
  },
  {
    "id": 1354,
    "name": "Paz Funding Source",
    "leaders": [
      {
        "n": "Ariel Hanasabzadeh",
        "t": "Manager & Co-Founder",
        "bg": "Co-founded Paz Funding Source LLC in September 2020 in Los Angeles, CA. Serves as Manager and registered agent for the company. Part of the founding team of seasoned MCA professionals who built the company on a foundation of trust, experience, and genuine care. Runs Paz Funding as a family-operated business serving entrepreneurs nationwide with merchant cash advances and working capital solutions.",
        "hooks": [
          "Built family-run MCA business from ground up in 2020",
          "Seasoned MCA professional with deep industry connections",
          "Los Angeles-based funder serving nationwide entrepreneurs"
        ],
        "li": null
      },
      {
        "n": "Elkhanan Hanasabzadeh",
        "t": "Manager & Co-Founder",
        "bg": "Co-founded Paz Funding Source LLC in September 2020 alongside Ariel Hanasabzadeh in Los Angeles. Serves as Manager of the company. Brings MCA industry expertise to the family-run funding operation. Focuses on building long-term relationships with business owners seeking alternative financing solutions.",
        "hooks": [
          "Co-founder of family-operated MCA business",
          "MCA veteran focused on relationship-driven funding"
        ],
        "li": null
      }
    ],
    "desc": "Paz Funding Source LLC is a merchant cash advance provider founded in September 2020 by a group of seasoned MCA professionals in Los Angeles, CA. The company offers unsecured working capital solutions for small to mid-sized businesses throughout the United States, with funding decisions in as little as 24 hours. Paz Funding Source is a family-run funding partner that serves entrepreneurs nationwide across industries including entertainment, hospitality, retail, healthcare, and professional services. The company provides strategic growth capital for stable, profitable businesses through alternative business financing with fast approvals and flexible terms. Listed with the BBB in Los Angeles as an asset-based lending company. Approximately 10 employees.",
    "news": [
      {
        "h": "Paz Funding Source expands merchant cash advance offerings nationwide from Los Angeles HQ",
        "s": "BBB / Company Website",
        "d": "2023-01-01"
      },
      {
        "h": "Paz Funding Source LLC established in Los Angeles as family-run MCA provider",
        "s": "Bizapedia / State Filing",
        "d": "2020-09-01"
      }
    ],
    "location": "Los Angeles, CA",
    "full_address": "11150 W Olympic Blvd, Suite 950, Los Angeles, CA 90064",
    "website": "https://pazfundingsource.com",
    "employees": 10,
    "category": "funder"
  },
  {
    "id": 1355,
    "name": "PEAC Solutions",
    "leaders": [
      {
        "n": "Bill Stephenson",
        "t": "Global CEO",
        "bg": "Serves as Global CEO of PEAC Solutions, focused on expanding and integrating PEAC's global footprint. Over four decades of experience in the leasing industry, including eight years as CEO and Chairman of the Executive Board of DLL. Former Chairman of the Equipment Leasing and Financing Association (ELFA). Named 'Leasing CEO of the Decade (2010-2020)' by MonitorDaily. In November 2023, was the inaugural inductee into the 'Leasing Life Hall of Fame'. Alumnus of Florida State University and graduate of Harvard Business School's Advanced Management Program.",
        "hooks": [
          "*Named 'Leasing CEO of the Decade' by MonitorDaily",
          "*Inaugural inductee into Leasing Life Hall of Fame (2023)",
          "Harvard Business School Advanced Management Program graduate",
          "Former CEO of DLL for eight years"
        ],
        "li": "https://www.linkedin.com/in/william-f-stephenson-26473422/"
      },
      {
        "n": "Eileen Schoonmaker",
        "t": "President of the Americas",
        "bg": "Joined PEAC Solutions in June 2025 as President of the Americas, overseeing all aspects of operations including Risk Management, Sales Support, Customer Care, Collections, Asset Management, Legal, IT, Finance, and Human Resources. Over 35 years of experience in the leasing and financial services industry. Previously served as President and General Manager at DLL, responsible for a national operations hub with more than 700 employees. Recognized as one of the 'Top 50 Women in Finance' by MonitorDaily.",
        "hooks": [
          "*Named Top 50 Women in Finance by MonitorDaily",
          "Managed 700+ employee operations hub at DLL",
          "35+ years in leasing and financial services"
        ],
        "li": "https://www.linkedin.com/in/eileen-schoonmaker-6287448/"
      }
    ],
    "desc": "PEAC Solutions is a major multi-national asset finance platform owned by funds managed by HPS Investment Partners LLC, operating across 13 countries in Europe, the United Kingdom, and the United States. Headquartered in Mount Laurel, New Jersey, the company specializes in originating and servicing high-volume, small-ticket leases and loans, and provides innovative finance solutions to equipment manufacturers, distributors, dealers, and vendors. PEAC has been recognized by ELFA for 25 years of membership and celebrated unprecedented U.S. growth in 2024. In 2025, the company completed the acquisition of ePlus Finance subsidiaries, expanding its IT finance portfolio and reach into U.S. Federal, State, and Local government sectors. PEAC also acquired IT subscription and rental platform provider topi and ABN AMRO UK's leasing business. In early 2026, PEAC closed a $681 million ABS deal backed by equipment leases and loans. Under CEO Bill Stephenson ('Leasing CEO of the Decade'), the company continues aggressive expansion. Approximately 374 employees.",
    "news": [
      {
        "h": "PEAC Solutions finalizes first U.S. securitization transaction of 2026 — $681M ABS deal",
        "s": "Equipment Finance News",
        "d": "2026-01-01"
      },
      {
        "h": "PEAC Solutions completes acquisition of ePlus Finance subsidiaries",
        "s": "Leasing Life / ePlus PR",
        "d": "2025-07-01"
      },
      {
        "h": "PEAC Solutions acquires IT subscription and rental platform provider topi",
        "s": "PEAC Solutions Press",
        "d": "2025-01-01"
      },
      {
        "h": "PEAC Solutions appoints Eileen Schoonmaker as President of the Americas",
        "s": "Yahoo Finance / MHEDA",
        "d": "2025-06-16"
      }
    ],
    "location": "Mount Laurel, NJ",
    "full_address": "300 Fellowship Rd, Mount Laurel, NJ 08054",
    "website": "https://peacsolutions.com",
    "employees": 374,
    "category": "funder"
  },
  {
    "id": 1356,
    "name": "PharmLine",
    "leaders": [
      {
        "n": "Karl Kipke",
        "t": "CEO",
        "bg": "Co-founded HealthGrowth Capital (parent of PharmLine) in 2016 with Gregg R. Honigblum. Serves as CEO of HealthGrowth Pharmacy Solutions, LLC. Based in Austin, TX. Over 40 years of experience in investment banking, asset management, and venture capital. Has played key operating roles in numerous companies across a range of industries. Instrumental in establishing, funding, scaling, and selling successful businesses by leveraging his financial expertise and strategic vision. Led the company's $16.8 million financing in April 2020.",
        "hooks": [
          "40+ years in investment banking, asset management, and venture capital",
          "Led $16.8M financing for HealthGrowth Capital in 2020",
          "Serial entrepreneur — established, scaled, and sold multiple businesses"
        ],
        "li": "https://www.linkedin.com/in/karl-kipke-7545665/"
      },
      {
        "n": "Gregg R. Honigblum",
        "t": "Co-Founder",
        "bg": "Co-founded HealthGrowth Capital in 2016 alongside Karl Kipke. Has a background in healthcare financial services. Also serves as Chief Investment Officer at Sintx Technologies Inc. according to LinkedIn. Played a key role in creating the first revolving line of credit dedicated to community pharmacies through the PharmLine product launched in partnership with Lendistry in 2018.",
        "hooks": [
          "Created the first revolving line of credit dedicated to community pharmacies",
          "Chief Investment Officer at Sintx Technologies",
          "Pioneer in pharmacy-specific financial products"
        ],
        "li": "https://www.linkedin.com/in/gregg-honigblum/"
      },
      {
        "n": "Steven Cava",
        "t": "Vice President of Pharmacy Performance",
        "bg": "Serves as VP of Pharmacy Performance at HealthGrowth Pharmacy Solutions. Over 20 years of pharmacy experience across nearly every pharmacy role. Pursued a law degree and is licensed to practice in Washington, D.C. Offers a unique perspective on standards of care, contracts, and regulatory forces shaping the pharmacy landscape.",
        "hooks": [
          "20+ years in pharmacy with law degree — licensed in D.C.",
          "Unique dual pharmacist-attorney perspective on healthcare regulations"
        ],
        "li": null
      }
    ],
    "desc": "PharmLine is the flagship product of HealthGrowth Capital, LLC (operating as HealthGrowth Pharmacy Solutions), a direct lender to community pharmacies headquartered in Austin, Texas. PharmLine was launched in 2018 in partnership with Lendistry as the first revolving line of credit dedicated to independent community pharmacies, offering up to $500,000 for well-qualified borrowers (up to $1 million in some cases) with closings in 1-3 business days. The company offers a full range of financial products including PharmLine lines of credit, SBA loans, PPP disaster relief loans, asset-backed loans, and equipment finance. HealthGrowth also provides strategic consulting and advisory services through HealthGrowth Advisors, helping pharmacy owners maximize profitability by streamlining operations and improving reimbursements. Co-founded in 2016 by Gregg R. Honigblum and Karl Kipke. Closed a $16.8 million financing in April 2020. Pharmacy Development Services (PDS) has recommended HealthGrowth Capital. Approximately 20 employees.",
    "news": [
      {
        "h": "HealthGrowth Capital closes $16.8 million financing for pharmacy lending expansion",
        "s": "PR Newswire",
        "d": "2020-04-01"
      },
      {
        "h": "Pharmacy Development Services recommends HealthGrowth Capital for community pharmacy funding",
        "s": "Marketers Media",
        "d": "2019-01-01"
      },
      {
        "h": "HealthGrowth Capital and Lendistry launch PharmLine — first revolving credit line for community pharmacies",
        "s": "PR Newswire",
        "d": "2018-10-01"
      }
    ],
    "location": "Austin, TX",
    "full_address": "925 S Capital of Texas Hwy, Austin, TX 78746",
    "website": "https://pharmline.com",
    "employees": 20,
    "category": "funder"
  },
  {
    "id": 1357,
    "name": "Pinnacle Advances",
    "leaders": [],
    "desc": "Pinnacle Advances is a financial services company founded in 2010 and headquartered in Miami, Florida, specializing in small business lending and working capital solutions. The company works with businesses ranging from small to medium corporations, prioritizing the success of small businesses with instant decision-making and fair financing options. Pinnacle Advances offers merchant cash advances and business funding with a simple application process, no credit checks required, and approval for up to $5 million in working capital. Funding can be provided in under 24 hours and same-day funding is available for many clients. The company has operations in both Miami and New York, with a physical presence at 7519 147 St in Queens, NY (Pinnacle Business Funding, a related entity). Management team has over 40 years of combined experience. Note: Pinnacle Advances and Pinnacle Business Funding appear to be related entities operating in the MCA space. Approximately 75 employees.",
    "news": [
      {
        "h": "Pinnacle Advances expands small business funding operations with instant approval decisions",
        "s": "LinkedIn / Company Website",
        "d": "2024-01-01"
      },
      {
        "h": "Pinnacle Business Funding opens Queens, NY location for merchant cash advance services",
        "s": "Yelp / Local Listings",
        "d": "2023-01-01"
      }
    ],
    "location": "Miami, FL",
    "full_address": "Miami, FL 33160",
    "website": "https://www.pbffunding.com",
    "employees": 75,
    "category": "funder"
  },
  {
    "id": 1358,
    "name": "Pioneer Legal Funding",
    "leaders": [],
    "desc": "Pioneer Legal Funding is a litigation finance company that provides pre-settlement cash advances to plaintiffs with pending litigation claims. The company also provides litigation funding to corporate plaintiffs and attorneys. For individual plaintiffs, Pioneer offers non-recourse cash advances from $500 to $100,000+ within 24 hours of approval, with rates ranging from 17-21% for every 6 months (non-compounding), typically limited to 5-10% of estimated case value. For attorneys and law firms, they provide $500 to $1M+ within 24 hours. For corporate plaintiffs, Pioneer provides non-recourse capital from $10,000 to $1M+ directly to businesses or their outside counsel to finance costs of pending commercial claims. The company's mission is to increase access to justice by providing capital solutions for plaintiffs awaiting settlement. Pioneer has a team of knowledgeable underwriters, paralegals, and attorneys, and has earned a reputation working with hundreds of law firms and thousands of plaintiffs across all types of injury claims. Limited public information on leadership and company size.",
    "news": [
      {
        "h": "Pioneer Legal Funding expands corporate plaintiff funding program up to $1M+",
        "s": "Company Website",
        "d": "2024-01-01"
      },
      {
        "h": "Pioneer Legal Funding launches enhanced pre-settlement funding application portal",
        "s": "Pioneer Legal Funding",
        "d": "2023-01-01"
      }
    ],
    "location": "United States",
    "full_address": "United States",
    "website": "https://www.pioneerlegalfunding.com",
    "employees": 15,
    "category": "funder"
  }
]
